{"angie.lioni@anz.com":{"simplified_title":"Associate Director","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ANZ recently posted a notice about the increase in sophisticated scams and is providing information on how to protect oneself from them. They are also promoting a new product, ANZ Plus, which is designed to build better financial habits. In addition, they provide updates, tips, and support on home loan rate changes.","notable_details":"ANZ offers a Financial Wellbeing Program to help customers improve their financial behaviors and get back on track. They also offer a Smart Choice Super product, a suite aimed at pensioners and employers.","focus":"Full Service"},"brett.lumsden@anz.com":{"simplified_title":"Head of Commercial","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ANZ has recently been focusing on educating their customers about the increasing complexity of scams. They have also launched ANZ Plus, a new product designed to enhance financial habits and wellbeing. Additionally, they are offering a new home loan with discounted interest rates and no ongoing fees.","notable_details":"The ANZ bank has a focus on financial wellbeing, offering customers a range of tools and programs to improve financial behaviours. They also have a mobile app which allows customers to activate cards, set savings goals, and more.","focus":"Full Service"},"alana.sheeran@anz.com":{"simplified_title":"Director","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking industry","type_of_bank":"Commercial Bank","news":"ANZ has posted about growing concerns regarding scams, which are growing more complex and sophisticated. They have also updated their site with information regarding their ANZ Smart Choice Super product and discounted home loan rates.","notable_details":"The bank offers a program called 'ANZ Plus' which is designed to help build better financial habits and improve financial wellbeing. They also have a special focus on financial wellbeing and offer a variety of tools and resources to help customers improve their financial behaviors.","focus":"Full Service"},"david.halstead@anz.com":{"simplified_title":"Associate Director","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial bank","news":"ANZ has posted an important notice about scams becoming more complex and sophisticated. They are offering information to help customers learn about protecting themselves from scams. They are also offering discounted home loan rates with no ongoing fees and an interest on ANZ Advance notice term deposits with a 12-month term.","notable_details":"ANZ is focusing on promoting their Smart Choice Super product which can be set up in just five minutes, in app or online. They are also offering an ANZ Plus product that is designed to build better financial habits and improve users' financial wellbeing.","focus":"Full service"},"claire.witherick@anz.com":{"simplified_title":"Associate Director","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ANZ has been alerting the public about increasing scams that are growing more complex and sophisticated. They recently launched ANZ Plus, designed to build better financial habits and improve financial wellbeing. They also offer new discounted home loan rates with no ongoing fees.","notable_details":"ANZ has a strong emphasis on financial wellbeing and education. They offer a Financial Wellbeing Program to help customers improve their financial behaviours. They also provide support for those experiencing financial hardship.","focus":"Full Service"},"dayle.radford@anz.com":{"simplified_title":"Head of Lending Services Credit","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ANZ Bank has recently posted articles about growing online scams, reminding customers to be vigilant and protect themselves. They have also introduced ANZ Plus, a new function designed to enhance their customers' financial habits. Other notable updates include the launch of a new home loan application that can be completed in just 5 minutes.","notable_details":"ANZ Bank offers a range of financial products and services, including superannuation, home loans, personal loans, and banking accounts. They also provide a range of digital banking tools, such as their ANZ App, which offers features like card activation, PIN setting, spending tracking, and savings goals setting. They have a strong focus on financial wellbeing, providing resources and programs to help customers manage their finances better.","focus":"Full Service"},"austin.lobo@anz.com":{"simplified_title":"Head of Customer Lending Assessment","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking industry","type_of_bank":"Commercial bank","news":"ANZ warns about growing complexity and sophistication of scams, urging customers to stay aware and protect themselves. They also provide updates and support on home loan rate changes following the most recent RBA cash rate change, explaining what it means for customers and how they can manage their home loan repayments.","notable_details":"ANZ offers a product called 'ANZ Smart Choice Super' which is designed to help customers with their financial wellbeing and retirement planning. They also offer a service called 'ANZ Plus', designed to build better financial habits and take financial wellbeing to the next level.","focus":"Full service bank"},"amika.morriss@anz.com":{"simplified_title":"Head of Lending Services","simplified_name":"ANZ","industry":"Banking","spoken_industry":"the banking industry","type_of_bank":"Commercial bank","news":"Recently, ANZ has issued an alert about the increase in sophisticated scams and emphasized the importance of understanding how to protect oneself. It has also introduced 'ANZ Plus', a new feature aimed at helping customers build better financial habits and improve their financial wellbeing. Additionally, the bank is keeping its customers informed about changes in home loan rates, providing updates, tips, and support to ensure they are financially confident and on top of their loan repayments.","notable_details":"ANZ offers a variety of products and services including discounted home loan rates, ANZ Advance Notice Term Deposits, personal loans, credit cards with low ongoing interest rates, and an easy setup for ANZ Smart Choice Super, a superannuation product. They also seem highly focused on financial wellbeing of their customers, offering a Financial Wellbeing Program and providing support for those experiencing financial hardship.","focus":"Full Service"},"chaitanya.cherukumilli@anz.com":{"simplified_title":"Global Initiative Lead","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ANZ has posted about the growing sophistication of scams and the importance of protecting oneself. They are also advertising their ANZ Smart Choice Super, a low rate credit card with two offers to choose from, and a new initiative called ANZ Plus designed to build better financial habits. They have provided updates on home loan rate changes following the most recent RBA cash rate change.","notable_details":"The bank is highlighting their financial wellbeing program, aimed at improving financial behaviors. They also offer a variety of digital banking tools and services, including the ANZ App. They seem to be focusing on customer education and empowerment, emphasizing the importance of understanding interest rates and managing home loan repayments.","focus":"Full-Service Bank"},"david.pilcher@anz.com":{"simplified_title":"Head of Technology","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ANZ has been advising its customers about the growing complexity and sophistication of scams, urging them to learn more about protecting themselves. The bank also has a new product called ANZ Smart Choice Super which can be set up in just five minutes, in app or online. They are also offering discounted home loan rates and interest on ANZ Advance Notice Term Deposits with a 12-month term.","notable_details":"ANZ has a special focus on financial wellbeing, offering tools and advice to help improve financial behaviours and manage financial goals effectively. They also have a product called ANZ Plus that is designed to build better financial habits. ANZ has issued a warning of scams and provided valuable information to its customers on how to stay alert.","focus":"Full Service"},"gerard.mckee@anz.com":{"simplified_title":"Head of Strategy","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"Scams are growing more complex and sophisticated and there is a need for increased protection from them. ANZ has also introduced a new ANZ Plus account, designed to build better financial habits.","notable_details":"ANZ provides a 'Financial Wellbeing Program' to help improve customers' financial behaviours and also has a notable focus on digital banking with mobile payments and an app with various functionalities.","focus":"Full service"},"ilija.oraceski@anz.com":{"simplified_title":"Wholesale Digital Director","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ANZ recently posted a warning about the growing complexity and sophistication of scams and encouraged customers to learn more about protecting themselves. They also introduced a product called ANZ Plus, designed to help customers build better financial habits and improve their financial wellbeing.","notable_details":"The ANZ Bank offers a plethora of services including ANZ Smart Choice Super, home loans, personal loans, credit cards, and even financial wellbeing programs. They also have a strong emphasis on customer education regarding scams and financial wellbeing.","focus":"Full Service"},"jarrad.oberhardt@anz.com":{"simplified_title":"Director of Credit","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking services","type_of_bank":"Commercial Bank","news":"ANZ has posted a warning about the increasing complexity and sophistication of scams. They have also introduced ANZ Plus, a new system designed to build better financial habits and improve financial wellbeing.","notable_details":"ANZ offers a program called 'Financial Wellbeing' designed to help customers improve their financial behaviors and reach their financial goals. They also offer a suite of products under 'ANZ Smart Choice Super', which is aimed at improving superannuation for employers and employees.","focus":"Full Service"},"gary.burton@anz.com":{"simplified_title":"Associate Director","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ANZ has recently posted an important notice about the increase in sophisticated scams, urging customers to learn more about protecting themselves. They have also introduced a new product, ANZ Plus, aimed at helping customers build better financial habits. They've highlighted a warning regarding home loan rate changes, encouraging customers to stay financially confident and on top of their loan repayments.","notable_details":"ANZ offers a range of products and services beyond traditional banking, such as the ANZ Smart Choice Super, an easy-to-set-up superannuation product. They also provide an ANZ App, which has features like activating an eligible card, setting a PIN, understanding spending, and setting a savings goal.","focus":"Full Service Bank"},"geof.lord@anz.com":{"simplified_title":"Director","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking sector","type_of_bank":"Commercial Bank","news":"ANZ bank has recently emphasized the importance of staying alert to scams. The bank has also launched ANZ Plus, a new tool designed to build better financial habits and enhance financial wellbeing. Additionally, they have highlighted their discounted home loan rates and the opportunity to earn interest on ANZ Advance Notice Term Deposits with a 12-month term.","notable_details":"ANZ Bank offers a variety of services including personal loans, credit cards, and home loans. They also have a Financial Wellbeing Program aimed at improving customers' financial behaviours. One interesting detail is the ANZ Smart Choice Super, which is a suite of products designed for financial planning and retirement.","focus":"Full Service"},"giselle.awad@anz.com":{"simplified_title":"Head of Digital Distribution","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ANZ Smart Choice Super is a new product set up in just five minutes, in app or online. Customers can enjoy the certainty of a higher competitive fixed interest rate than comparable ANZ Term Deposits in return for giving 31 days' notice if they want to withdraw funds prior to maturity. There are updates, tips and support on home loan rate changes. ANZ also offers advice for financial well-being and protection against scams.","notable_details":"ANZ offers an ANZ Plus product, which is smart, secure and designed to build better financial habits. They also provide ANZ Advance Notice Term Deposits with a 12-month term that has a higher competitive fixed interest rate. ANZ is also taking measures to educate their customers about scams.","focus":"Full Service Bank"},"jason.wadley@anz.com":{"simplified_title":"Director","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking industry","type_of_bank":"Commercial Bank","news":"ANZ is warning clients about increasingly complex and sophisticated scams. They are also promoting their 'ANZ Smart Choice Super' product, which can be set up in just five minutes. They're also offering discounted home loan rates with no ongoing fees, and a chance to earn interest on ANZ Advance Notice Term Deposits with a 12-month term.","notable_details":"ANZ has a focus on financial wellbeing, offering resources and programs to help customers improve their financial behaviours. They also provide an ANZ Plus product, designed to build better financial habits and take financial wellbeing to the next level.","focus":"Full Service"},"kumaresh.ponnusamy@anz.com":{"simplified_title":"Head of Engineering","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ANZ is warning customers about growing complexities and sophistication in scams. They are also offering discounted home loan rates with no ongoing fees and a 12-month term deposit with a higher fixed interest rate for customers who give a 31-day notice before withdrawal.","notable_details":"ANZ is focusing on the financial well-being of its customers. They are also offering a new product called ANZ Plus which is designed to help customers build better financial habits.","focus":"Full service"},"kristy.pattison@anz.com":{"simplified_title":"Associate Director","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking services","type_of_bank":"Commercial Bank","news":"ANZ offers discounted home loan rates with no ongoing fees and interest on Advance Notice Term Deposits with a 12-month term. They also provide personal loans for life events such as car purchase, wedding or vacations. They have also issued a warning about scams becoming more sophisticated.","notable_details":"ANZ provides a 'Smart Choice Super' product which can be set up in just five minutes. They also offer a product named 'ANZ Plus', which is designed to help improve financial habits and promote financial wellbeing.","focus":"Full Service"},"Jeremy.b@anz.com":{"simplified_title":"Director","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"Scams are growing ever more complex and sophisticated. ANZ has posted an important notice to educate customers about protecting themselves from scams. The bank has also launched ANZ Plus, a smart and secure tool designed to build better financial habits.","notable_details":"ANZ offers a product named 'ANZ Smart Choice Super', which is a suite of products to assist with retirement planning. They also have an app that helps the customers understand their spending, set savings goals, and more. Moreover, they offer assistance to customers who are experiencing financial difficulties.","focus":"Full-service"},"manoj.kumar@anz.com":{"simplified_title":"Head of Lending Operations","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ANZ has recently posted about the increase in scams that are growing more complex and sophisticated, and is providing information on how to protect oneself. There are also updates about discounted home loan rates with no ongoing fees, and the ability to earn interest with ANZ Advance Notice Term Deposits with a 12-month term.","notable_details":"ANZ has a unique Financial Wellbeing program aimed to improve customers' financial behaviours and help them get back on top of things at their own pace. They also have ANZ Plus, a smart and secure platform designed to build better financial habits.","focus":"Full Service Bank"},"rhonda.mccann@anz.com":{"simplified_title":"Head of Lending Services","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ANZ has posted updates on its website about the growing complexity and sophistication of scams, urging customers to educate themselves on how to protect their finances. They have also highlighted a new feature, ANZ Plus, aimed at promoting better financial habits and enhancing financial wellbeing.","notable_details":"ANZ also offers a product called ANZ Smart Choice Super, a suite of products designed to aid in retirement planning. The bank emphasizes its focus on financial wellbeing, offering support and resources to help customers improve their financial behaviors. ANZ also has a Financial Hardship program for customers struggling with loan repayments.","focus":"Full Service"},"aisake.mausio@anz.com":{"simplified_title":"Head of Digitalization Pacific","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking services","type_of_bank":"Commercial Bank","news":"ANZ has been alerting their customers about a rise in scams and advising them on how to protect themselves. They have also launched ANZ Plus, a new service designed to improve financial habits and wellbeing. They have also recently introduced discounted home loan rates without any ongoing fees.","notable_details":"ANZ offers a unique product called 'ANZ Smart Choice Super', aimed at making superannuation easy to set up and manage. They also have a strong focus on financial wellbeing, offering resources, tips, and programs to help their customers improve their financial habits.","focus":"Full service"},"samya.assaad@anz.com":{"simplified_title":"Head of National Business Centre Lending","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"Scams are growing ever more complex and sophisticated. ANZ advises customers to learn more about protecting themselves from scams. ANZ now offers discounted home loan rates with no ongoing fees. They also have a new option for term deposits with a higher fixed interest rate in return for a 31 days' notice for withdrawal. ANZ is introducing ANZ Plus, a smart and secure platform designed to build better financial habits.","notable_details":"ANZ offers a 'Financial Wellbeing Program' to help their customers understand and improve their financial behaviors. They also have an offering called 'ANZ Smart Choice Super', a suite of products designed for retirement planning. ANZ's low rate credit card currently features two offers – a balance transfer offer or a credit-back-to-your-card offer.","focus":"Full Service"},"david.gascoigne@anz.com":{"simplified_title":"Head of Digital Services","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial bank","news":"ANZ has posted a notice about the increasing complexity of scams and the importance of protecting oneself. They have also introduced ANZ Plus, a smart and secure financial tool designed to build better financial habits. Furthermore, they've provided an update on home loan rate changes following the most recent RBA cash rate change, explaining what it means for customers, how they can check their interest rates and options for managing their home loan repayments.","notable_details":"ANZ has a focus on financial wellbeing, offering a program to improve financial behaviors and get back on top of things at one's own pace. They also offer an ANZ Advance Notice Term Deposit, where one could enjoy a higher fixed interest rate in return for giving a 31 day notice if they want to withdraw funds prior to maturity.","focus":"Full service"},"mathew.smith@versent.com.au":{"simplified_title":"State Director Lending Services","simplified_name":"ANZ","industry":"Cloud Services","spoken_industry":"cloud services","type_of_bank":"Not a bank","news":"No recent news posted","notable_details":"Versent has a unique methodology called the 'Yellow Brick Road' for helping businesses transition to the cloud. They also have a significant market presence, working with 40% of the ASX top 100.","focus":"Not applicable"},"michael.bullock@anz.com":{"simplified_title":"CIO","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking services","type_of_bank":"Commercial Bank","news":"The bank has warned its customers about the growing complexity of scams and has provided resources on how to protect oneself from such scams. The bank has also introduced ANZ Plus, designed to build better financial habits and improve financial wellbeing. In addition, the bank offers ANZ Smart Choice Super, a product aimed at providing a simplified and convenient Superannuation solution.","notable_details":"ANZ has a focus on financial wellbeing, providing resources and tools to educate their customers about financial management. They also have a unique product called ANZ Smart Choice Super which simplifies the process of setting up Superannuation.","focus":"Full-service bank"},"richard.copus@anz.com":{"simplified_title":"Head of Digital Innovation","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ANZ has recently posted about the increase in scams, advising customers to learn more about protecting themselves. They have also introduced ANZ Plus, a new product designed to build better financial habits. They are offering discounted home loan rates with no ongoing fees, and have introduced an ANZ Advance Notice Term Deposit with a higher fixed interest rate for a 12-month term.","notable_details":"ANZ offers a service called 'ANZ Smart Choice Super', a suite of products designed for superannuation and pensions. They also have a Financial Wellbeing Program to help customers improve their financial behaviors.","focus":"Full Service"},"sumeet.agarwal@anz.com":{"simplified_title":"SVP","simplified_name":"ANZ","industry":"Banking","spoken_industry":"banking services","type_of_bank":"Commercial Bank","news":"ANZ has recently posted a warning about increasing scams, urging customers to learn more about protecting themselves. They are also offering discounted home loan rates with no ongoing fees and a competitive fixed interest rate on ANZ Advance Notice Term Deposits with a 12-month term.","notable_details":"ANZ is promoting their new ANZ Plus service, designed to help customers build better financial habits. They also offer a Financial Wellbeing Program for customers to improve their financial behaviours and manage repayments better.","focus":"Full Service"},"ehuseyin@australianmilitarybank.com.au":{"simplified_title":"CIO","simplified_name":"Australian Military Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Group Captain John Brooks (Retd) has retired as the Chair of the Australian Military Bank Board. They have updated their Terms and Conditions for Accounts and Access Facilities. Following the announcement by the RBA to lift the cash rate, Australian Military Bank will be making adjustments accordingly. They have been selected by the National Housing Finance and Investment Corporation (NHFIC) to offer home loans under the Federal Government’s Home Guarantee Scheme.","notable_details":"This bank has been serving the Defense community since 1959, making it Australia's longest serving Defence financial institution. They have a blog named Signal where they share news from their community, partners and inside their organisation.","focus":"Full Service"},"matthew.faries@afgonline.com.au":{"simplified_title":"CIO","simplified_name":"AFG","industry":"Finance","spoken_industry":"finance","type_of_bank":"Non-bank","news":"AFG announced an alliance with non-bank lender Brighten Home Loans to fund a white label home loan to join the AFG Home Loans suite of products. This will enable AFG brokers to deliver more choice to their customers.","notable_details":"AFG is committed to creating competition and financial choice for Australians by protecting and backing the broker industry. They offer exclusive access to AFG Home Loans with product options from four lenders. They also have a tool suite called Suite360 specifically designed for brokers.","focus":"Lending and Broker Services"},"ben.jenkins@afgonline.com.au":{"simplified_title":"CFO","simplified_name":"AFG","industry":"Finance and Brokerage","spoken_industry":"finance and brokerage services","type_of_bank":"Non-bank Financial Institution","news":"The AFG has recently announced an alliance with non-bank lender Brighten Home Loans to fund a white label home loan to join the AFG Home Loans suite of products and enable AFG brokers to deliver more choice to their customers.","notable_details":"AFG has been in operation for over 28 years, focusing on creating a fairer financial future for Australians. They provide a comprehensive technology suite for brokers, offering hundreds of learning pathways, webinars, and training events. They have also won the MFAA Aggregator of the Year award.","focus":"Broker technology and support, Mortgage brokerage, Training and development for brokers"},"dmattiskewood@australianmilitarybank.com.au":{"simplified_title":"CEO","simplified_name":"Australian Military Bank","industry":"Banking","spoken_industry":"banking industry","type_of_bank":"Military Bank","news":"On 23 June 2023, they shared some proud news. On 21 June 2023, Group Captain John Brooks (Retd) retired as the Chair of the Australian Military Bank Board. The Terms and Conditions for Accounts and Access Facilities were updated on 13 June 2023. Following the announcement by the RBA on 6 June 2023 to lift the cash rate, Australian Military Bank made some changes.","notable_details":"The bank has been serving the Defence community since 1959, making it Australia's longest serving Defence financial institution. They offer a range of products including home loans, personal and car loans, credit cards, savings accounts, everyday accounts, term deposits, insurance, superannuation. They also participate in the Federal Government’s Home Guarantee Scheme.","focus":"Full Service Bank"},"tony.bird@afgonline.com.au":{"simplified_title":"Head of Risk","simplified_name":"AFG","industry":"Finance and Brokerage","spoken_industry":"financial services and brokerage","type_of_bank":"Not a bank, but a broker","news":"AFG has recently announced an alliance with non-bank lender Brighten Home Loans to fund a white label home loan to join the AFG Home Loans suite of products. Furthermore, they've been awarded the MFAA Aggregator of the Year.","notable_details":"AFG is not just a broker, but also provides a technology suite (Suite360) to support other brokers. They offer their own line of home loan products, and have an extensive lender panel of over 70 lenders across residential, commercial, and personal finance. They're committed to creating a fairer financial future for Australians and protecting the broker industry.","focus":"Brokerage, Financial technology, and Lending"},"david.bailey@afgonline.com.au":{"simplified_title":"CEO","simplified_name":"AFG","industry":"Financial Services","spoken_industry":"financial services industry","type_of_bank":"Non-Bank Financial Institution","news":"AFG has announced an alliance with non-bank lender Brighten Home Loans to fund a white label home loan to join the AFG Home Loans suite of products. This alliance is intended to provide AFG brokers more options to offer their customers. AFG also won the MFAA Aggregator of the year award.","notable_details":"AFG is committed to creating competition and financial choice for Australians by supporting and backing the broker industry. They have developed a comprehensive technology suite, Suite360, designed specifically for brokers. They offer a wide range of services including training, compliance assistance, access to AFG Home Loans and a panel of over 70 lenders. AFG also acknowledges Aboriginal and Torres Strait Islander peoples as the first Australians and the traditional custodians of the land on which their head office is located.","focus":"Lending and Brokerage Services"},"cyates@australianunity.com.au":{"simplified_title":"CEO","simplified_name":"Australian Unity","industry":"Banking, Insurance, Health and Wealth Management","spoken_industry":"banking, insurance, health and wealth management services","type_of_bank":"Member-owned bank","news":"They are celebrating 20 years of wellbeing research and have a special offer of 6 weeks free for those who join their Hospital & Extras insurance by 3 November 2023. Additionally, they have waived all 2 month and optical waiting periods on extras.","notable_details":"Australian Unity has been supporting the wellbeing of Australians since 1840 and is committed to creating positive community and social value. They have been in partnership with Deakin University since 2000 to deliver one of the most credible and enduring studies of wellbeing in Australia.","focus":"Full service"},"mrasmussen@auswidebank.com.au":{"simplified_title":"COO","simplified_name":"Auswide Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":["Finding an easy and secure way to grow your money might sound easier said than done, but if you’ve got some savings set aside, a term deposit could be the solution for you.","If you’re like many Australians who struggle with the cost of living, we’ve put together some tips to help you face rising costs.","It's essential to be aware of tax scams and by understanding the common tactics used by scammers, you can avoid falling victim to them."],"notable_details":"The bank is actively supporting the Maroons sports team. The bank has been providing award-winning banking services for over 55 years.","focus":"Full Service"},"ffloyd@beyondbank.com.au":{"simplified_title":"CIO","simplified_name":"Beyond Bank Australia","industry":"Banking","spoken_industry":"banking","type_of_bank":"Customer-Owned Bank","news":"Beyond Bank was recently awarded 'Most Satisfied Customers' Canstar's Customer-Owned Bank Award 2023. In 2023, they will be giving back over $680,000 to clubs and causes that their customers choose to support through the Community Reward Account.","notable_details":"Beyond Bank is 100% owned by its customers, returning value to the communities in which they live and operate. They also have an award-winning mobile banking app.","focus":"Full service and Community Support"},"geraldwhite@bankofus.com.au":{"simplified_title":"CFO","simplified_name":"Bank of us","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full Service Bank","news":"Bank of us has recently appointed a new Chief Financial Officer. They are also raising awareness on the latest scams through their 'Scam Alerts'.","notable_details":"Bank of us is a trading name of B&E Ltd and is part of a Tasmanian Government initiative, MyHome, aimed at assisting eligible home buyers. The bank is offering special deals for St.LukesHealth members, which include discounts on home loans and residential investment loans, plus bonus rates on term deposits.","focus":"Personal Banking, Lending, Investment Services"},"dmann@australianunity.com.au":{"simplified_title":"CFO","simplified_name":"Australian Unity","industry":"Banking and Insurance","spoken_industry":"banking and insurance services","type_of_bank":"Full Service Bank","news":"Celebrating 20 years of wellbeing research. Health Insurance 6 WEEKS FREE, JOIN HOSPITAL & EXTRAS BY 3 NOVEMBER 2023 PLUS WE’LL WAIVE ALL 2 MONTH AND OPTICAL WAITING PERIODS ON EXTRAS","notable_details":"The bank is member-owned and has been supporting the wellbeing of Australians since 1840, making it one of the oldest financial institutions in the country. They also offer home care services for Aboriginal people, by Aboriginal people.","focus":"Australian Unity focuses on personalised service and competitive rates in banking. They also offer a wide range of insurance policies, investment options, financial advisory and trustee services, health insurance, and independent & assisted living services."},"tim.schmidt@bluestone.com.au":{"simplified_title":"Head of Cloud Infrastructure","simplified_name":"Bluestone","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Non-Bank","news":"No recent news posted on the website.","notable_details":"Bluestone Home Loans offers a personalised and streamlined service for home loan approvals. They do not use credit scoring, which provides flexibility to customers with different credit backgrounds. They also cater to a wide range of situations from self-employed individuals to those with a low credit rating or those who have been affected by significant life events. They don't charge Lender's Mortgage Insurance (LMI) but do charge a risk fee on some products.","focus":"Lending, primarily home loans"},"troberts@creditunionsa.com.au":{"simplified_title":"CEO","simplified_name":"Credit Union SA","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Increasing our Mobile and Internet Banking defences","notable_details":"The bank acknowledges the Kaurna peoples as the traditional custodians of the Adelaide plains region, where their branch and Head Office is based. They respect their spiritual relationship with their Country and acknowledge their Elders – past, present and emerging.","focus":"Community support, member priority"},"jtancevs@communityfirst.com.au":{"simplified_title":"CEO","simplified_name":"Community First","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"The bank is introducing a Green Car Loan for brand new hybrid or electric vehicles. Additionally, customers could earn $100 by getting a new low rate credit card approved between 12/7/23 and 12/10/23 and making an eligible transaction in the first 30 days.","notable_details":"The bank is operating under the name Community First Bank but is legally registered as Community First Credit Union Limited. An interesting service they offer is the ability to add the cost of a charging station to their Green Car Loan. They also provide a shopping service with no interest, just a low monthly fee depending on the customer's chosen limit.","focus":"Full Service"},"peterbuzek@gatewaybank.com.au":{"simplified_title":"CTO","simplified_name":"Gateway Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"The bank has recently introduced an Eco Visa Debit Card which is made from plants, not plastic. They also have an upcoming Annual General Meeting in 2023.","notable_details":"Gateway Bank offers a unique product, the EMax Saver, which allows customers to earn up to 3.30% p.a. They also emphasize ethical everyday banking and offer environmentally friendly banking options such as the Eco Visa Debit Card and Green Home Loans.","focus":"Ethical and Eco-friendly banking"},"amehta@gcmutualbank.com.au":{"simplified_title":"CRO","simplified_name":"G&C Mutual Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"G&C Mutual Bank recently sponsored the NSW Ambulance Employee of the Month Awards, honoring the recipients for the first half of 2023. They have also shared updates on the rise of online banking and mobile banking apps, stressing the importance of awareness against the threat of scammers and cybercriminals. The institution was also recognized for offering outstanding value home loans through Canstar’s First Home Buyer Award.","notable_details":"G&C Mutual Bank is a participating lender in the Home Guarantee Scheme, ready to assist customers in their home ownership journey. They have also made strides in digital banking with their mobile app, offering an easy and secure way for customers to manage their finances on the go.","focus":"Full Service"},"cbannister@latrobefinancial.com.au":{"simplified_title":"CLO","simplified_name":"La Trobe Financial","industry":"N/A","spoken_industry":"N/A","type_of_bank":"N/A","news":"N/A","notable_details":"The website content is not accessible due to an Incapsula incident. The incident ID is 1094001270008564315-15588918879985612.","focus":"N/A"},"mbarry@latrobefinancial.com.au":{"simplified_title":"CFO","simplified_name":"La Trobe Financial","industry":"N/A","spoken_industry":"N/A","type_of_bank":"N/A","news":"N/A","notable_details":"The requested website is blocked or unaccessible due to Incapsula incident","focus":"N/A"},"rdonohoue@latrobefinancial.com.au":{"simplified_title":"COO & CRO","simplified_name":"La Trobe Financial","industry":"N/A","spoken_industry":"N/A","type_of_bank":"N/A","news":"N/A","notable_details":"The website content could not be retrieved due to an unsuccessful request. The incident has been identified with Incapsula Incident ID: 1094001270008564315-23161328474922949","focus":"N/A"},"pcbdc@themaccu.com.au":{"simplified_title":"CFO","simplified_name":"The MAC","industry":"Banking","spoken_industry":"the banking industry","type_of_bank":"Credit Union","news":"The Mac has launched a new app experience for its customers.","notable_details":"The Mac is a credit union born from the Macarthur and Wollondilly regions, offering local banking solutions. They are currently offering a discounted basic variable home loan with no establishment fees for a limited time.","focus":"Local Banking, Home Loans"},"craigo@themaccu.com.au":{"simplified_title":"CRO","simplified_name":"The MAC","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"New MAC app experience has arrived, offering no establishment fees for a limited time on first home buyer loans","notable_details":"The bank operates under the registered trademark of Macarthur Credit Union Ltd, it caters primarily to the Macarthur and Wollondilly regions, focusing on delivering friendly, helpful & supportive solutions to its members.","focus":"Full Service"},"davec@themaccu.com.au":{"simplified_title":"CEO","simplified_name":"The MAC","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"The bank has recently launched a new app for Mac users.","notable_details":"The Mac is a credit union that originated from the Macarthur and Wollondilly regions. They offer a unique discounted basic variable home loan.","focus":"They focus on offering friendly, helpful & supportive solutions to help their members achieve their dreams. They are offering a new Mac app experience, and have a special on establishment fees for new home buyers."},"andrew.scafidi@macquarie.com":{"simplified_title":"Head of Commercial Property Finance","simplified_name":"Macquarie Bank","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Commercial Bank","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy"],"notable_details":"Macquarie Bank has a record of 54 years of unbroken profitability with over 20,500 employees globally and $A870.8 billion assets under management. They have a strong presence in 34 markets and are deeply committed to creating a positive social impact.","focus":"Full Service Bank"},"fred@moneyme.com.au":{"simplified_title":"CTO","simplified_name":"MoneyMe","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Digital Bank","news":"They recently won Canstar's Innovation Excellence Award 2022.","notable_details":"The bank has a strong focus on sustainability, having offset carbon emissions equivalent to driving 15,500,000KMS. They also have a personal loan dashboard feature for customers to monitor and manage their loan details.","focus":"Fintech"},"blake.albones@mystate.com.au":{"simplified_title":"Head of Lending Distribution","simplified_name":"MyState Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Internet Bank","news":"There are no recent news updates available on the website.","notable_details":"MyState Bank has been operating for over 60 years and is fully Australian-owned. They offer a 12-month term deposit rate of 4.90% p.a., and a bonus saver account that can earn up to 5.00% p.a. interest. Also, they have a unique approach to banking, using smart tech in their banking accounts to provide personalised insights into customers' money.","focus":"Full Service"},"justine.w@macquarie.com":{"simplified_title":"COO","simplified_name":"Macquarie Bank","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Commercial Bank","news":"Deepening their commitment to Italy, Advancing economic progress – the private sector’s role in connecting communities with capital and innovation, Accelerating the future of UK energy","notable_details":"Macquarie is a global financial services group operating in 34 markets with a track record of 54 years of unbroken profitability. They have over 20,500 employees globally with $A870.8 billion in assets under management.","focus":"Full Service"},"ben.perham@macquarie.com":{"simplified_title":"Head of Personal Banking","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Commercial Bank","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy"],"notable_details":"They have a track record of unbroken profitability for 54 years and have over $A870.8 billion assets under management. They are operating in 34 markets globally.","focus":"Full Service"},"james.low@macquarie.com":{"simplified_title":"Home Lending Director","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Global Financial Services Organisation","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy"],"notable_details":"Operating for 54 years with unbroken profitability, managing over $A870.8 billion assets, and a strong commitment to social impact and diversity in the workplace.","focus":"Full Service"},"pratham.karkal@macquarie.com":{"simplified_title":"Head of Direct Home Loans","simplified_name":"Macquarie Bank","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Global Financial Services Group","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy","At our 2022 Operational Briefing, we showcased our presence and 33 years of growth, innovation and collaboration in Europe, the Middle East and Africa."],"notable_details":"Macquarie Bank has a track record of unbroken profitability for 54 years. They have over 20,500 employees globally and manage assets worth $A870.8 billion.","focus":"Empowering people to innovate and invest for a better future, operating in 34 markets globally"},"sarah.catchpole@macquarie.com":{"simplified_title":"Associate Director","simplified_name":"Macquarie Bank","industry":"Finance","spoken_industry":"financial services","type_of_bank":"Global Financial Services Organisation","news":["Deepening commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy","Showcased presence and 33 years of growth, innovation and collaboration in Europe, the Middle East and Africa at 2022 operational briefing"],"notable_details":["They operate in 34 markets globally","They have shown 54 years of unbroken profitability","$A870.8 billion assets under management","Reports of Macquarie’s name being used to fraudulently solicit payments from investors"],"focus":"Investment and Innovation for Social Impact"},"asciberras@bankvic.com.au":{"simplified_title":"Head of Credit","simplified_name":"BankVic","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"No specific news updates found from the website content.","notable_details":"The bank is 100% owned by its members and all profits are reinvested into the business or the communities they're a part of. The bank is specifically designed to serve police, health, and emergency services.","focus":"Full Service"},"gwenborn@mymove.com.au":{"simplified_title":"CRO","simplified_name":"MOVE bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":[{"title":"Fixed Rate Home Loans Update","published_date":"August 4, 2023","url":""},{"title":"Latest MOVE Life Issue","published_date":"August 3, 2023","url":""}],"notable_details":"MOVE Bank offers a variety of services from home loans, car & personal loans, insurance, to banking & savings. They also provide tools and support for income tax calculation, loan repayment estimation, and financial goal planning. In addition, they're committed to providing their members with competitive rates for their range of savings and loan products.","focus":"Full Service"},"mcurrie@mymove.com.au":{"simplified_title":"CEO","simplified_name":"MOVE bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"They have recently updated a number of their Fixed Rate Home Loans across Owner. Also, they have released the latest MOVE Life issue which includes articles on stepping forward into the new financial year, what's new at MOVE Bank and how to be prepared for this tax season.","notable_details":"MOVE Bank operates as a credit union, focusing on member satisfaction. They also offer innovative payment solutions such as Apple Pay and Google Pay. Their services include home loans, car loans, and personal loans, as well as various financial tools to assist with saving and loan repayment calculations.","focus":"Full Service"},"jurquhart@mymove.com.au":{"simplified_title":"CFO","simplified_name":"MOVE bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":["MOVE Bank has updated a number of their Fixed Rate Home Loans across Owner. Published Date: August 4, 2023","MOVE Life issue is out now! It includes articles on stepping into the new financial year, what's new at MOVE Bank, and being prepared this tax season. Published Date: August 3, 2023"],"notable_details":"MOVE Bank offers a range of services including transactions, savings, loans, and insurance. They also provide unique features like PayID for faster money transfer and Apple Pay or Google Pay for easy and secure payments. They are committed to providing competitive rates for their savings and loan products.","focus":"Full Service"},"awatkin@summerland.com.au":{"simplified_title":"CRO","simplified_name":"Summerland Credit Union","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Credit Union","news":"Summerland will be changing their opening hours at their Ballina, Lismore, Grafton, and Casino branches soon. They also scored the top spot for Excellence in the Sustainability Category at the 2023 Chamber of Commerce.","notable_details":"Summerland Credit Union is a B Corp certified business with a strong commitment to sustainability. They offer eco-friendly options such as an eco home loan. They also have a strong focus on customer service, with many positive testimonials from customers.","focus":"Customer owned, community focused, sustainable banking"},"lindsay.johnston@exent.co":{"simplified_title":"COO","simplified_name":"Southern Cross Credit Union","industry":"Business Transformation Services","spoken_industry":"business transformation services","type_of_bank":"Not a bank","news":"No recent news posted on their website","notable_details":"Exent Pty Ltd has been operating since 2014, serving Fortune 100, Enterprise and Mid-market clients in Australia and New Zealand. They consider themselves the genuine alternative to the Big 4 and the 4 below them, offering the same problem-solving capacity but with a different experience.","focus":"They focus on de-risking, accelerating and assuring transformational outcomes for businesses across multiple sectors. Their services span the complete lifecycle of transformation from strategy to delivery and they integrate several disciplines that are often disconnected to deliver more lasting, whole-of-business outcomes."},"trevor.mcnamara@qbank.com.au":{"simplified_title":"CDO","simplified_name":"MOVE bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full-service Bank","news":"QBANK has recently been awarded three MOZO Experts Choice Awards for their Home Loan products. They have also launched a new Green Car Loan for members purchasing or refinancing an eligible plug-in hybrid electric vehicle (PHEV) or electric vehicle (EV). They are also calling for nominations for the 2023 Everyday Heroes Awards.","notable_details":"QBANK places a strong emphasis on ethical and compliant employment practices and works to maintain an engaged and inclusive workplace. They are committed to social responsibility, environmental sustainability, and financial wellbeing. They have also launched a new QBANK app, making banking more convenient for their users. They acknowledge the Traditional Owners of the lands on which they operate and pay their respects to Elders past, present, and emerging.","focus":"QBANK focuses on full-service banking, offering a variety of services including home loans, car insurance, residential property insurance, savings account, and term deposits. They are committed to serving Queensland, offering support to first home buyers and featuring a variety of home loan options to suit different lifestyles. They also focus on community engagement and social responsibility."},"stuart.edwards@sccu.com.au":{"simplified_title":"CEO","simplified_name":"Southern Cross Credit Union","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":["Offset accounts can help you save thousands on interest and pay your home loan faster without having to work extra hard for it.","At SCCU we believe sports play a big part in both keeping good physical and mental health. We are proud to support the Good Times Running Club, helping them bring more awareness to the benefits of exercising, making a difference for their local community.","Achieving the dream of home ownership can be one of the most exciting times in your life. At times however, it can seem unattainable due to how long it takes to save a deposit. Lenders' Mortgage Insurance (LMI) enables us to accept deposits less than 20% for some home loans."],"notable_details":"Southern Cross Credit Union has been in operation and providing banking services since 1966. They employ over 80 people and are the trusted banking partner of over 20,000 customers. They offer a wide variety of services including home loans, personal loans, everyday banking, insurance, business banking, and more. They also have a community focus, supporting local initiatives such as the Good Times Running Club.","focus":"Full Service"},"dkildea@summerland.com.au":{"simplified_title":"COO","simplified_name":"Summerland Credit Union","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Credit Union","news":"Summerland Credit Union has recently scored the top spot for Excellence in the Sustainability Category at the 2023 Chamber of Commerce awards. They are also changing their opening hours at their Ballina, Lismore, Grafton, and Casino branches.","notable_details":"Summerland Credit Union is a customer-owned financial institution with a strong ethical rating. It is also a B Corp certified business, which reflects its commitment to balance profit and purpose. They offer eco-friendly home loans and are committed to environmental sustainability.","focus":"Full Service, Sustainability"},"brett.myles@sccu.com.au":{"simplified_title":"CFO","simplified_name":"Southern Cross Credit Union","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":["Offset accounts can help you save thousands on interest and pay your home loan faster without having to work extra hard for it.","At SCCU they believe sports play a big part in both keeping good physical and mental health. They are proud to support the Good Times Running Club, helping them bring more awareness to the benefits of exercising, making a difference for their local community.","Achieving the dream of home ownership can be one of the most exciting times in your life. At times however, it can seem unattainable due to how long it takes to save a deposit. Lenders' Mortgage Insurance (LMI) enables them to accept deposits less than 20% for some home...","With the property market in a growth phase, rental vacancies at all-time lows and staycations replacing overseas travel, many people are considering this as an opportune time to enter the investment property market."],"notable_details":"Southern Cross Credit Union has been in operation and providing banking services since 1966. They employ over 80 people and are the trusted banking partner of over 20,000 customers. They are a community-based organization focused on providing responsible and relevant banking.","focus":"Full Service"},"mromeo@tmbl.com.au":{"simplified_title":"Head of Credit","simplified_name":"Teachers Mutual Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"No recent news posted on the website.","notable_details":"Teachers Mutual Bank Limited operates multiple divisions including Health Professionals Bank, Firefighters Mutual Bank, UniBank, and Hiver Bank. They also acknowledge and respect the Traditional Custodians of Country throughout Australia.","focus":"Full service"},"gsmith@tmbl.com.au":{"simplified_title":"CIO","simplified_name":"Teachers Mutual Bank","industry":"Banking","spoken_industry":"banking services","type_of_bank":"Mutual Bank","news":"No recent news posted on the website.","notable_details":"Teachers Mutual Bank Limited acknowledges the Traditional Custodians of Country through Australia and their continuing connection to land, water and communities. They pay respects to Aboriginal and Torres Strait Islander cultures and extend that respect to all Aboriginal and Torres Strait Islander peoples today. They have various divisions such as Health Professionals Bank, Firefighters Mutual Bank, UniBank, and Hiver Bank.","focus":"Full Service"},"nkenzler@tmbl.com.au":{"simplified_title":"CSO","simplified_name":"Teachers Mutual Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"No recent news posted on the website.","notable_details":"The bank is dedicated to key workers such as teachers, health professionals, firefighters, and university personnel. They acknowledge and respect the traditional custodians of the country, showing a strong commitment to social responsibility. They also have multiple divisions like Teachers Mutual Bank, Health Professionals Bank, Firefighters Mutual Bank, UniBank, and Hiver Bank.","focus":"Full Service"},"richard.sleep@adelaidebank.com.au":{"simplified_title":"Regional Manager","simplified_name":"Adelaide Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"The bank has recently upgraded its online banking system to improve user experience.","notable_details":"Bendigo and Adelaide Bank acknowledges Aboriginal and Torres Strait Islander peoples as the First Peoples of this nation and the Traditional Custodians of the land where they live, learn and work.","focus":"Full Service"},"joanna.potter@asb.co.nz":{"simplified_title":"Senior Product Manager","simplified_name":"ASB","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"No specific news items available based on the provided website content.","notable_details":"The website suggests that ASB Bank has a variety of online services including FastNet Classic, FastNet Business, and Online Share Trading","focus":"Full Service"},"vmcfarlane@bankwaw.com.au":{"simplified_title":"CFO","simplified_name":"WAW Credit Union","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"The BankWAW Annual General Meeting (AGM) will be held on 15 November 2023. Nominations for directors must be lodged by 5.00pm on Thursday 31 August 2023. They also have a special offer of 4.75% p.a. for a 4-month term deposit of $1,000 or more.","notable_details":"BankWAW is a community-owned Australian credit union that invests five percent of its profit back into the community via the WAW Community Fund. Furthermore, they have a strong environmental focus and support initiatives to conserve and restore local bushland.","focus":"Full Service"},"helen.michael@arabbank.com.au":{"simplified_title":"COO","simplified_name":"Arab Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"Arab Bank Australia Limited has recently made changes to their cheque services. They have also announced the relocation of their Parramatta Branch to Level 7, 20 Smith Street, Parramatta, which will now be operating as a Banking Suite.","notable_details":"Arab Bank Australia Limited, also known as abal banking, offers a range of banking services including term deposits, home loans, and business accounts. They have a strong focus on community involvement, partnering with local community groups and charitable organisations. They also offer an award-winning Business Online Savings Account and have been recognised by Rate City & Mozo for their term deposits.","focus":"Full-service Bank"},"james.gow@arabbank.com.au":{"simplified_title":"CRO","simplified_name":"Arab Bank","industry":"Banking","spoken_industry":"banking services","type_of_bank":"Commercial Bank","news":["The bank has made changes to their cheque services.","Arab Bank Australia Limited has launched new and improved online and mobile app features.","An announcement about the relocation of Parramatta Branch to Level 7, 20 Smith Street, Parramatta where it will now be operating as a Banking Suite. Appointments will need to be made for service."],"notable_details":["The bank has been awarded Outstanding Value by CANSTAR for their Business Online Savings Account.","They offer a variety of services and tools that allow for an estimated loan repayment or the calculation of interest on deposits.","It is community-focused, supporting medical research, health and wellbeing, sports, the arts, education, and other local initiatives."],"focus":"Full Service"},"rstephens@auswidebank.com.au":{"simplified_title":"CTO","simplified_name":"Auswide Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"The latest news includes topics on finding secure ways to grow money, tips on dealing with rising costs of living, and awareness on tax scams.","notable_details":"Auswide Bank has been providing award-winning banking services for over 55 years. They also show respect and acknowledgment to the Traditional Owners of the lands on which they operate, including Aboriginal and Torres Strait Islander peoples.","focus":"Full Service Bank"},"riz@australianmilitarybank.com.au":{"simplified_title":"Business Transformation Project Support Lead","simplified_name":"Australian Military Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Group Captain John Brooks (Retd) has made the decision to retire as the Chair of the Australian Military Bank Board. There has been an update to the Terms and Conditions for Accounts and Access Facilities. Following the RBA announcement to lift the cash rate, Australian Military Bank will be making changes. Australian Military Bank has launched a new blog - Signal.","notable_details":"This is the longest serving Defence financial institution in Australia, having been banking with the Defence community since 1959. They also have a product called DHOAS (Defence Home Ownership Assistance Scheme) which offers subsidies up to $1,020/month.","focus":"Full Service"},"aymeric.cabuil@avenuebank.com.au":{"simplified_title":"COO","simplified_name":"Avenue Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Neobank","news":"Fintech start-up Avenue Bank has created an innovative product for the business banking market that will seek to unlock almost $10 billion of small business cash tied up in bank guarantees used to secure commercial leases. Australian Financial Review 24 Jan '23","notable_details":"Avenue Bank is authorised by the Australian Prudential Regulation Authority (APRA) to operate under a Restricted Authorised Deposit-taking Institution licence until 7 March, 2024. Under this restricted licence, they are not required to meet the full ADI prudential framework and will not be offering banking products to the general public.","focus":"Business banking with a unique focus on unlocking cash tied up in bank guarantees used to secure commercial leases"},"rkumar@australianmilitarybank.com.au":{"simplified_title":"Product Owner","simplified_name":"Australian Military Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Military Bank","news":"23 June 2023: The bank shared some proud news. 21 June 2023: Group Captain John Brooks (Retd) decided to retire as the Chair of the Australian Military Bank Board. 13 June 2023: The bank updated its Terms and Conditions for Accounts and Access Facilities. 09 June 2023: Following the announcement by the RBA on 6 June 2023 to lift the cash rate, Australian Military Bank will be making changes.","notable_details":"The bank has been serving the Defence community since 1959, making it Australia's longest serving Defence financial institution. They have launched a new blog - Signal - bringing news from their community, partners and inside the organisation.","focus":"Full Service Bank, specifically for the Defence community"},"srobertson@australianmilitarybank.com.au":{"simplified_title":"Chief Risk Officer","simplified_name":"Australian Military Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"On 23 June 2023, the bank made an announcement which they are proud to share. On 21 June 2023, Group Captain John Brooks (Retd) has made the decision to retire as the Chair of the Australian Military Bank Board. On 13 June 2023, they updated their Terms and Conditions for Accounts and Access Facilities. On 09 June 2023, following the announcement by the RBA to lift the cash rate, Australian Military Bank will be making adjustments.","notable_details":"The bank has been serving the Defence community since 1959, making it Australia's longest serving Defence financial institution. They have a new blog called Signal which brings news from their community, partners and inside the organisation.","focus":"Full Service Bank, Defence Services"},"sjohnson@auswidebank.com.au":{"simplified_title":"CIO","simplified_name":"Auswide Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"Finding an easy and secure way to grow your money might sound easier said than done, but if you’ve got some savings set aside, a term deposit might be the way to go. If you’re like many Australians who struggle with the cost of living, we’ve put together some tips to help you face rising costs. It's essential to be aware of tax scams and by understanding the common tactics used by scammers, you can avoid falling victim to them.","notable_details":"Auswide Bank has been serving its customers for over 55 years. It offers a range of products including home loans, personal loans, credit cards, and insurance. The bank also has a strong commitment to sustainability and acknowledges the Traditional Owners of the lands on which it operates, paying respects to Elders past and present, and to emerging community leaders.","focus":"Full Service"},"amoebus@australianmilitarybank.com.au":{"simplified_title":"CMEDO","simplified_name":"Australian Military Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Military Bank","news":"Group Captain John Brooks (Retd) has decided to retire as the Chair of the Australian Military Bank Board. There have been updates to the Terms and Conditions for Accounts and Access Facilities effective from 13 June 2023. Following the RBA's decision to raise the cash rate, Australian Military Bank will adjust accordingly.","notable_details":"The bank is the oldest serving Defence financial institution in Australia, having been established in 1959. They offer a range of products including home and car loans, credit cards, savings accounts, everyday accounts, term deposits, insurance, and superannuation. They are part of the Federal Government’s Home Guarantee Scheme and have also launched a new blog named 'Signal'.","focus":"Full Service"},"rcoldwell@australianmilitarybank.com.au":{"simplified_title":"CTO","simplified_name":"Australian Military Bank","industry":"Banking","spoken_industry":"banking sector","type_of_bank":"Military Bank","news":["23 June 2023 - We are proud to share...","21 June 2023 - Group Captain John Brooks (Retd) has made the decision to retire as the Chair of the Australian Military Bank Board...","13 June 2023 - We have updated our Terms and Conditions for Accounts and Access Facilities effective 13 June 2023.","09 June 2023 - Following the announcement by the RBA on 6 June 2023 to lift the cash rate, Australian Military Bank will be making..."],"notable_details":"The bank has been serving the Defence community since 1959, making it Australia's longest serving Defence financial institution. They are also offering a range of products including home loans, car loans, term deposits, credit cards, and more. They have been selected by the National Housing Finance and Investment Corporation (NHFIC) to offer home loans under the Federal Government’s Home Guarantee Scheme.","focus":"Full-service military bank"},"ingrid.deehan@bankaust.com.au":{"simplified_title":"Head of Product","simplified_name":"Bank Australia","industry":"Banking","spoken_industry":"banking","type_of_bank":"Customer Owned Bank","news":"Recent scam alerts have been posted on the Bank Australia website, warning customers about text message impersonation, pop up messages requesting login access, callers claiming to 'protect' internet banking, and a fake investment brochure offering high return Bank Australia Fixed Term Deposits.","notable_details":"Bank Australia started out as the CSIRO Co-operative Credit Society in 1957. They are a customer owned bank that focuses on investing in projects and organisations that create positive impact for people and the planet. They've invested more than $1 billion in such projects.","focus":"Full Service"},"kathryn.gardiner@bankaust.com.au":{"simplified_title":"Product Manager Leader","simplified_name":"Bank Australia","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Bank Australia has issued several scam alerts on their website, warning about text message impersonations, pop up messages requesting log in access, and a fake investment brochure offering high returns on Fixed Term Deposits.","notable_details":"Bank Australia started out as the CSIRO Co-operative Credit Society in 1957. They have invested more than $1 billion in projects and organisations that have a positive impact on people and the planet. They do not invest in fossil fuels, live animal export, the arms industry, gambling, or tobacco. They are a customer-owned bank and are certified carbon neutral. They also acknowledge and respect the Traditional Custodians of the lands they work on and support the Uluru Statement from the Heart.","focus":"Full Service, Ethical Banking"},"bill.kalpouzanis@banksyd.com.au":{"simplified_title":"COO","simplified_name":"Bank of Sydney","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"They are promoting the concept of Open Banking which aims to provide customers with greater access to and control over their data. It also makes it easier to compare and switch between products and services.","notable_details":"Bank of Sydney seems to have a strong focus on providing personal customer support, with mention of 'Home Loan Specialists' who aim to guide customers through the buying process, and several channels for reaching out to their staff. They also offer online application for their services, which can be completed in just 10 minutes.","focus":"Full-Service Bank"},"tanya.lonsdale@bankaust.com.au":{"simplified_title":"Product Manager","simplified_name":"Bank Australia","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":["Scam alert: Bank Australia text message impersonation","Scam alert: be cautious of pop up messages requesting log in access to your computer or bank accounts","Scam alert: be cautious about callers claiming to 'protect' your internet banking from scammers","Scam Alert: fake investment brochure"],"notable_details":["Bank Australia is customer owned and all offices are powered by renewable electricity","The bank started out as the CSIRO Co-operative Credit Society in 1957","They have invested more than $1 billion in projects and organisations that create positive impact for people and the planet"],"focus":"Personal and Business banking with a focus on sustainable and ethical investing"},"richard.irving@bankaust.com.au":{"simplified_title":"Head of Distribution","simplified_name":"Bank Australia","industry":"Banking","spoken_industry":"banking","type_of_bank":"Customer-owned bank","news":["Bank Australia text message impersonation scam.","Scammers impersonating Bank Australia and sending text messages with secure codes and fake purchase amounts.","Pop up messages requesting log in access to your computer or bank accounts.","Callers claiming to 'protect' your internet banking from scammers.","Fake investment brochure offering Bank Australia Fixed Term Deposits investments with high returns."],"notable_details":["Bank Australia started as the CSIRO Co-operative Credit Society in 1957.","They have invested more than $1 billion in projects and organisations that create positive impact for people and the planet.","They are a certified carbon neutral bank.","They do not invest in fossil fuels, live animal export, arms industry, gambling, and tobacco.","Their offices are powered by renewable electricity."],"focus":"Purpose-driven banking with a focus on positive impact investments and sustainability. They provide services for personal and business banking."},"mary.shenouda@bankaust.com.au":{"simplified_title":"CRM Product Manager","simplified_name":"Bank Australia","industry":"Banking","spoken_industry":"banking","type_of_bank":"Customer-owned bank","news":["Scam alert: Bank Australia text message impersonation.","Scam alert: be cautious of pop up messages requesting log in access to your computer or bank accounts.","Scam alert: be cautious about callers claiming to 'protect' your internet banking from scammers.","Scam Alert: fake investment brochure claiming to offer Bank Australia Fixed Term Deposits investments with the promise of high returns is being circulated."],"notable_details":["Bank Australia started out as the CSIRO Co-operative Credit Society in 1957.","They've invested more than $1 billion in projects and organisations that create positive impact for people and the planet.","They do not invest in fossil fuels, live animal export, arms industry, gambling, or tobacco.","The bank is customer-owned, and customers have voting rights.","The bank is powered by renewable electricity, and is a certified carbon neutral bank."],"focus":"Purpose-driven banking, investing in projects that have a positive impact, not investing in harmful industries, providing personal and business banking services, and maintaining commitment to advancing reconciliation with Australia’s First Peoples."},"lindy.walker@bankaust.com.au":{"simplified_title":"Manager","simplified_name":"Bank Australia","industry":"Banking","spoken_industry":"banking services","type_of_bank":"Credit Union","news":["Scam alert: Bank Australia text message impersonation.","Scam alert: be cautious of pop up messages requesting log in access to your computer or bank accounts.","Scam alert: be cautious about callers claiming to 'protect' your internet banking from scammers: Never give anyone your log in details or one-time password (OTP). Bank Australia will never ask you for these details in a call or text message.","Scam Alert: fake investment brochure: A fake document, developed by scammers, claiming to offer Bank Australia Fixed Term Deposits investments with the promise of high returns is being circulated."],"notable_details":["Bank Australia started out as the CSIRO Co-Operative Credit Society in 1957.","Bank Australia has invested more than $1 billion in projects and organisations that create positive impact for people and the planet.","Bank Australia is a customer-owned bank and provides renewable electricity to all its offices.","The bank does not invest in harmful industries such as fossil fuels, live animal export, arms industry, gambling, and tobacco."],"focus":"Full Service"},"chris.chew@banksyd.com.au":{"simplified_title":"CTO","simplified_name":"Bank of Sydney","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"As part of Consumer Data Right, Open Banking aims to provide you with greater access to and control over your data. It also makes it easier to compare and switch between products and services.","notable_details":"The bank provides a range of business loans and overdraft accounts to help reduce financial stress and uncertainty from business finances. They also offer an 'Expect More Investment Home Loan' with a guaranteed interest rate for a set period.","focus":"Full Service"},"gary.english@banksyd.com.au":{"simplified_title":"CRO","simplified_name":"Bank of Sydney","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"Bank of Sydney is implementing the Consumer Data Right and Open Banking to provide customers with greater access to and control over their data. This makes it easier for customers to compare and switch between products and services.","notable_details":"Bank of Sydney offers a 'Expect More Investment Home Loan' which comes with a guaranteed interest rate for a set period. They also have Home Loan Specialists to guide customers throughout the buying process.","focus":"Full service"},"andrew.bell@bnk.com.au":{"simplified_title":"CIO","simplified_name":"BNK","industry":"N/A","spoken_industry":"N/A","type_of_bank":"N/A","news":"N/A","notable_details":"Javascript is required to view this page","focus":"N/A"},"tristan.kipling@capricornian.com.au":{"simplified_title":"CRO","simplified_name":"Capricornian","industry":"Banking","spoken_industry":"banking","type_of_bank":"Online Bank","news":"ONLINE BANKING & CAP APP NEW, IMPROVED LOOK COMING SOON","notable_details":"The Capricornian Ltd is a credit union that focuses on personalized services and offers an award-winning youth account. It also operates as a local business in the Capricorn region.","focus":"Credit Union"},"natalie.ohl@capricornian.com.au":{"simplified_title":"Head of Projects and IT","simplified_name":"Capricornian","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Online banking and CAP app have a new, improved look coming soon","notable_details":"The Capricornian bank operates on a credit union model where it prioritizes the needs of its members over making profits for shareholders. It also offers a locally focused banking experience, with local home loan approvals and customer service provided by locals in the Capricorn region.","focus":"Credit Union"},"bmarkwart@beyondbank.com.au":{"simplified_title":"CRO","simplified_name":"Beyond Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Customer-Owned Bank","news":"In 2023, Beyond Bank will be giving back over $680,000 to clubs and causes that their customers choose to support. The Community Reward Account is a unique savings account to fundraise for a local club or cause. They have also been awarded 'Most Satisfied Customers' by Canstar's Customer-Owned Bank Award 2023.","notable_details":"Beyond Bank is 100% owned by its customers and returns value to the communities in which they live and operate. They have a unique savings account called the Community Reward Account that is used to fundraise for local clubs or causes.","focus":"Full service"},"birons@communityfirst.com.au":{"simplified_title":"Head Of Distribution","simplified_name":"Community First Bank","industry":"Banking","spoken_industry":"banking services","type_of_bank":"Credit Union","news":"The news section of the website does not contain any specific recent news. However, it mentions a promotional offer where a customer can earn $100 by getting a new low rate credit card approved between 12/7/23 and 12/10/23 and making an eligible transaction in the first 30 days.","notable_details":"The bank is operating under the name 'Community First Bank' but it is actually a credit union. It offers competitive term deposit specials and a Green Car Loan for brand new hybrid or electric vehicles, which can also cover the cost of a charging station.","focus":"Full Service"},"nkamphui@communityfirst.com.au":{"simplified_title":"Product Manager","simplified_name":"Community First Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"The bank has introduced mandatory measures to enhance Internet Banking security. Customers are required to set up a stronger password and One Time Passwords. They also have a promotion where customers can earn $100 by getting a new low rate credit card approved between 12/7/23 and 12/10/23 and making an eligible transaction in the first 30 days. Additionally, they offer a Green Car Loan for brand new hybrid or electric vehicles, including the cost of a charging station.","notable_details":"Community First Bank differentiates itself with a focus on community, friendly staff, and competitive products like their Green Car Loan. They also have a unique credit card offer where customers can shop with no interest, only a low monthly fee which changes based on the chosen limit.","focus":"Full Service"},"dale.chopping@defencebank.com.au":{"simplified_title":"Regional Manager","simplified_name":"Defence Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Defence Bank","news":"A number of changes to the Defence Home Ownership Assistance Scheme Act 2008 have been approved by the Federal Government. The bank won the Defence Services Bank of the Year award for two consecutive years at the 2023 WeMoney Banking Awards. They are offering up to $4,000 cashback on DHOAS home loans.","notable_details":"The bank has a strong focus on the defence community, specifically offering DHOAS home loans with subsidies of up to $1,020 per month. They have a highly-rated mobile app and offer a range of camo-design VISA debit cards for their members.","focus":"Full service"},"dean.barton@defencebank.com.au":{"simplified_title":"CFO","simplified_name":"Defence Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Defence Services Bank","news":"A number of changes to the Defence Home Ownership Assistance Scheme Act 2008 have been approved by the Federal Government. Also, Defence Bank won the title of Defence Services Bank of the Year for the second time in a row at the 2023 WeMoney Banking Awards.","notable_details":"The Defence Bank offers a specialized DHOAS home loan, with subsidies of up to $1,020 per month. They have a highly-rated mobile application, and offer custom Visa debit cards with a choice of four camo designs. They have been serving the Australian Defence Force and the wider community since 1975.","focus":"Full service bank with a focus on Defence services"},"darren.condon@defencebank.com.au":{"simplified_title":"Regional Manager Lending Distribution","simplified_name":"Defence Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full service bank","news":"Defence Bank has been named Defence Services Bank of the Year for two years in a row at the 2023 WeMoney Banking Awards. Additionally, there have been approved changes to the Defence Home Ownership Assistance Scheme Act 2008 by the Federal Government.","notable_details":"Defence Bank has a unique focus on serving Australian Defence Force members and the wider community since 1975. They offer a DHOAS home loan with subsidies of up to $1,020 per month.","focus":"Defence Bank focuses on providing member-focused, people-led, technology-enabled banking products and services. They also have a distinct focus on serving Australian Defence Force members and their community."},"charles.kingsmill@defencebank.com.au":{"simplified_title":"Head of Network Distribution","simplified_name":"Defence Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Defence Services Bank","news":["UP TO $4,000 CASHBACK ON YOUR DHOAS HOME LOAN. When you refinance to us from another lender or purchase a new home using our DHOAS home loans. Terms and conditions apply.","DEFENCE SERVICES BANK OF THE YEAR. TWO YEARS IN A ROW. We cleaned up (again) at the 2023 WeMoney Banking Awards.","A number of changes to the Defence Home Ownership Assistance Scheme Act 2008 have been approved by the Federal Government.","Members love our highly-rated app - and with good reason!","Scammers are trying to get between you and your money. Here's how you can protect yourself.","With a fresh new look and feel, members will enjoy easier access at this convenient location."],"notable_details":["Served Australian Defence Force members and the wider community since 1975.","Offers a range of online tools and helpful information.","Provides DHOAS home loans with subsidies of up to $1,020 per month.","Offers a term deposit rate that won't get you down.","Offers Visa debit cards with four camo designs.","Has a blog called 'Intel'."],"focus":"Full Service"},"geraldnicholls@gatewaybank.com.au":{"simplified_title":"CRO","simplified_name":"Gateway Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Gateway Bank has recently introduced an eco Visa Debit Card made from plants, not plastic. They have also updated their term deposit rates and provided information on how to identify scams.","notable_details":"In addition to regular banking services, Gateway Bank offers 'Green Home Loans' and conducts their operations with an emphasis on ethical practices and environmental sustainability.","focus":"Full Service and Ethical Banking"},"zebdrummond@gatewaybank.com.au":{"simplified_title":"COO","simplified_name":"Gateway Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Gateway Bank has recently launched an Eco Visa Debit Card which is made from plants, not plastic. They have also announced their 2023 Annual General Meeting of Members.","notable_details":"Gateway Bank offers a unique product called the 'Emax Saver' allowing customers to earn up to 3.30% p.a. on their savings. They also emphasize on ethical banking with initiatives like the Eco Visa Debit Card, and promote green home loans.","focus":"Ethical and everyday banking"},"douggordon@gatewaybank.com.au":{"simplified_title":"CFO","simplified_name":"Gateway Bank","industry":"Banking","spoken_industry":"banking industry","type_of_bank":"Credit Union","news":"Gateway Bank has recently introduced an Eco Visa Debit Card made from plants, not plastic. They are also offering an EMax Saver with an interest rate of up to 3.30% p.a. The 2023 annual general meeting of members has been announced as well.","notable_details":"Gateway Bank is focused on ethical banking and environmental responsibility, offering products like the Eco Visa Debit Card and Green Home Loans.","focus":"Full Service"},"mano.simos@defencebank.com.au":{"simplified_title":"CRO","simplified_name":"Defence Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Defence Bank","news":"There have been several changes to the Defence Home Ownership Assistance Scheme Act 2008 approved by the Federal Government. Defence Bank has won the Defence Services Bank of the Year award twice in a row at the 2023 WeMoney Banking Awards.","notable_details":"Defence Bank offers a unique Visa debit card with a choice of four camouflage designs. They have a highly-rated mobile app and have recently redesigned a location for easier access for members.","focus":"Full service with focus on Defence Home Ownership Assistance Scheme (DHOAS) loans"},"kmorris@gmcu.com.au":{"simplified_title":"CFO","simplified_name":"gmcu","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Tax time can be a vulnerable time for many Australians. Help keep yourself safe by learning about common types of scams for this time of year. GMCU is also currently hiring and has opportunities for careers. Additionally, GMCU will be retiring chequebooks as of the 31st March 2023.","notable_details":"Goulburn Murray Credit Union Cooperative Ltd has a unique BSB 803078 and operates under the Australian Credit Licence Number 241364.","focus":"Full service"},"sbutt@gcmutual.bank":{"simplified_title":"CRO","simplified_name":"G&C Mutual","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"G&C Mutual Bank is a proud sponsor of the NSW Ambulance Employee of the Month Awards and has recently congratulated the recipients for the first half of 2023. The bank has also been recognized by Canstar for offering outstanding value home loans and additional services that benefit first home buyers.","notable_details":"G&C Mutual Bank supports the Uluru Statement from the Heart, aiming to achieve justice, recognition, and respect for First Nations people. They also have a mobile app for easy and secure management of finances on-the-go.","focus":"Full service"},"bling@gmcu.com.au":{"simplified_title":"CIO","simplified_name":"gmcu","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Tax time can be a vulnerable time for many Australians. Help keep yourself safe by learning about common types of scams for this time of year. Interested in a career with GMCU? Read more to find out about our current opportunities. From the 31st of March 2023, GMCU will be retiring chequebooks. Read more to find out what these changes mean, and how we can support you in exploring new ways to do your everyday banking.","notable_details":"GMCU is planning to retire chequebooks from 31st of March 2023, and they are indicating support for their customers in exploring new ways to do everyday banking.","focus":"Full Service"},"aprichard@gcmutualbank.com.au":{"simplified_title":"CFO","simplified_name":"G&C Mutual Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"NSW Ambulance employees go above and beyond for the community, and G&C Mutual Bank is proud to sponsor the NSW Ambulance Employee of the Month Awards. Congratulations to the recipients for the first half of 2023. As online banking is the preferred method of banking for Australians and the usage of mobile banking apps increase in popularity, the threat of scammers and cybercriminals continues to be present. Canstar’s First Home Buyer Award recognises institutions offering outstanding value home loans as well as additional services that benefit first home buyers in making an informed decision when entering the property market.","notable_details":"G&C Mutual Bank supports the Uluru Statement from the Heart to achieve justice, recognition and respect for First Nations people. They also have a special offer for first home buyers and a competitive interest rate for a 3 year term deposit.","focus":"Full Service"},"amehta@gcmutual.bank":{"simplified_title":"COO","simplified_name":"G&C Mutual Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"G&C Mutual Bank is proud to sponsor the NSW Ambulance Employee of the Month Awards and congratulates the recipients for the first half of 2023. Also, it was noted that online banking is the preferred method of banking for Australians, with increased usage of mobile banking apps. Furthermore, Canstar’s First Home Buyer Award recognises institutions offering outstanding value home loans and G&C Mutual Bank is actively participating in this space.","notable_details":"G&C Mutual Bank acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community, and supports the Uluru Statement from the Heart to achieve justice, recognition and respect for First Nations people. They also have a very special offer for first home buyers.","focus":"Full-service"},"carl.banks@greater.com.au":{"simplified_title":"Head of Financial Risk","simplified_name":"Greater Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":["'Thanks a Mil’ Our Community Funding Program has now supported more than 770 community groups to the tune of $1 million.","Our Greater Charitable Foundation is thrilled to announce new partnerships with batyr, The Smith Family, University of Newcastle and Dress for Success, sharing in a total investment of almost $800,000","Our products and services continue to be recognised as some of the best in the industry after we were named among the winners at the recently announced WeMoney Banking Awards 2023."],"notable_details":["Being a mutual bank, we don't have shareholders, we have customers, and this means we're able to use our profits to support organisations, events and programs that our customers care about.","Our recent merger won't require you to change any of your account details or to provide those details to anyone who contacts you."],"focus":"Full service"},"benjamin.wise@gsb.com.au":{"simplified_title":"CISO","simplified_name":"Great Southern Bank","industry":"Not Available","spoken_industry":"Not Available","type_of_bank":"Not Available","news":"Not Available","notable_details":"Not Available","focus":"Not Available"},"max.francis@greater.com.au":{"simplified_title":"Product Owner","simplified_name":"Greater Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"The Greater Charitable Foundation has announced new partnerships with batyr, The Smith Family, University of Newcastle and Dress for Success, sharing in a total investment of almost $800,000. The bank also won an award at the recently announced WeMoney Banking Awards 2023. Moreover, they have reached a milestone in their community funding program, having supported more than 770 community groups with a total of $1 million.","notable_details":"The bank operates on a mutual model, meaning it doesn't have shareholders but customers, and it uses its profits to support organisations, events and programs that its customers care about. They also have a community funding program that has supported more than 770 community groups.","focus":"Full Service, Lending"},"sumit.chowdhury@gsb.com.au":{"simplified_title":"Senior Product Manager","simplified_name":"GSB","industry":"Not Available","spoken_industry":"Not Available","type_of_bank":"Not Available","news":"Not Available","notable_details":"There was an unsuccessful request, with an indicated incident ID from Incapsula, a web security service","focus":"Not Available"},"lancey.b@heritage.com.au":{"simplified_title":"Program Lead","simplified_name":"Heritage Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Heritage Bank","news":"Heritage and People's Choice have officially merged to create a new national mutual that offers a compelling alternative to the big banks.","notable_details":"The bank acknowledges and honors the traditional owners of the land on which they meet, work and live. They pay their respect to Aboriginal and Torres Strait Islander cultures and to elders past, present and emerging.","focus":"full service"},"goodall.d@heritage.com.au":{"simplified_title":"Commercial Procurement Manager","simplified_name":"Heritage Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Heritage Bank","news":"Heritage and People's Choice have officially merged to create a new national mutual that offers a compelling alternative to the big banks. Also, they are offering a $150 eGift card for purchasing eligible new Home and Contents, Building, Landlord, Caravan or Comprehensive Motor Insurance before 31 October 2023.","notable_details":"Heritage Bank acknowledges and honours the traditional owners of the land on which they meet, work and live and pays respect to Aboriginal and Torres Strait Islander cultures and to elders past, present and emerging.","focus":"Full service banking and insurance"},"haller.p@heritage.com.au":{"simplified_title":"Head of Financial Risk","simplified_name":"Heritage Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"Heritage and People's Choice have officially merged to create a new national mutual that offers a compelling alternative to the big banks.","notable_details":"The bank respects Aboriginal and Torres Strait Islander cultures, acknowledging and honoring the traditional owners of the land on which they meet, work and live. They also have a promotion running - anyone purchasing eligible new Home and Contents, Building, Landlord, Caravan or Comprehensive Motor Insurance before 31 October 2023 will receive a $150 eGift card.","focus":"Full Service"},"endres.n@heritage.com.au":{"simplified_title":"Head of Financial Risk","simplified_name":"Heritage Bank","industry":"Banking","spoken_industry":"banking sector","type_of_bank":"Mutual Bank","news":"Heritage and People's Choice have officially merged to create a new national mutual that offers a compelling alternative to the big banks. Furthermore, they are offering a $150 eGift card for the purchase of eligible new Home and Contents, Building, Landlord, Caravan or Comprehensive Motor Insurance before 31 October 2023.","notable_details":"Heritage Bank is a trading name of Heritage and People’s Choice Ltd. They not only offer banking products, but also arrange insurance policies as an agent for Allianz Australia Insurance Limited.","focus":"Full-Service Bank"},"grady.m@heritage.com.au":{"simplified_title":"Assistant Product Manager","simplified_name":"Heritage Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Heritage Bank","news":"Heritage and People's Choice have officially merged to create a new national mutual that offers a compelling alternative to the big banks. They are also offering a $150 eGift card for new insurance policyholders before 31 October 2023.","notable_details":"Heritage Bank acknowledges and honors the traditional owners of the land on which they operate. They also pay respect to Aboriginal and Torres Strait Islander cultures and to elders past, present, and emerging.","focus":"Full service bank with a specific focus on personal loans, home loans, and insurance."},"lopushanski.m@heritage.com.au":{"simplified_title":"CISO","simplified_name":"Heritage","industry":"Banking","spoken_industry":"banking","type_of_bank":"Heritage Bank","news":"Heritage and People's Choice have officially merged to create a new national mutual that offers a compelling alternative to the big banks.","notable_details":"Heritage Bank offers a promotion where customers who purchase eligible new Home and Contents, Building, Landlord, Caravan or Comprehensive Motor Insurance before 31 October 2023 will receive a $150 eGift card.","focus":"Full Service Bank, Lending, Insurance"},"jeff.bloom@iboa.com.au":{"simplified_title":"COO","simplified_name":"IBOA","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Global Payments Bank","news":"International Bank of Australia is authorised by the Australian Prudential Regulation Authority (APRA) to operate under a Restricted Authorised Deposit-taking Institution licence until 2nd November 2024.","notable_details":"International Bank of Australia is not required to meet the full ADI prudential framework and will not be offering banking products to the general public under its current license. It is also covered by the Australian Government Financial Claims Scheme (FCS).","focus":"Banking and payments services to support the increasing global mobility of capital, commerce and people. They also place emphasis on cross border lending and payment services for fintechs."},"craig.glendenning@iboa.com.au":{"simplified_title":"CITO","simplified_name":"IBOA","industry":"Banking","spoken_industry":"banking","type_of_bank":"Global Payments Bank","news":"International Bank of Australia is authorised by the Australian Prudential Regulation Authority (APRA) to operate under a Restricted Authorised Deposit-taking Institution licence until 2nd November 2024. They are not currently offering banking products to the general public.","notable_details":"International Bank of Australia is focusing on building banking and payments infrastructure that enables the seamless end-to-end movement of money across multiple geographic corridors.","focus":"Cross Border Payments and FX, Banking Services for Fintechs, Cross Border Lending, Payment Services for Fintechs"},"michaelkohler@horizonbank.com.au":{"simplified_title":"CFO","simplified_name":"Horizon Bank","industry":"Banking","spoken_industry":"banking sector","type_of_bank":"Customer Owned Bank","news":"The bank has recently opened a new branch in Berry. They have also issued a warning regarding bank impersonation scams, assuring customers that they will never ask for a one-time-password (OTP). Additionally, they are promoting their Green Personal Loan which is designed to fund eco-friendly projects and their Green Car Loan for fuel-efficient vehicles.","notable_details":"Horizon Bank is a customer-owned bank, which means it's owned by its members rather than shareholders. This bank has been providing personalized banking services to its members for over 50 years. This bank offers a wide range of products from home loans to car loans, personal loans, credit cards, everyday accounts, savings accounts, and youth accounts. They also provide services for banking and accessing funds in different ways, including mobile payments through Apple Pay, Google Pay, and Samsung Pay.","focus":"Full Service"},"pope.k@heritage.com.au":{"simplified_title":"Digital Product Manager","simplified_name":"Heritage Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual","news":"Heritage and People's Choice have officially merged to create a new national mutual that offers a compelling alternative to the big banks. They're also running a promotion where purchase of eligible new Home and Contents, Building, Landlord, Caravan or Comprehensive Motor Insurance before 31 October 2023 will receive a $150 eGift card.","notable_details":"The bank acknowledges and honors the traditional owners of the land on which they operate, showing respect to Aboriginal and Torres Strait Islander cultures and elders past, present, and emerging. They also offer a term deposit rate of 5.15% PA for 12 months for $1,000 or more, which is quite competitive.","focus":"Full Service"},"lourey.a@heritage.com.au":{"simplified_title":"Head of Strategy","simplified_name":"Heritage Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full Service Bank","news":"Heritage and People's Choice have officially merged to create a new national mutual that offers a compelling alternative to the big banks. Additionally, they are offering a $150 eGift card for purchase of eligible new Home and Contents, Building, Landlord, Caravan or Comprehensive Motor Insurance before 31 October 2023.","notable_details":"Heritage Bank acknowledges and honours the traditional owners of the land on which they operate, paying respect to Aboriginal and Torres Strait Islander cultures and to elders past, present and emerging.","focus":"Heritage Bank offers a wide range of banking services including loans, business banking, support, and financial tips. They also provide tools for calculating home loan repayments, borrowing power, and personal loan repayments. They're focused on helping their customers achieve their goals in life and reach their financial dreams."},"noel.knox@imb.com.au":{"simplified_title":"Enterprise Architecture Manager","simplified_name":"IMB Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":["IMB BANK ANNOUNCES INTEREST RATE CHANGES – JUNE 2023","APPLICATIONS OPEN: IMB BANK COMMUNITY FOUNDATION FUNDING NOW AVAILABLE FOR COMMUNITY ORGANISATIONS","IMB BANK RECEIVES WORKPLACE GENDER EQUALITY AGENCY CITATION FOR SECOND CONSECUTIVE TERM"],"notable_details":"IMB Bank has a history stretching back more than 140 years. It also has a growing retail branch network throughout NSW and Victoria, and offers a range of services including home and personal lending, savings and transaction accounts, term deposits, business banking, and more. IMB Bank also offers a mobile lending service where specialists will come to the customer.","focus":"Full Service"},"prateek.mundae@imb.com.au":{"simplified_title":"Product Lead","simplified_name":"IMB Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Personal Banking","news":["IMB BANK ANNOUNCES INTEREST RATE CHANGES – JUNE 2023 Following the Reserve Bank of Australia’s recent adjustment to the official cash rate, changes to interest rates...","APPLICATIONS OPEN: IMB BANK COMMUNITY FOUNDATION FUNDING NOW AVAILABLE FOR COMMUNITY ORGANISATIONS The IMB Bank Community Foundation has opened applications for 2023 grant funding. Not-for-profit groups that need...","IMB BANK RECEIVES WORKPLACE GENDER EQUALITY AGENCY CITATION FOR SECOND CONSECUTIVE TERM With a sustained focus on building a diverse, inclusive culture, IMB Bank is delighted to announce that it has been..."],"notable_details":"Established in 1880, IMB Bank is one of the most enduring financial institutions in the country, helping people achieve their financial goals for over 140 years. It offers a fully featured range of services such as home and personal lending, savings and transaction accounts, term deposits, and business banking. IMB has a growing retail branch network throughout NSW and Victoria, and a team of mobile lending specialists who can make house visits.","focus":"Full service"},"michael.king@imb.com.au":{"simplified_title":"CRO","simplified_name":"IMB Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Retail Bank","news":["IMB BANK ANNOUNCES INTEREST RATE CHANGES – JUNE 2023 Following the Reserve Bank of Australia’s recent adjustment to the official cash rate, IMB is announcing changes to interest rates","APPLICATIONS OPEN: IMB BANK COMMUNITY FOUNDATION FUNDING NOW AVAILABLE FOR COMMUNITY ORGANISATIONS The IMB Bank Community Foundation has opened applications for 2023 grant funding","IMB BANK RECEIVES WORKPLACE GENDER EQUALITY AGENCY CITATION FOR SECOND CONSECUTIVE TERM With a sustained focus on building a diverse, inclusive culture, IMB Bank announced that it has been awarded a Workplace Gender Equality Agency citation for the second consecutive term"],"notable_details":"IMB Bank was established in 1880 and has been helping people achieve their financial goals for over 140 years. The bank offers a fully featured range of services including home and personal lending, savings and transaction accounts, term deposits, business banking, and more. They also have a growing retail branch network throughout NSW and Victoria, for when customers need to speak to someone in person, and a team of professionals at their locally based contact centre.","focus":"full service"},"":{"simplified_title":"Product Owner","simplified_name":"ING","industry":"Banking and Financial Services","spoken_industry":"banking and financial services","type_of_bank":"Commercial Bank","news":"ING is currently offering discounts on various insurance products including car, home & contents, motorcycle, and pet insurance for the first year's premium when purchased online. Additionally, ING issued an investment scam alert stating that they do not offer individual bond products and recommend seeking professional advice for investing in any type of asset or security.","notable_details":"ING has a wide range of services from credit cards, personal loans, home loans, insurance, superannuation, commercial loans, and savings accounts. They also provide financial support for customers experiencing difficulties, adheres to the Banking Code of Practice, and commits to making banking more accessible for individuals with disabilities.","focus":"Full-Service Bank"},"alec.evanson@ing.com.au":{"simplified_title":"Digital Product Owner","simplified_name":"ING","industry":"Banking and Financial Services","spoken_industry":"banking services","type_of_bank":"Commercial Bank","news":"There are various discounts on ING Car, Home & Contents, Motorcycle and Pet insurance for the first year when purchased online. There is also an alert about an investment scam, stating that ING does not offer individual bond products.","notable_details":"ING offers a range of services including credit cards, personal loans, home loans, insurance, and superannuation. They also offer savings accounts with competitive interest rates and credit cards with practical features like autopay and instalments to help customers manage their finances. They have a special focus on providing easy access to everyday banking with great benefits, and they also cater to business customers with offerings like commercial property loans and high variable interest business savings accounts.","focus":"Full Service Bank"},"amit.navale@ing.com.au":{"simplified_title":"Chapter Lead Engineering","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ING is currently offering a 15% discount on the first year's premium for car, motorcycle, and pet insurance when purchased online. There is also a 30% discount on home and contents insurance when purchased online. Additionally, there is an investment scam alert regarding individual bond products.","notable_details":"ING offers a wide range of products and services such as credit cards, personal loans, home loans, business savings, commercial loans, insurance, and superannuation. They have a customer-friendly approach, offering easy access to everyday banking with great benefits, and they also provide financial support for those in need. They also have a unique offering called the 'Orange Everyday' account which provides several benefits to the customers.","focus":"Full Service"},"bruce.kelly@ing.com.au":{"simplified_title":"Senior Product Manager","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial and Personal Bank","news":"ING is offering discounts on various insurances including car, home and contents, motorcycle, and pet insurance. The bank has also issued an investment scam alert informing that ING does not offer individual bond products.","notable_details":"ING has a dedicated support for commercial loans if you require more than $500,000 for a commercial property. They offer both variable and fixed term loans. They also offer a wide range of services including credit cards, personal loans, home loans, insurance, and superannuation.","focus":"Full Service Banking"},"brittany.bruno@ing.com.au":{"simplified_title":"Product Owner","simplified_name":"ING","industry":"Finance","spoken_industry":"finance","type_of_bank":"Full Service Bank","news":"ING has recently highlighted an investment scam alert, notifying customers that ING does not offer individual bond products and recommending consultation with a financial professional for any type of asset or investment.","notable_details":"ING offers a wide range of financial products and services, including various types of insurance (car, home & contents, motorcycle, pet), credit cards, personal and home loans, and savings accounts. They also offer a 'Savings Maximiser' account, which offers competitive interest rates for customers who meet certain conditions.","focus":"ING focuses on providing comprehensive banking services to individuals and businesses, including everyday banking, savings accounts, credit cards, loans, insurance products, and investment services."},"eleni.karagounis@ing.com.au":{"simplified_title":"Senior Procurement Manager","simplified_name":"ING","industry":"Banking and Financial Services","spoken_industry":"banking and finance","type_of_bank":"Commercial Bank","news":"The bank has recently alerted customers about an investment scam involving individual bond products, stating that ING does not offer such products.","notable_details":"ING offers a broad range of services including credit cards, personal loans, home loans, insurance, and superannuation. They have a strong focus on online banking and offer several benefits and discounts for online purchases of their insurance products and maintaining certain account balances.","focus":"Full Service"},"gemma.swan@ing.com.au":{"simplified_title":"Product Manager","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ING is offering discounts on various insurance products including car, home & contents, motorcycle, and pet insurance for the first year's premium when you purchase a policy online.","notable_details":"ING does not offer individual bond products and recommends speaking to a financial professional for investing in any type of asset or security.","focus":"Full service banking including everyday banking, savings accounts, credit cards, personal loans, home loans, insurance, superannuation, and commercial lending"},"garima.anand@ing.com.au":{"simplified_title":"Product Owner","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ING has recently issued an investment scam alert, informing its customers that the bank does not offer individual bond products and recommends consulting a financial professional when it comes to investing in any type of asset or security.","notable_details":"ING offers a range of products and services, including everyday banking, savings accounts, personal loans, credit cards, home loans, insurance, and superannuation. The bank also offers commercial loans and business deposits. Interestingly, they offer a range of discounts on their insurance products for the first year when purchased online, and they have a special Savings Maximiser account where customers can earn high interest rates if certain conditions are met.","focus":"Full service"},"elyse.farrelly-rogers@ing.com.au":{"simplified_title":"COO","simplified_name":"ING","industry":"Banking and Financial Services","spoken_industry":"banking and finance","type_of_bank":"Full Service Bank","news":"ING offering a variety of discounts on insurance products such as car, home & contents, motorcycle and pet insurance for the first year's premium when purchased online. There's also an alert about an investment scam involving individual bond products which ING does not offer.","notable_details":"ING offers a variety of banking products and services including credit cards, personal loans, property buying services, wealth building, and commercial lending. They offer competitive rates and benefits for customers who meet certain criteria like depositing $1,000+ from an external source and making 5+ card purchases that are settled (not pending) each month.","focus":"ING focuses on providing easy access to everyday banking with great benefits, offering a range of services from credit cards to loans to insurance. They also cater to business banking and commercial lending. Their products are designed to be straightforward and easy to understand, with incentives and discounts offered to customers who meet certain criteria. They also focus on accessibility, ensuring their banking services are available to individuals with disabilities."},"emily.abalos@ing.com.au":{"simplified_title":"Product Owner","simplified_name":"ING","industry":"Banking and Financial Services","spoken_industry":"banking and financial services","type_of_bank":"Full Service Bank","news":"ING is offering discounts on Car, Home & Contents, Motorcycle, and Pet Insurance for the first year's premium when you purchase a policy online. ING also posted an investment scam alert stating they do not offer individual bond products and recommend seeking professional advice for any type of asset or security investment.","notable_details":"ING provides a wide range of banking services including credit cards, personal loans, property buying, wealth building, and business services. They also have a focus on insurance products and offer a range of discounts on their policies. Their Savings Maximiser account offers competitive ongoing rates and benefits to customers who meet certain eligibility criteria. ING also offers a range of commercial property loans and business savings accounts with competitive rates.","focus":"Full Service Banking, Insurance and Commercial Lending"},"glenn.gibson@ing.com.au":{"simplified_title":"Head of Sales","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ING is offering discounts on various insurance policies including car, home, motorcycle and pet insurance. They have also issued an Investment Scam Alert, advising that they do not offer individual bond products.","notable_details":"ING offers a range of banking options including savings accounts, credit cards, personal loans, home loans, insurance, superannuation, and commercial lending. They also have special offers on various insurance products if purchased online, along with alerts about non-existent bond products.","focus":"Full Service Bank"},"grace.clark@ing.com.au":{"simplified_title":"Product Manager","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ING is currently offering discounts on various insurance products, including car, home & contents, motorcycle, and pet insurance. There is also a warning about an investment scam involving individual bond products. ING clarifies that they do not offer such products and advises customers to consult with financial professionals when considering any investment.","notable_details":"ING offers a wide array of financial services including personal and commercial loans, credit cards, superannuation, insurance, and everyday banking. They also offer a 'Savings Maximiser' account with competitive interest rates for customers who meet certain criteria. Notably, they have a proactive stance against financial scams and provide clear information about their offerings to prevent customer confusion.","focus":"Full Service"},"james.mclaughlin@ing.com.au":{"simplified_title":"Senior Product Manager","simplified_name":"ING","industry":"Banking and Financial Services","spoken_industry":"banking and financial services","type_of_bank":"Commercial Bank","news":"The bank is currently offering a 15% off on ING Car Insurance, ING Motorcycle Insurance, and ING Pet Insurance, and a 30% off on ING Home & Contents Insurance on your first year's premium when you purchase a policy online. They have also issued a scam alert regarding individual bond products.","notable_details":"ING provides a wide range of services including credit cards, personal loans, property buying, wealth building and business services. They offer a variety of insurance products and have a special focus on offering competitive rates and benefits for savings and everyday banking.","focus":"Full Service"},"jean.panuccio@ing.com.au":{"simplified_title":"Product Owner","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ING is offering various discounts on their insurance products including car, home & contents, motorcycle, and pet insurance. They've also posted an investment scam alert, warning customers that ING does not offer individual bond products.","notable_details":"ING offers a wide variety of banking and financial services, including credit cards, personal loans, home loans, superannuation, and insurance. They have a unique offer for their customers where they can get 1% cashback on eligible utility bills, and $0 international transaction fees, among other benefits, if certain conditions are met.","focus":"Full Service"},"joshua.sun@ing.com.au":{"simplified_title":"Product Owner","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial and Personal Bank","news":"The bank recently issued an investment scam alert, informing customers that it does not offer individual bond products and recommends customers to speak to a financial professional when it comes to investing in any type of asset or security.","notable_details":"ING offers a variety of services including home loans, personal loans, credit cards, savings accounts, and insurances. They also have a special focus on providing easy access to everyday banking with great benefits. ING also offers a feature where customers can get 1% cashback on eligible utility bills.","focus":"Full service"},"justin.chow@ing.com.au":{"simplified_title":"Product Manager","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"There is a current scam alert regarding individual bond products.","notable_details":"ING offers a range of insurance discounts for the first year's premium when purchased online. They also have a dedicated team for commercial property loans of more than $500,000 with over 25 years of experience in the real estate market.","focus":"Full Service"},"linda.dasilva@ing.com.au":{"simplified_title":"CIO","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ING is currently offering discounted rates on their various insurance products including car, home & contents, motorcycle, and pet insurance. They have also issued an investment scam alert stating that ING does not offer individual bond products, and recommends speaking to a financial professional when considering investments.","notable_details":"ING Bank offers a wide variety of services including personal and business banking, loans, insurance, and superannuation. It also provides a unique feature named 'Savings Maximiser' that offers benefits for depositing money and making card purchases.","focus":"Full service"},"michael.koumoukelis@ing.com.au":{"simplified_title":"Associate Product Manager","simplified_name":"ING","industry":"Banking and Financial Services","spoken_industry":"banking services","type_of_bank":"Commercial Bank","news":"ING has recently alerted their customers about an investment scam, stating that ING does not offer individual bond products and recommends speaking to a financial professional when investing in any type of asset or security.","notable_details":"ING provides a range of banking services from personal banking to commercial lending. ING is also offering discounts on various insurance policies when purchased online, including car, home & contents, motorcycle, and pet insurance. Their unique product 'Savings Maximiser' rewards customer's savings by offering higher interest rates for customers who meet certain criteria.","focus":"Full Service Bank"},"michael.micali@ing.com.au":{"simplified_title":"Product Owner","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full-service Bank","news":"Offering discounts on various insurance policies such as car, home & contents, motorcycle, and pet insurance when purchased online. Alert about an investment scam involving individual bond products which ING doesn't offer.","notable_details":"ING offers a range of banking services including credit cards, personal loans, home loans, insurance, and superannuation. They also provide commercial lending and business deposit services with a focus on real estate investments. They regularly offer discounts and benefits for customers who meet certain criteria, including rebates on international transaction fees and ATM withdrawal fees.","focus":"Full-service banking, Commercial lending, Insurance, Superannuation"},"mathan.ponnusamy@ing.com.au":{"simplified_title":"Product Owner","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ING is currently offering discounts on various insurance policies when purchased online including Car, Home & Contents, Motorcycle, and Pet insurance. They have also issued an investment scam alert informing that ING does not offer individual bond products. There is also mention of financial support available for those struggling with home loans, personal loans or credit cards.","notable_details":"ING offers a variety of services including savings and checking accounts, credit cards, personal and home loans, insurance, and superannuation. One of their unique offerings is the Orange Everyday account, where customers get cash back on eligible utility bills and international transaction fees waived if certain conditions are met. They also offer a low fixed interest rate personal loan and a value-packed low rate card with no annual fee.","focus":"Full service"},"mariam.janjgava@ing.com.au":{"simplified_title":"CIO","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ING is currently offering discounts on various insurance policies, such as car, home and contents, motorcycle, and pet insurance. They have issued an investment scam alert, warning customers that ING does not offer individual bond products. They are also providing financial support for their customers with home loans, personal loans or credit cards who need it.","notable_details":"ING has a variety of tools and services for their customers, which include credit cards, personal loans, property purchasing assistance, wealth building, and business services. They also offer a 'Savings Maximiser' feature for customers who meet certain criteria, allowing them to potentially earn higher interest rates on their savings. ING also offers a low rate card with no annual fee or a platinum card that gives cash back on customer spend.","focus":"Full-Service Bank"},"kim.zasadzki@ing.com.au":{"simplified_title":"Senior Product Manager","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full-Service Bank","news":"Recent news includes an investment scam alert where ING has stated that it does not offer individual bond products and recommends speaking to a financial professional when it comes to investing in any type of asset or security. Other news includes various discounts on insurance policies such as 15% off on ING Car, Motorcycle, and Pet Insurance and 30% off on ING Home & Contents Insurance on the first year's premium.","notable_details":"ING offers a wide variety of services including everyday banking, savings accounts, personal loans, credit cards, business services, commercial loans, insurance, and superannuation. They also offer a tool called Savings Maximiser which helps customers grow their savings balance. They provide financial support for customers who are struggling financially and have a dedicated customer care based in Australia. They are also compliant with the Banking Code of Practice developed by the Australian Banking Association.","focus":"Full Service (Everyday Banking, Savings, Loans, Insurance, Superannuation, Business Services)"},"mohit.dahiya@ing.com.au":{"simplified_title":"Product Owner","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial and Savings Bank","news":"ING is currently offering discounts on various insurance products including car, home & contents, motorcycle and pet insurance. There's also a warning about an investment scam alert, stating that ING does not offer individual bond products.","notable_details":"ING offers a range of banking and financial services including credit cards, personal loans, home loans, and insurance products. They also offer commercial lending and business deposit services. Their Savings Maximiser account offers competitive interest rates, provided certain conditions are met. They also have a focus on accessibility, with services designed for customers with disabilities.","focus":"Full service"},"parthiban.somasundaram@ing.com.au":{"simplified_title":"IT Platform Operations Manager","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ING is currently offering various discounts on their insurance products such as car, home & contents, motorcycle, and pet insurance. They have also issued an investment scam alert stating that ING does not offer individual bond products and recommends speaking to a financial professional when it comes to investing in any type of asset or security.","notable_details":"ING offers a range of financial products and services including everyday banking, savings accounts, personal loans, credit cards, home loans, insurance, and superannuation. They also provide services for businesses, including business savings accounts and commercial lending. Their Savings Maximiser account offers benefits such as competitive variable interest rates for customers who meet certain criteria.","focus":"Full Service"},"nirav.barot@ing.com.au":{"simplified_title":"Engineering Manager","simplified_name":"ING","industry":"Banking and Financial Services","spoken_industry":"banking and finance services","type_of_bank":"Commercial Bank","news":"The bank is currently offering discounts on various insurance services including car, home and contents, motorcycle, and pet insurance. There is also an alert about an investment scam regarding individual bond products. ING does not offer these products and recommends speaking to a financial professional when considering investing in any type of asset or security.","notable_details":"ING is focused on making banking more accessible and is committed to following the Banking Code of Practice, a set of commitments made to customers developed by banks in collaboration with the Australian Banking Association. The bank offers a range of services including credit cards, personal loans, home loans, superannuation, and commercial loans. It appears to be particularly customer-focused, offering a variety of tools and options to fit the individual needs of its customers.","focus":"Full Service Bank"},"steve.worrall@ing.com.au":{"simplified_title":"Head of Payment Services","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full Service Bank","news":"ING is currently offering discounts on various insurance policies when purchased online, including car, home & contents, motorcycle, and pet insurance. There is also an alert about an investment scam where ING does not offer individual bond products and recommends speaking to a financial professional when it comes to investing.","notable_details":"ING offers a wide range of services, including banking, credit cards, personal loans, home loans, commercial loans, insurance, and superannuation. They also have a strong focus on online banking and accessibility, providing several tools and resources online for their customers. They also have a warning about a potential investment scam involving bond products.","focus":"Full-service banking with a focus on online banking and accessibility, offering a variety of services including banking, credit cards, loans, insurance, and superannuation"},"phil.currie@kiwibank.co.nz":{"simplified_title":"Business Owner","simplified_name":"Kiwibank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Not Available","news":"Not Available","notable_details":"The website supports only up-to-date browsers and requires Javascript for a personalised banking journey.","focus":"Home loan services"},"sidnie.chan@judocapital.com.au":{"simplified_title":"Technology Sourcing Manager","simplified_name":"Judo Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Challenger Bank","news":"2023 Full year results","notable_details":"Judo Bank is Australia’s only challenger bank purpose-built for small and medium enterprises (SMEs). They are bringing back relationship banking and are committed to challenging the status quo to give SMEs a fairer go. They provide business lending solutions starting at $250,000, tailored to SMEs. Their team of experienced relationship bankers are located across the country. They also offer award-winning term deposits and their deposits are guaranteed under the Australian Government’s Financial Claims Scheme.","focus":"SME Banking"},"eric.geniaux@ingdirect.com.au":{"simplified_title":"CPO","simplified_name":"ING Australia","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"The bank has recently issued an alert about investment scams, specifically related to individual bond products. They are currently offering a series of discounts on various insurance policies, including car, home and contents, motorcycle, and pet insurance. There are also offers on savings maximiser accounts with certain eligibility criteria.","notable_details":"The bank appears to be very customer-centric, offering a range of tools and services to cater to various financial needs. They also have a dedicated support for commercial lending and business deposits. One unique feature is their Orange Everyday account that offers cashback on utility bills and international transaction fee waivers.","focus":"Full-service bank with a focus on everyday banking, savings, loans, insurances, and superannuation"},"daniel.katz@lll.org.au":{"simplified_title":"CITO","simplified_name":"LLL","industry":"Banking","spoken_industry":"banking","type_of_bank":"Savings Bank","news":"Recent posts on their blog include topics about customer data security, protection from remote access scams, generating passive income for businesses, and choosing an online kids’ savings account.","notable_details":"The bank is associated with the Lutheran Church of Australia and aims to transform money into a force for good. They offer savings accounts with no fees or charges, which are simple to use. They also provide accounts for children, businesses, self-managed super funds, and not-for-profit organizations.","focus":"Full Service Bank"},"grant.williams@newcastlepermanent.com.au":{"simplified_title":"Financial Crimes Systems and Analytics Manager","simplified_name":"Newcastle Permanent","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"Partnership with UoN helps refugee woman into the construction industry.","notable_details":"Newcastle Permanent offers an online cashback offer for those who refinance their home loans from another financial institution, with a $2,000 cashback for loans greater than or equal to $250,000 and LVR less than or equal to 80%.","focus":"Full Service Banking"},"guy.harding@newcastlepermanent.com.au":{"simplified_title":"CRO","simplified_name":"Newcastle Permanent","industry":"Banking","spoken_industry":"banking","type_of_bank":"Consumer bank","news":"Partnership with UoN helps refugee woman into the construction industry. Over 20,000 NSW students have registered to take part.","notable_details":"The bank offers a special interest rate for new borrowers applying for a Real Deal Home Loan for an owner occupied home with principal and interest repayments with a minimum balance of $150,000. Existing Newcastle Permanent customers are also eligible to receive the special interest rates under certain conditions.","focus":"Full service bank"},"mark.colless@newcastlepermanent.com.au":{"simplified_title":"CFO","simplified_name":"Newcastle Permanent","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Partnership with UoN helps refugee woman into the construction industry.","notable_details":"Newcastle Permanent is offering an online refinancing option with a $2,000 cashback incentive for loans greater than or equal to $250,000 and LVR less than or equal to 80%. They also have a special interest rate for new borrowers applying for a 'Real Deal Home Loan' for an owner occupied home with principal and interest repayments with a minimum balance of $150,000.","focus":"Full Service"},"scott.ross@lll.org.au":{"simplified_title":"CTO","simplified_name":"LLL","industry":"Banking and Financial Services","spoken_industry":"banking and financial services","type_of_bank":"Savings bank","news":["LLL CUSTOMER DATA SECURITY A word from our Chief Information Officer about customer data security. The recent data breach","PROTECT YOURSELF FROM REMOTE ACCESS SCAMS It's our mission at LLL to safeguard the interests of our depositors","CAN MY BUSINESS EARN A PASSIVE INCOME? Of course it can…and you don’t need to do a thing. In this ever-changing economic","WHAT TO LOOK FOR IN AN ONLINE KIDS’ SAVINGS ACCOUNT There are so many kids’ savings accounts on the market it can be difficult to"],"notable_details":"LLL Australia is a demonstration of the incredible power of people, united in faith, working together towards a common purpose – to transform money into a force for good. They offer savings accounts with no fees and charges that are simple to operate, such as personal and joint accounts; guardian accounts for children; and business accounts, including for self-managed super funds and not-for-profit organisations.","focus":"Full service, with a focus on providing business and financial support to the Lutheran Church of Australia (LCA) while providing excellent service to all customers and safeguarding the interests of depositors."},"simon.dezius@newcastlepermanent.com.au":{"simplified_title":"Head of Product","simplified_name":"Newcastle Permanent","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"Partnership with UoN helps refugee woman into the construction industry. Over 20,000 NSW students have registered to take part.","notable_details":"Newcastle Permanent offers an online savings account with a high-interest rate of 5.00% p.a. They also have a $2,000 cashback offer for online home loan refinances from another financial institution (excluding Greater Bank, part of NGM Group).","focus":"Full Service Bank"},"warren.willis@pnbank.com.au":{"simplified_title":"CTTO","simplified_name":"P&N Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Effective 1 August 2023, a new security layer for online banking has been implemented.","notable_details":"They acknowledge the Traditional Custodians of the land where they operate and pay respects to Elders past and present. This shows a cultural and societal awareness.","focus":"Full service"},"eric.wong@pnbank.com.au":{"simplified_title":"Senior Manager Digital Transformation","simplified_name":"P&N Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Effective 1 August 2023, we’ve implemented a new security layer for our online banking.","notable_details":"The bank acknowledges the Traditional Custodians of the land on which they work and pays respects to Elders past and present. Also, they have a mobile app for an enhanced mobile banking experience.","focus":"Full Service"},"jeff.yeoman@pnbank.com.au":{"simplified_title":"Senior Manager Enterprise Architecture","simplified_name":"P&N Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Effective 1 August 2023, P&N Bank has implemented a new security layer for their online banking.","notable_details":"P&N Bank acknowledges the Traditional Custodians of the land on which they work, showing a commitment to cultural respect and inclusion.","focus":"Full Service"},"jeslyn.kuan@pnbank.com.au":{"simplified_title":"Senior Manager Data & Analytics","simplified_name":"P&N Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Effective 1 August 2023, they’ve implemented a new security layer for their online banking.","notable_details":"They have an acknowledgement of country where they respectfully acknowledge the Traditional Custodians of the land on which they work and pay their respects to Elders past and present.","focus":"Full Service"},"anish.patel@orangecu.com.au":{"simplified_title":"CFO","simplified_name":"Orange Credit Union","industry":"Banking","spoken_industry":"banking","type_of_bank":"Regional Customer-Owned Bank","news":["Orange Credit Union introduces new CEO Lewis von Stieglitz to lead organisation into a thriving future.","Community Grants Support Program 2023 successful projects announced in a year of record applications.","In light of increasing online security threats across all industries, Orange Credit Union have conducted a review of security."],"notable_details":"Orange Credit Union is a regional customer-owned bank based in Orange which has been helping the community for almost 60 years. Their profits go back to their customers through innovative services and to support the development of customers and their community.","focus":"Financial Wellness and Local Community Support"},"sean.lockley@pnbank.com.au":{"simplified_title":"Delivery Lead","simplified_name":"P&N Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Effective 1 August 2023, a new security layer has been implemented for their online banking.","notable_details":"P&N Bank respectfully acknowledges the Traditional Custodians of the land on which they work and pay respects to Elders past and present.","focus":"Full service"},"sonya.meehan@pnbank.com.au":{"simplified_title":"Senior Manager Retail Products","simplified_name":"P&N Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Effective 1 August 2023, a new security layer has been implemented for our online banking.","notable_details":"P&N Bank is also known as the Police & Nurses Limited, and they have a strong focus on security, as evidenced by their recent implementation of a new security layer for online banking.","focus":"Full Service"},"richard.young@pnbank.com.au":{"simplified_title":"Product Owner","simplified_name":"P&N Bank","industry":"Banking","spoken_industry":"banking services","type_of_bank":"Credit Union","news":"Effective 1 August 2023, they’ve implemented a new security layer for their online banking.","notable_details":"P&N Bank respectfully acknowledges the Traditional Custodians of the land on which they work and pay their respects to Elders past and present, showing their commitment to local communities and cultural respect.","focus":"Full Service"},"josie.king@qbank.com.au":{"simplified_title":"CRGO","simplified_name":"QBANK","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"QBANK has recently been awarded three MOZO Experts Choice Awards for its Home Loan products. They've also introduced a new Green Car Loan for members purchasing or refinancing an eligible plug-in hybrid electric vehicle (PHEV) or electric vehicle (EV).","notable_details":"The QBANK places strong emphasis on ethical and compliant employment practices ensuring the safe, fair, and respectful treatment of staff. They are committed to social responsibility, environmental sustainability, and financial wellbeing. Moreover, they have a new QBANK App which allows for instant 24/7 money transfers, account management, and more.","focus":"Full Service"},"rollie.parame@qbank.com.au":{"simplified_title":"Business Delivery Lead","simplified_name":"QBANK","industry":"Banking","spoken_industry":"banking","type_of_bank":"Retail Bank","news":"QBANK recently won three MOZO Experts Choice Awards for their Home Loan products. They are also accepting nominations for the 2023 Everyday Heroes Awards. In addition, they have launched a new Green Car Loan for members purchasing or refinancing an eligible plug-in hybrid electric vehicle (PHEV) or electric vehicle (EV).","notable_details":"QBANK has a strong focus on ethical and compliant employment practices. They emphasize the importance of an engaged and inclusive workplace. They also are committed to social responsibility, environmental sustainability, and financial well-being. Moreover, they acknowledge the Traditional Owners of the lands on which they operate and pay respects to Elders past, present, and emerging.","focus":"Full Service"},"kelly.smith@qbank.com.au":{"simplified_title":"CFO","simplified_name":"QBANK","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"QBANK has recently been awarded three MOZO Experts Choice Awards for their Home Loan products. They have also launched a new green car loan for members purchasing or refinancing an eligible plug-in hybrid electric vehicle (PHEV) or electric vehicle (EV).","notable_details":"QBANK places strong emphasis on ethical and compliant employment practices and is committed to social responsibility, environmental sustainability and financial wellbeing. They also offer support for first home buyers with a First Home Guarantee (FHBG). The bank operates under the acknowledgement of the Traditional Owners of the lands and respects Elders past, present, and emerging.","focus":"full service"},"karla.day@qbank.com.au":{"simplified_title":"CIO","simplified_name":"QBANK","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"QBank has recently been awarded three Mozo Experts Choice Awards for their Home Loan products. They have also launched a new Green Car Loan for members purchasing or refinancing an eligible plug-in hybrid electric vehicle (PHEV) or electric vehicle (EV). In addition, they have released a new banking app for more convenient banking for their members.","notable_details":"QBank places strong emphasis on ethical and compliant employment practices to ensure the safe, fair and respectful treatment of their staff. They are committed to social responsibility, environmental sustainability and financial wellbeing, adopting sound governance and internal controls. They also acknowledge the Traditional Owners of the lands on which they operate, recognizing the important role Aboriginal and Torres Strait Islander peoples continue to play within the communities where QBANK operates.","focus":"Full Service"},"ingrid.child@rabobank.com":{"simplified_title":"CRO","simplified_name":"Rabobank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Wholesale and Rural Bank","news":"No recent news posted on the website.","notable_details":"The bank emphasizes its impact on 'Growing a Better World Together', indicating a focus on sustainable and community-oriented banking practices.","focus":"Wholesale and Rural Banking"},"jamie.turnbull@rabobank.com":{"simplified_title":"Business Analytics Manager","simplified_name":"Rabobank","industry":"Banking","spoken_industry":"banking industry","type_of_bank":"Wholesale and Rural Bank","news":"Not available","notable_details":"Rabobank seems to have a strong focus on sustainability and rural development with their 'Road to Change' and 'Growing a Better World Together' initiatives. They also offer videos, podcasts, and information about relevant products and services on their website.","focus":"Rabobank is focused on wholesale and rural banking services, with significant efforts towards sustainable development and rural growth."},"jolene.janzen@rabobank.com":{"simplified_title":"COO","simplified_name":"Rabobank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Wholesale and rural bank","news":"Growing a better world together - Learn more about the food revolution","notable_details":"The bank has a strong focus on sustainability and food security, as indicated by their 'Road to Change' initiative and their featured news about the food revolution.","focus":"Wholesale and rural banking services"},"namby.srinivasan@rabobank.com":{"simplified_title":"Head of IT Systems","simplified_name":"Rabobank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"None provided in the content","notable_details":"Rabobank has a significant focus on rural and wholesale banking. They also seem to have an emphasis on sustainable practices, as indicated by their 'Growing a Better World Together' initiative.","focus":"Wholesale and Rural Banking"},"priya.gangadharan@rabobank.com":{"simplified_title":"Product Data Analytics Manager","simplified_name":"Rabobank","industry":"Banking","spoken_industry":"banking industry","type_of_bank":"Wholesale and Rural Bank","news":"Growing a better world together, Learn more about the food revolution","notable_details":"The bank uses cookies to optimize customer experience and provides a range of services including videos, podcasts and information about relevant products on Rabobank.com and research.rabobank.com.","focus":"Rural and wholesale banking"},"simon.hall@rabobank.com":{"simplified_title":"Regional Area Lead","simplified_name":"Rabobank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Wholesale Bank","news":"Growing a better world together: Learn more about the food revolution","notable_details":"Rabobank is committed to using their platform for social change, evident in their 'Road to Change' initiative and their focus on the 'food revolution'.","focus":"Wholesale and Rural banking"},"claire.watts@stgeorge.com.au":{"simplified_title":"Business Development Manager","simplified_name":"St.George","industry":"Banking","spoken_industry":"banking","type_of_bank":"Corporate Bank","news":"St.George Bank is offering a $2K cashback offer for those who refinance their home loans with them. The offer is valid until 31/08/2023 and has a minimum loan amount of $250k and LVR up to 80%.","notable_details":"St.George Bank offers a variety of services beyond banking, including landlord insurance and personal loans. They also provide support for customers in need of extra care due to financial difficulty or personal circumstances.","focus":"Full Service"},"ibrahim.hanania@stgeorge.com.au":{"simplified_title":"State Lead","simplified_name":"St.George Bank","industry":"Banking","spoken_industry":"banking industry","type_of_bank":"Corporate Bank","news":"St.George bank is offering a $2K cashback for customers who refinance their home loan. The offer is valid until 31/08/2023 for loans of a minimum amount of $250k and LVR up to 80%","notable_details":"St.George Bank acknowledges the traditional owners as the custodians of this land, recognising their connection to land, waters and community. They pay their respects to Australia’s First Peoples, and to their Elders past and present.","focus":"Full Service Bank"},"reino.roche@stgeorge.com.au":{"simplified_title":"Senior Product Manager","simplified_name":"St.George","industry":"Banking","spoken_industry":"banking","type_of_bank":"Corporate Bank","news":"St.George is offering $2K cashback for those who refinance their home loan to St.George. This offer is valid till 31/08/2023 and has conditions like minimum loan amount of $250k and LVR up to 80%.","notable_details":"St.George acknowledges the traditional owners as the custodians of this land, recognising their connection to land, waters and community. They pay their respects to Australia’s First Peoples, and to their Elders past and present.","focus":"Full Service"},"melanie_heidemann@swscu.com.au":{"simplified_title":"CRO","simplified_name":"South West Slopes Credit Union","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"SWSCU has moved to enable SMS One Time Passwords (OTP) for all members that use internet banking. Using an OTP will enhance the security of your online transactions.","notable_details":"SWSCU offers a unique 'Greener Futures Loans' for energy efficient or environmentally friendly products.","focus":"Full Service"},"salatnayi@stgeorge.com.au":{"simplified_title":"Product Manager","simplified_name":"St.George","industry":"Banking","spoken_industry":"banking sector","type_of_bank":"Corporate Bank","news":"St.George Bank is offering a $2K cashback on refinancing your home loan. They have also introduced a new landlord insurance policy and a term deposit with a fixed rate of 4.75% p.a. available on 12-23 month terms.","notable_details":"The bank acknowledges the traditional owners as the custodians of the land, recognizing their connection to land, waters, and community. They pay their respects to Australia’s First Peoples, and to their Elders past and present.","focus":"Full Service Bank"},"michael.cameron@stgeorge.com.au":{"simplified_title":"CFO","simplified_name":"St.George","industry":"Banking","spoken_industry":"banking","type_of_bank":"Corporate Bank","news":"Recently, St.George bank has introduced a new offer where you can get $2K cashback when you refinance your home loan with them. The offer is valid until 31/08/2023.","notable_details":"St.George bank has an impressive Term Deposit rate of 4.75% p.a. This rate is available on 12-23 month terms on deposits ranging from $1K to $5M. They also offer ROARSOME Landlord Insurance, providing cover for damage or loss from various events and circumstances.","focus":"Full Service Bank"},"martin.brady@stgeorge.com.au":{"simplified_title":"Remediation Manager","simplified_name":"St.George","industry":"Banking","spoken_industry":"banking","type_of_bank":"Corporate Bank","news":"$2K cashback when you refinance your home loan to St.George by 31/08/2023. Min loan amount $250k and LVR up to 80%. Eligibility criteria, exclusions, fees apply.","notable_details":"St.George acknowledges the traditional owners as the custodians of this land, recognising their connection to land, waters and community. They pay their respects to Australia’s First Peoples, and to their Elders past and present.","focus":"Full Service"},"russellc@stgeorge.com.au":{"simplified_title":"Collections Manager","simplified_name":"St.George Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Corporate","news":"St.George is currently offering a $2K cashback when customers refinance their home loan. It also offers a new Landlord Insurance product for protection against damage or loss due to various events. They also promote a personal loan product for car purchases and a Term Deposit with a 4.75% p.a. fixed rate.","notable_details":"St.George Bank acknowledges traditional owners as custodians of the land, showing their connection and respect to the indigenous community. They also have a dedicated section for customers in need of extra care, showing their commitment to customer service and care.","focus":"Full service"},"meghan.johnstone@stgeorge.com.au":{"simplified_title":"Transformation Manager","simplified_name":"St.George","industry":"Banking","spoken_industry":"banking","type_of_bank":"Corporate Bank","news":"The bank is currently offering a $2K cashback for customers who refinance their home loan. They also have a new offer on landlord insurance, covering damage or loss from various insured events. There's also an offer for a fixed-rate Term Deposit with 4.75% p.a.","notable_details":"St.George acknowledges the traditional owners as the custodians of this land, recognizing their connection to land, waters, and community. They pay their respect to Australia’s First Peoples, and to their Elders past and present. This shows a sense of corporate social responsibility.","focus":"Full Service"},"malcolm.stedman@suncorpbank.com.au":{"simplified_title":"CFO","simplified_name":"Suncorp Bank","industry":"Banking and Insurance","spoken_industry":"banking and insurance services","type_of_bank":"Full Service Bank","news":"Suncorp Bank is offering a promotion for their Suncorp Clear Options Platinum Credit Card where customers can earn 70,000 bonus Qantas Points when they spend $3,000 in the first 3 months. They have also extended their partnership with Armaguard and atmx, increasing their network of fee-free cash deposit ATMs. In addition, they have partnered with OzHarvest, Australia’s leading food rescue organisation, to help save food, money, and the planet.","notable_details":"The bank is making efforts to be more environmentally friendly with their Carbon Insights Account and encouraging customers to make eco-upgrades to their homes. They also have a focus on financial literacy, especially for young people, through their partnership with the Financial Basics Foundation.","focus":"Full Service including banking, loans, insurance and credit cards"},"gsargeant@tmbl.com.au":{"simplified_title":"CFO","simplified_name":"Teachers Mutual Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"No recent news posted on the website.","notable_details":"Teachers Mutual Bank Limited acknowledges the Traditional Custodians of Country through Australia and their continuing connection to land, water and communities. They also have divisions specifically for Teachers, Health Professionals, Firefighters, UniBank, and Hiver Bank.","focus":"Full Service"},"epickford@tmbl.com.au":{"simplified_title":"COO","simplified_name":"Teachers Mutual Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"No recent news posted on the website.","notable_details":"Teachers Mutual Bank operates multiple divisions targeting different professional groups: Teachers Mutual Bank, Health Professionals Bank, Firefighters Mutual Bank, UniBank, and Hiver Bank.","focus":"Full service targeted towards key workers including teachers, health professionals, firefighters, university employees, and others."},"ritchie@theiagroup.com.au":{"simplified_title":"Head of Technology","simplified_name":"Resimac Asset Finance","industry":"Finance","spoken_industry":"finance","type_of_bank":"Commercial Lending Bank","news":"The bank is currently experiencing technical issues with their phone system.","notable_details":"Resimac Asset Finance is actively involved in environmental conservation, supporting tree planting projects across Australia through a partnership with non-profit group Carbon Positive. Their parent company has helped plant more than 40,000 trees over a 10 year period.","focus":"Lending solutions for commercial borrowers and consumers, including loan options for business vehicle finance, equipment finance, secured loans and insurance premium loans."},"mappleby@tmbl.com.au":{"simplified_title":"Product Owner","simplified_name":"Teachers Mutual Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"No recent news posted on the website.","notable_details":"Teachers Mutual Bank Limited operates various divisions including Teachers Mutual Bank, Health Professionals Bank, Firefighters Mutual Bank, UniBank, and Hiver Bank.","focus":"Full Service"},"lnguyen@tmbl.com.au":{"simplified_title":"IT Commercial Manager","simplified_name":"Teachers Mutual Bank","industry":"Banking","spoken_industry":"banking sector","type_of_bank":"Mutual Bank","news":"Not available from the given content","notable_details":"This bank is unique as it is dedicated to key workers such as teachers, health professionals, firefighters, and university staff. It operates under several names including Teachers Mutual Bank, Health Professionals Bank, Firefighters Mutual Bank, UniBank, and Hiver Bank, all of which are divisions of Teachers Mutual Bank Limited.","focus":"Full service, Lending"},"ktait@unitybank.com.au":{"simplified_title":"CRO","simplified_name":"Unity Bank","industry":"Unable to determine","spoken_industry":"Unable to determine","type_of_bank":"Unable to determine","news":"No recent news posted on the website","notable_details":"The bank has a large number of branches and appears to operate on varying schedules, with some locations closed for a period in the middle of the day.","focus":"Unable to determine"},"anson.parker@up.com.au":{"simplified_title":"CPO","simplified_name":"Up","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mobile Bank","news":"No recent news posted on the website","notable_details":"Up is a brand of Bendigo and Adelaide Bank Limited, and it's a 100% mobile banking service. It has a unique focus on easy budgeting, easy saving, and easy transactions with mates. The bank also has a co-op mode, called 2Up, to fight finances together. They also offer easy account closing if you don't like the service, which is not common in traditional banks.","focus":"Mobile banking, easy budgeting, easy saving, and easy transactions"},"tom@up.com.au":{"simplified_title":"Engineering Manager","simplified_name":"Up","industry":"Banking","spoken_industry":"banking services","type_of_bank":"Mobile Bank","news":"No recent news posted on the website.","notable_details":"Up is a mobile banking service that offers features like easy budgeting, easy saving, and easy transactions with friends. The bank also provides local support 7 days a week through their in-app chat function. Up is a brand of Bendigo and Adelaide Bank Limited.","focus":"Fintech"},"nathan@athena.com.au":{"simplified_title":"CEO","simplified_name":"Athena Home Loans","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Non-Bank Lender","news":"No specific news found","notable_details":"Athena is a certified B-Corp, indicating their commitment to balance purpose - caring for people & the planet - and profit. They claim to charge zero fees for their 'Straight Up' and 'Power Up' home loan products, and offer an innovative 'drop your rate' feature where the more you pay down your loan, the more your rate decreases. They also display a commitment to fairness with their 'automatic rate match', promising that if they ever offer new customers a lower rate on a like-for-like loan, anyone who’s on it will get the automatic rate-match.","focus":"Home Loan Lending"},"sara@athena.com.au":{"simplified_title":"Director","simplified_name":"Athena Home Loans","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Fintech","news":"No specific recent news is mentioned on the website","notable_details":"Athena offers a unique feature called Athena Accelerates, which drops the customer's rate the more they pay down on their loan. The company is a certified B-Corp, balancing purpose and profit. They also highlight their commitment to fair banking with no fees and no loyalty tax.","focus":"Home Loans"},"charper@australianunity.com.au":{"simplified_title":"General Manager","simplified_name":"Australian Unity","industry":"Banking and Insurance","spoken_industry":"banking and insurance services","type_of_bank":"Member-owned bank","news":"Celebrating 20 years of wellbeing research. Partnering with Deakin University since 2000 to deliver one of the most credible and enduring studies of wellbeing in Australia.","notable_details":"The bank offers a wide range of services beyond banking, including health insurance, wealth and investment solutions, home care services, retirement communities, and aged care. They have been supporting the wellbeing of Australians since 1840 and are committed to creating positive social value. They have a unique focus on 'Real Wellbeing', with resources to help improve this for their customers.","focus":"Full-service bank with a focus on personal service, competitive rates, and wellbeing of its customers"},"jsaliba@australianunity.com.au":{"simplified_title":"General Manager","simplified_name":"Australian Unity","industry":"Banking and Insurance","spoken_industry":"banking and insurance services","type_of_bank":"Full Service Bank","news":"Best ever rate offered up to 5.40% P.A with a 4 month bonus interest rate on their Easy Saver Account","notable_details":"The bank has been supporting the wellbeing of Australians since 1840, offers home care services for Aboriginal people, by Aboriginal people, and has a Reconciliation Action Plan committed to building strong, respectful relationships with Aboriginal and Torres Strait Islander communities.","focus":"Full service including wealth solutions, insurance, banking and health care services with a special focus on wellbeing"},"rprasad@australianunity.com.au":{"simplified_title":"General Manager Mortgages","simplified_name":"Australian Unity","industry":"Banking and Insurance","spoken_industry":"banking and insurance","type_of_bank":"Member-Owned Bank","news":"The bank is offering an exceptional rate of up to 5.40% p.a with a 4-month bonus interest rate on their Easy Saver Account. It's a limited-time offer and available only for customers who have never held an Easy Saver Account before.","notable_details":"Australian Unity is not just a bank, but a multifaceted institution providing health insurance, wealth solutions, home care services for Aboriginal people, and retirement communities. They are member-owned and have been serving the Australian community since 1840.","focus":"Full-service bank with a strong community focus, providing banking, insurance, wealth solutions, and assisted living services."},"marryan@australianunity.com.au":{"simplified_title":"General Manager","simplified_name":"Australian Unity","industry":"Banking, Insurance, Health, and Wealth Management","spoken_industry":"banking, insurance, health and wealth management services","type_of_bank":"Full Service Bank","news":"Not specifically mentioned","notable_details":"Australian Unity has been operating since 1840, making it one of the oldest existing companies in Australia. It is a member-owned company, investing in the products and services that matter to its members, customers, and the community. They also have a strong focus on community impact and have been partnering with Deakin University since 2000 to deliver one of the most credible and enduring studies of wellbeing in Australia.","focus":"The bank focuses on providing a range of services including banking, insurance, health and wealth management. They also provide services in the areas of retirement living, home care, Aboriginal home care and allied health services. Their banking services focus on personalized service and competitive rates."},"rspeas@australianunity.com.au":{"simplified_title":"General Manager Commercial Finance & Strategy","simplified_name":"Australian Unity","industry":"Banking and Insurance","spoken_industry":"banking and insurance services","type_of_bank":"Member-owned Bank","news":"Celebrating 20 years of wellbeing research, Partnering with Deakin University since 2000 to deliver one of the most credible and enduring studies of wellbeing in Australia.","notable_details":"Australian Unity has been supporting the wellbeing of Australians since 1840, making it one of the oldest health insurance funds in Australia. They also offer a wide range of services from banking and insurance to wealth management and aged care. The bank also mentions that they are member-owned and invest in products that matter to their members and the community.","focus":"Full Service Bank with a focus on Personalised Service and Competitive Rates"},"abright@australianunity.com.au":{"simplified_title":"General Manager","simplified_name":"Australian Unity","industry":"Banking and Insurance","spoken_industry":"banking and insurance services","type_of_bank":"Full-service Bank","news":"The bank is currently running a special offer where if you join Hospital & Extras by 3 November 2023, you get 6 weeks free coverage and they will waive all 2-month and optical waiting periods on extras.","notable_details":"Australian Unity is a member-owned institution that has been in operation since 1840, making it one of Australia's oldest banks. They are also engaged in wellbeing research, having been measuring the wellbeing of Australians for 20 years. They offer services to Aboriginal people, provided by Aboriginal people. The bank also has a Reconciliation Action Plan and is committed to building relationships with Aboriginal and Torres Strait Islander communities.","focus":"Australian Unity is a full-service bank offering a wide range of services including health insurance, wealth and investment solutions, banking, and insurance. They also provide independent and assisted living services such as aged care, retirement living, home care, and aboriginal home care. Their focus is on personalized service, competitive rates, and the overall well-being of their customers."},"clonergan@auswidebank.com.au":{"simplified_title":"CRO","simplified_name":"Auswide Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"The bank recently posted advice on how to grow money securely, tips to face rising costs of living, and awareness on tax scams.","notable_details":"The bank has been providing award-winning banking services for over 55 years, and is also committed to sustainability. The bank also acknowledges the important role Aboriginal and Torres Strait Islander peoples continue to play within the communities in which Auswide Bank operates and where their team members reside.","focus":"Full Service"},"kholden@bankvic.com.au":{"simplified_title":"CFO","simplified_name":"BankVic","industry":"Banking","spoken_industry":"banking services","type_of_bank":"Credit Union","news":"The bank is currently offering a low variable rate home loan at 5.70 %p.a.","notable_details":"This bank is 100% owned by its members and it's specifically designed to serve Police, health and the emergency services. All their profits are reinvested into their business or the communities they're a part of.","focus":"Full service"},"swhiteling@bankvic.com.au":{"simplified_title":"CRO","simplified_name":"BankVic","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Get great value with a low variable rate home loan 5.70 %p.a Variable rate 5.70 %p.a Comparison rate. Terms and conditions apply.","notable_details":"The bank is 100% owned by its members and all profits are reinvested into the business or the communities they are a part of. They are specifically designed to serve Police, health and the emergency services.","focus":"Full Service"},"sbutler@auswidebank.com.au":{"simplified_title":"General Manager Operations","simplified_name":"Auswide Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"The bank recently posted articles offering advice on growing money, dealing with the rising cost of living, and how to avoid tax scams.","notable_details":"Auswide Bank has been providing award-winning banking for over 55 years, and they proudly support the Maroons. They acknowledge the Traditional Owners of the lands on which they operate and pay respects to Elders past and present, as well as Aboriginal and Torres Strait Islander peoples who continue to play important roles in the communities where Auswide Bank operates.","focus":"Full service"},"philippa.costanzo@bankwest.com.au":{"simplified_title":"General Manager","simplified_name":"Bankwest","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"The bank is offering its customers the chance to win a double pass to the biggest footy match of the year, along with two return flights with Virgin Australia from the nearest Australian capital city and two nights at the Grand Hyatt Melbourne.","notable_details":"Bankwest provides unique customer perks like access to exclusive offers, discounts, and tickets with RAC Arena, Optus Stadium and the Freo Dockers. The bank is committed to helping its customers manage their finances during difficult times, offering online resources and support. They also offer flexible products, like their simple home loan and savings accounts, allowing customers to tailor their banking experience to their needs.","focus":"Full service"},"paulranson@bankofus.com.au":{"simplified_title":"CEO","simplified_name":"Bank of Us","industry":"Banking","spoken_industry":"banking services","type_of_bank":"Retail Bank","news":"Bank of Us has recently appointed a new Chief Financial Officer. They are also alerting their customers about the latest scams and they have a new offer of 5.00P.A. 6 Months term investments for Tasmanian residents only.","notable_details":"Bank of Us is a Tasmanian based bank that provides a range of banking products and services. They are the accredited lending services provider for MyHome, a Tasmanian Government initiative aimed at assisting eligible home buyers. They are also offering special deals for St.LukesHealth members. They pride themselves on customer service and having a 'real voice' on the phone for their customers.","focus":"Retail Banking Services, Home Loans, Term Deposits"},"rlinderberg@auswidebank.com.au":{"simplified_title":"General Manager","simplified_name":"Auswide Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full-service bank","news":"The latest articles posted on the site provide advice on growing money, dealing with rising costs, and avoiding tax scams.","notable_details":"Auswide Bank has a focus on sustainability and has been providing award-winning banking services for over 55 years. They also show respect and acknowledgment to the Traditional Owners of the lands on which they operate, and recognize the role of Aboriginal and Torres Strait Islander peoples in their communities.","focus":"Auswide Bank provides a full range of banking services including home loans, personal loans, car loans, credit cards, savings and term deposits, business and club accounts as well as general insurance."},"nickbird@bankofus.com.au":{"simplified_title":"CIO","simplified_name":"Bank of Us","industry":"Banking","spoken_industry":"banking","type_of_bank":"Retail Bank","news":"Bank of us has appointed a new Chief Financial Officer. They also have a warning about scams and have released a SmartBanking App with features such as online PIN change, quick login options, in-app calculators, and more.","notable_details":"Bank of us is a trading name of B&E Ltd. They are Tasmania’s own bank and only serve Tasmanian residents. They have a strong focus on community and customer service, with a unique tagline: 'It’s the ‘us’ that’s a plus at Tasmania’s own Bank of us'. They also acknowledge and pay respect to the palawa - Tasmanian Aboriginal people - as the traditional owners of all the lands and waters.","focus":"Retail banking, lending services"},"mbarrett@auswidebank.com.au":{"simplified_title":"CEO","simplified_name":"Auswide Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full Service Bank","news":"Auswide Bank has posted several articles on their website. They cover a range of topics including finding secure ways to grow your money, tips to face rising costs of living, and advice on how to avoid falling victim to tax scams.","notable_details":"Auswide Bank has been operating for over 55 years and has won awards for their banking services. They also acknowledge the Traditional Owners of the lands on which they operate and pay respects to Elders past and present, as well as emerging community leaders. They have a particular focus on sustainability and have a clear commitment to the communities in which they operate.","focus":"Auswide Bank is a full-service bank offering a wide range of services including home and personal loans, everyday banking, savings and term deposits, credit cards, business and club accounts, travel & international money services, and investing options. They are also committed to sustainability and community engagement."},"bschafer@auswidebank.com.au":{"simplified_title":"CFO","simplified_name":"Auswide Bank","industry":"Banking","spoken_industry":"banking services","type_of_bank":"Full Service Bank","news":["Finding an easy and secure way to grow your money might sound easier said than done, but if you’ve got some savings set aside, a term deposit might be a good option.","If you’re like many Australians who struggle with the cost of living, we’ve put together some tips to help you face rising costs.","It's essential to be aware of tax scams and by understanding the common tactics used by scammers, you can avoid falling victim to them."],"notable_details":"Auswide Bank acknowledges the Traditional Owners of the lands on which they operate and pay respects to Elders past and present, and emerging community leaders. They also acknowledge the important role Aboriginal and Torres Strait Islander peoples continue to play within the communities in which Auswide Bank operates and where their team members reside.","focus":"Full service including home loans, personal loans, credit cards, savings and term deposits, business and club accounts, travel & international money, and general insurance."},"steve.nagle@bankwest.com.au":{"simplified_title":"Director","simplified_name":"Bankwest","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"Bankwest is running a competition for customers to win a double pass to the AFL Grand Final. The prize includes two return flights with Virgin Australia from the winner's nearest Australian capital city and two nights at the Grand Hyatt Melbourne.","notable_details":"Bankwest offers unique perks to its customers including access to exclusive offers, discounts, and tickets with RAC Arena, Optus Stadium, and the Freo Dockers.","focus":"Full Service"},"bruce.thornton@bankwest.com.au":{"simplified_title":"Program Director","simplified_name":"Bankwest","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"The bank is offering a chance for customers to win a double pass to the biggest footy match of the year, along with two return flights with Virgin Australia from the nearest Australian capital city and two nights at the Grand Hyatt Melbourne.","notable_details":"Bankwest offers unique customer perks such as access to exclusive offers, discounts and tickets with RAC Arena, Optus Stadium and the Freo Dockers. They also enable customers to customize their home loans by selecting only the features they need, potentially saving on fees.","focus":"Full service"},"craig.adam@bankwest.com.au":{"simplified_title":"CFO","simplified_name":"Bankwest","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"Bankwest customers have the chance to win a double pass to the AFL Grand Final, along with two return flights with Virgin Australia from the nearest Australian capital city and two nights at the Grand Hyatt Melbourne.","notable_details":"Bankwest offers unique customer perks such as access to exclusive offers, discounts, and tickets with partners such as RAC Arena, Optus Stadium, and the Freo Dockers.","focus":"Full service"},"sharon.bromley@bankwest.com.au":{"simplified_title":"COO","simplified_name":"Bankwest","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"Bankwest is offering customers the chance to win a double pass to the AFL Grand Final, along with two return flights with Virgin Australia from your nearest Australian capital city and two nights at the Grand Hyatt Melbourne.","notable_details":"Bankwest is a division of Commonwealth Bank of Australia. They offer exclusive access to offers, discounts, and tickets with RAC Arena, Optus Stadium, and the Freo Dockers. They also have a variety of banking services including home loans, savings accounts, and credit cards.","focus":"Full Service"},"george.westcott@bankwest.com.au":{"simplified_title":"General Manager Strategy","simplified_name":"Bankwest","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"Recently, Bankwest has made changes to their business banking services and is offering customers the chance to win a double pass to the AFL Grand Final, along with two return flights with Virgin Australia from their nearest Australian capital city and two nights at the Grand Hyatt Melbourne.","notable_details":"Bankwest provides a unique experience for its customers with access to exclusive offers, discounts, and tickets with RAC Arena, Optus Stadium, and the Freo Dockers. The bank also offers flexible savings accounts where customers can earn interest even when they move money in and out of their savings, with interest calculated daily. There is also an emphasis on customer support during difficult times, providing resources on how to stay on top of banking.","focus":"Full Service"},"jason.chan@bankwest.com.au":{"simplified_title":"Executive General Manager","simplified_name":"Bankwest","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full Service Bank","news":"Bankwest is conducting an AFL Grand Final competition where customers have a chance to win a double pass to the biggest footy match of the year, along with two return flights with Virgin Australia from your nearest Australian capital city and two nights at the Grand Hyatt Melbourne.","notable_details":"Bankwest offers unique customer perks such as access to exclusive offers, discounts, and tickets with RAC Arena, Optus Stadium and the Freo Dockers. They also offer a Bankwest Simple Home Loan with a variable rate of 6.19% p.a and a comparison rate of 6.21% p.a, which is designed to give customers control by only selecting the features they need, potentially saving on fees.","focus":"Full service banking for both personal and business customers, with a range of products including home loans, savings accounts and credit cards. They also offer a unique focus on flexibility and customer perks."},"san.midha@bluestone.com.au":{"simplified_title":"CFO","simplified_name":"Bluestone","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Non-Bank","news":"No recent news posted on the website.","notable_details":"Bluestone Home Loans offers streamlined and flexible loan approval with no credit scoring. They also offer a range of home loans for different categories of borrowers, including those who are self-employed or need an alternative way to prove their income. They don't offer transaction accounts or credit cards as they are a non-bank institution.","focus":"Lending"},"megan.windeyer@bankwest.com.au":{"simplified_title":"Executive Advisor to the CIO","simplified_name":"Bankwest","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"The bank is offering customers the chance to win a double pass to the biggest footy match of the year, along with two return flights with Virgin Australia from your nearest Australian capital city and two nights at the Grand Hyatt Melbourne.","notable_details":"The bank has a unique customer perks program which includes access to exclusive offers, discounts and tickets with RAC Arena, Optus Stadium and the Freo Dockers. The bank also offers a variety of banking solutions like the Bankwest Simple Home Loan which is a variable rate home loan with less fees and less fuss, and savings accounts which earn interest even when you move money in and out of your account.","focus":"Full service"},"gknuckey@beyondbank.com.au":{"simplified_title":"Director","simplified_name":"Beyond Bank","industry":"Banking","spoken_industry":"banking industry","type_of_bank":"Customer-Owned Bank","news":"Beyond Bank was awarded 'Most Satisfied Customers' in Canstar's Customer-Owned Bank Award 2023. In 2023, Beyond Bank will give back over $680,000 to clubs and causes that their customers choose to support through the Community Reward Account.","notable_details":"Beyond Bank is a unique bank that is 100% owned by its customers, returning value to the communities in which they live and operate. It is committed to supporting community causes and offers a unique savings account, the Community Reward Account, which helps to fundraise for local clubs or causes.","focus":"Full-service banking with a strong focus on community support"},"alexisairey@gatewaybank.com.au":{"simplified_title":"CEO","simplified_name":"Gateway Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"The bank has recently introduced a new product, the Eco Visa Debit Card, which is made from plants, not plastic. They have also announced their 2023 Annual General Meeting.","notable_details":"Gateway Bank is making efforts to be environmentally friendly, as shown by their plant-based Eco Visa Debit Card and their slogan 'Because banking shouldn't cost the Earth'. They also offer a high-interest savings account, the EMax Saver, with an interest rate up to 3.30% p.a.","focus":"Ethical and simple everyday banking, green home loans, savings"},"rdore@communityfirst.com.au":{"simplified_title":"COO","simplified_name":"Community First","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"The bank is currently offering a new low rate credit card, where clients have a chance to earn $100 if approved between 12/7/23 and 12/10/23 and make an eligible transaction in the first 30 days. They also offer a Green Car Loan for brand new hybrid or electric vehicles where the cost of a charging station can be added to the loan.","notable_details":"The bank is operating under the name Community First Bank but is a credit union. They have a unique approach to banking where they refer to themselves as 'Banking's Best Kept Secret'.","focus":"Full Service"},"jboyle@liberty.com.au":{"simplified_title":"CEO","simplified_name":"Liberty Financial","industry":"Finance","spoken_industry":"finance","type_of_bank":"Non-Bank Lender","news":"None mentioned on the provided content","notable_details":"Liberty is a B Corp certified company that has been operating for over 25 years. It has helped over 700,000 customers by advancing more than $30 billion in funds. They also partner with fintechs such as Moula and MoneyPlace to offer more flexibility and innovation to their customers. They operate all around Australia.","focus":"Full service lender, focusing on free-thinking and flexible solutions for home, car, business, and personal loans"},"gsmith@gmcu.com.au":{"simplified_title":"CEO","simplified_name":"GMCU","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Tax time can be a vulnerable time for many Australians. Help keep yourself safe by learning about common types of scams for this time of year. Interested in a career with GMCU? Read more to find out about our current opportunities. From the 31st of March 2023, GMCU will be retiring chequebooks. Read more to find out what these changes mean, and how we can support you in exploring new ways to do your everyday banking.","notable_details":"GMCU is a cooperative bank that has a BSB number which is unique to banks in Australia and New Zealand. They are planning on retiring chequebooks from the 31st of March 2023.","focus":"Full Service"},"jason.oconnell@macquarie.com":{"simplified_title":"CTO","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Commercial Bank","news":"Macquarie announced their deepening commitment to Italy, advancing economic progress through the private sector's role in connecting communities with capital and innovation, and accelerating the future of UK energy. They also showcased their presence and 33 years of growth, innovation and collaboration in Europe, the Middle East, and Africa at their 2022 operational briefing.","notable_details":"Macquarie has a track record of unbroken profitability for 54 years and manages assets worth $A870.8 billion. They have a global presence operating in 34 markets. They are committed to creating a positive social impact and value diversity in their workplace. They have also received reports of their name being fraudulently used to solicit payments from investors.","focus":"Full Service Bank with a focus on investment"},"justin.moffitt@macquarie.com":{"simplified_title":"GCIO","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Global Financial Services Group","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy"],"notable_details":"This bank has a 54 years record of unbroken profitability and $A870.8 billion of assets under management.","focus":"Innovation and Investment for social impact and better future"},"daniel.evans@macquarie.com":{"simplified_title":"Division Director","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Commercial Bank","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy"],"notable_details":"Macquarie Bank has a track record of 54 years of unbroken profitability, with over 20,500 employees globally, and $A870.8 billion assets under management. They are operating in 34 markets globally.","focus":"Full Service"},"renee.walsh@macquarie.com":{"simplified_title":"COO","simplified_name":"Macquarie Group","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Full-Service Bank","news":"Recent news includes their deepening commitment to Italy, advancing economic progress - the private sector's role in connecting communities with capital and innovation, and accelerating the future of UK energy.","notable_details":"Macquarie Bank operates in 34 markets with a track record of unbroken profitability for 54 years. They manage $A870.8 billion assets and have 20,500+ global employees. They also received reports of their name being fraudulently used to solicit payments from investors.","focus":"Global financial services with a focus on empowering people to innovate and invest for a better future."},"paul.cilia@macquarie.com":{"simplified_title":"Executive Director","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Global Financial Services Organisation","news":"Deepening our commitment to Italy, Advancing economic progress – the private sector’s role in connecting communities with capital and innovation, Accelerating the future of UK energy","notable_details":"Macquarie has a track record of 54 years of unbroken profitability and manages over $A870.8 billion assets. They have a significant presence and growth in Europe, the Middle East, and Africa.","focus":"Full Service"},"genevieve.walker@macquarie.com":{"simplified_title":"Director of Product Management","simplified_name":"Macquarie Group","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Full Service Bank","news":"Deepening our commitment to Italy, Advancing economic progress – the private sector’s role in connecting communities with capital and innovation, Accelerating the future of UK energy","notable_details":"Has a record of 54 years of unbroken profitability. They have a strong focus on social impact, innovation and diversity within the workplace.","focus":"Global Financial Services"},"alison.lee@macquarie.com":{"simplified_title":"Transformation Director","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Commercial Bank","news":"Deepening our commitment to Italy, Advancing economic progress – the private sector’s role in connecting communities with capital and innovation, Accelerating the future of UK energy","notable_details":"The bank is a global financial services organisation with Australian heritage, operating in 34 markets. They have a track record of unbroken profitability and manage $A870.8 billion assets.","focus":"Full Service Bank"},"wendy.brown@macquarie.com":{"simplified_title":"Executive Director","simplified_name":"Macquarie Group","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Investment Bank","news":["Deepening commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy"],"notable_details":"Macquarie Group has a track record of unbroken profitability for 54 years, operates in 34 global markets, and has $A870.8 billion assets under management.","focus":"Innovation and Investment"},"eli.glotzer@macquarie.com":{"simplified_title":"Division Director","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Global Financial Services Group","news":"Deepening our commitment to Italy, Advancing economic progress – the private sector’s role in connecting communities with capital and innovation, Accelerating the future of UK energy","notable_details":"They have a track record of unbroken profitability for 54 years with more than 20,500 employees globally and $A870.8 billion assets under management. They have a commitment to positive social impact and empowerment.","focus":"Full Service"},"susan.wright@macquarie.com":{"simplified_title":"Associate Director Credit Operations","simplified_name":"Macquarie","industry":"Finance","spoken_industry":"financial services","type_of_bank":"Global Financial Services Organisation","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy"],"notable_details":["Operating in 34 markets","54 years of unbroken profitability","20,500+ employees globally","$A870.8 billion assets under management"],"focus":"Empowering people to innovate and invest for a better future, offering a diverse range of services"},"mark.royle@macquarie.com":{"simplified_title":"Associate Director Enterprise Architecture","simplified_name":"Macquarie Group","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Global Financial Services Group","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy"],"notable_details":["Operating in 34 markets","54 years of unbroken profitability","20,500+ employees globally","$A870.8 billion assets under management","Reports of Macquarie’s name being used to fraudulently solicit payments from investors"],"focus":"Empowering people to innovate and invest for a better future, offering a track record of unbroken profitability"},"justin.azzi@macquarie.com":{"simplified_title":"Product Director","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Commercial Bank","news":"They are deepening their commitment to Italy, advancing economic progress - the private sector's role in connecting communities with capital and innovation, and accelerating the future of UK energy","notable_details":"They have a track record of unbroken profitability, 54 years of profitability and they manage $A870.8 billion assets. They operate in 34 global markets","focus":"Full Service"},"richard.heeley@macquarie.com":{"simplified_title":"CIO","simplified_name":"Macquarie Group","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Global Financial Services Organization","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy","At our 2022 operational briefing, we showcased our presence and 33 years of growth, innovation and collaboration in Europe, the Middle East and Africa."],"notable_details":"The bank has a track record of unbroken profitability for 54 years, and manages $A870.8 billion assets","focus":"Empowering people to innovate and invest for a better future"},"anthony.poniris@macquarie.com":{"simplified_title":"Associate Director","simplified_name":"Macquarie Group","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Global Financial Services Organisation","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy"],"notable_details":["54 years of unbroken profitability","20,500+ employees globally","$A870.8 Billion assets under management","Operational briefing for 2022 showcased 33 years of growth, innovation, and collaboration in Europe, Middle East and Africa"],"focus":"Full Service"},"peter.carey@macquarie.com":{"simplified_title":"Associate Director","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Global Financial Services Organization","news":"Deepening commitment to Italy, advancing economic progress with the private sector's role in connecting communities with capital and innovation, accelerating the future of UK energy","notable_details":"Macquarie has a track record of unbroken profitability, operates in 34 markets globally and has Australian heritage. They have assets under management of $A870.8 billion and over 20,500 employees globally. They have been operating for over 54 years.","focus":"Full Service"},"kristie.pearce@macquarie.com":{"simplified_title":"Product Director","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Global Financial Services Organisation","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy"],"notable_details":["Operating in 34 markets","54 years of unbroken profitability","$A870.8 billion assets under management","2022 operational briefing showcased presence and 33 years of growth, innovation and collaboration in Europe, the Middle East and Africa"],"focus":"Full Service"},"rajibul.chowdhury@macquarie.com":{"simplified_title":"Product Owner","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Full Service Bank","news":"They recently deepened their commitment to Italy, emphasized on advancing economic progress with the private sector's role in connecting communities with capital and innovation, and they are accelerating the future of UK energy.","notable_details":"Macquarie has a strong global presence, operating in 34 markets and maintaining a track record of unbroken profitability for 54 years. They also have a significant asset base, managing over $A870.8 billion in assets.","focus":"Macquarie focuses on global financial services, with significant emphasis on innovation and social impact. They empower people to innovate and invest, aiming for a better future. They also focus on diversity and inclusivity in the workplace."},"james.renouf@macquarie.com":{"simplified_title":"Associate Director","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Global Financial Services Group","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy","At our 2022 operational briefing, we showcased our presence and 33 years of growth, innovation and collaboration in Europe, the Middle East and Africa."],"notable_details":["We offer our investors a track record of unbroken profitability.","We operate in 34 markets and have 54 years of unbroken profitability.","We have over 20,500 employees globally and $A870.8 billion assets under management."],"focus":"Empowering people to innovate and invest for a better future, connecting communities with capital and innovation"},"joanne.pickhaver@macquarie.com":{"simplified_title":"COO","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Commercial Bank","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy"],"notable_details":"Macquarie has a track record of 54 years of unbroken profitability, with over 20,500 employees globally and $A870.8 billion assets under management.","focus":"Full Service"},"evan.hinchliffe@macquarie.com":{"simplified_title":"Industry Lead","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Global Financial Services Organization","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy","At our 2022 operational briefing, we showcased our presence and 33 years of growth, innovation and collaboration in Europe, the Middle East and Africa."],"notable_details":["Operating in 34 markets worldwide","A track record of unbroken profitability for 54 years","$A870.8 billion assets under management","20,500+ employees globally"],"focus":"Empowering people to innovate and invest for a better future"},"shemin.tejani@macquarie.com":{"simplified_title":"Associate Director","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Full service bank","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy","At our 2022 operational briefing, we showcased our presence and 33 years of growth, innovation and collaboration in Europe, the Middle East and Africa."],"notable_details":"Macquarie Bank has an unbroken profitability track record spanning 54 years, with over 20,500 employees globally and $A870.8 Billion assets under management. They are also committed to creating positive social impact and value uniqueness, diverse views and ideas in their workplace.","focus":"Global financial services"},"richard.mchutchison@macquarie.com":{"simplified_title":"Product Director","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Global Financial Services Organisation","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy","At our 2022 operational briefing, we showcased our presence and 33 years of growth, innovation and collaboration in Europe, the Middle East and Africa"],"notable_details":"Macquarie has a track record of unbroken profitability over 54 years, with over 20,500 employees globally and $A870.8 billion assets under management. They also have a strong commitment to social impact by empowering people to innovate and invest for a better future.","focus":"Full Service"},"clayton@moneyme.com.au":{"simplified_title":"CEO","simplified_name":"MoneyMe","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Digital Bank","news":"They recently won Canstar's Innovation Excellence Award 2022","notable_details":"The bank has a strong focus on sustainability, offsetting carbon emissions equivalent to driving 15,500,000KMs. It also offers a free credit score tool for customers","focus":"Fintech"},"neal@moneyme.com.au":{"simplified_title":"CFO","simplified_name":"MoneyMe","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Digital Bank","news":"Winner of Canstar's Innovation Excellence Award 2022","notable_details":"The bank is 100% digital and focuses on offering quick loan approvals and fund transfers. They also have a strong focus on sustainability, having offset carbon emissions equivalent to driving 15,500,000KMS.","focus":"Lending and Credit Services"},"jess.walpole@macquarie.com":{"simplified_title":"COO","simplified_name":"Macquarie Group","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Commercial Bank","news":"1. Deepening their commitment to Italy 2. Advancing economic progress – the private sector’s role in connecting communities with capital and innovation 3. Accelerating the future of UK energy. In their 2022 operational briefing, they showcased their presence and 33 years of growth, innovation and collaboration in Europe, the Middle East, and Africa.","notable_details":"Macquarie Bank has a track record of unbroken profitability and is operating in 34 markets globally. They have over 20,500 employees and manage $A870.8 billion in assets. They empower their people to identify unmet community needs and use specialist expertise to find long-term solutions.","focus":"Full Service"},"jamie.calder@pnbank.com.au":{"simplified_title":"General Manager","simplified_name":"P&N Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Effective 1 August 2023, a new security layer has been implemented for online banking.","notable_details":"The bank acknowledges the Traditional Custodians of the land where they operate, showing a degree of cultural sensitivity and acknowledgement.","focus":"Full Service"},"derekmcintyre@nicu.com.au":{"simplified_title":"CEO","simplified_name":"Northern Inland","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"2 Factor Authentication now required for Online Banking. Set up before 31 August 2023 to avoid your Online Banking and smartPay App being affected.","notable_details":"Northern Inland Credit Union has been providing services for almost 50 years, mainly in the North West region of New South Wales, with branches in Tamworth, Gunnedah and Narrabri.","focus":"Full Service"},"kathybeavan@nicu.com.au":{"simplified_title":"CFO","simplified_name":"NICU","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"2 Factor Authentication now required for Online Banking. Set up before 31 August 2023 to avoid your Online Banking and smartPay App being affected.","notable_details":"Northern Inland Credit Union has been serving its local communities in the North West region of New South Wales for almost 50 years, offering a full range of financial products. They have branches in Tamworth, Gunnedah and Narrabri.","focus":"Full service"},"angela.newland@pnbank.com.au":{"simplified_title":"General Manager","simplified_name":"P&N Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Effective 1 August 2023, a new security layer has been implemented for their online banking.","notable_details":"P&N Bank acknowledges the Traditional Custodians of the land on which they work and pays respect to Elders past and present. Also, they offer a localized experience based on the user's location.","focus":"Full Service"},"lesley.taleb@orangecu.com.au":{"simplified_title":"Executive to the CEO","simplified_name":"Orange Credit Union","industry":"Banking","spoken_industry":"banking industry","type_of_bank":"Customer-owned regional bank","news":["Orange Credit Union introduces new CEO Lewis von Stieglitz to lead organisation into a thriving future.","Community Grants Support Program 2023 successful projects announced in a year of record applications.","In light of increasing online security threats across all industries, Orange Credit Union have conducted a review of security."],"notable_details":"Orange Credit Union is a regional bank based in Orange with a history of almost 60 years. They operate on a customer-owned model where profits are redirected towards innovative services and community support.","focus":"Full service bank with a focus on personal financial wellness and local community support."},"andrew.frank@racq.com.au":{"simplified_title":"General Manager","simplified_name":"RACQ","industry":"Insurance","spoken_industry":"insurance","type_of_bank":"Credit Union","news":"RACQ is currently issuing refunds to eligible members who have held an RACQ Insurance policy.","notable_details":"RACQ is owned by Queenslanders for Queenslanders. Last year, they paid over 99% of comprehensive car insurance claims.","focus":"Insurance and Banking"},"andrew.hadley@pnbank.com.au":{"simplified_title":"CEO","simplified_name":"P&N Bank","industry":"Banking","spoken_industry":"banking industry","type_of_bank":"Credit Union","news":"Effective 1 August 2023, P&N Bank has implemented a new security layer for their online banking.","notable_details":"P&N Bank has a strong focus on security, as shown by their recent implementation of a new security layer for online banking. The bank also acknowledges the Traditional Custodians of the land on which they work, showing respect and acknowledgement of indigenous culture.","focus":"Full Service Banking"},"brad.steele@racq.com.au":{"simplified_title":"General Manager Sales and Distribution","simplified_name":"RACQ","industry":"Insurance","spoken_industry":"insurance","type_of_bank":"Members Banking Group","news":"RACQ is issuing refunds to eligible members who have held an RACQ Insurance policy.","notable_details":"RACQ is owned by Queenslanders for Queenslanders and last year, they paid over 99% of comprehensive car insurance claims.","focus":"Insurance and banking services"},"craig.newman@pnbank.com.au":{"simplified_title":"General Manager","simplified_name":"P&N Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Effective 1 August 2023, they’ve implemented a new security layer for their online banking. They have also launched a new mobile banking app for better user experience.","notable_details":"The bank is known as P&N Bank and it was originally established for Police & Nurses. It also acknowledges the Traditional Custodians of the land on which they work, a gesture of respect towards indigenous communities.","focus":"Full Service"},"guy.picot@racq.com.au":{"simplified_title":"General Manager","simplified_name":"RACQ","industry":"Insurance","spoken_industry":"insurance","type_of_bank":"Member-Owned Bank","news":"RACQ is issuing refunds to eligible members who have held an RACQ Insurance policy.","notable_details":"Last year, RACQ paid over 99% of comprehensive car insurance claims. The bank is owned by Queenslanders and is focused on making a positive difference for its members and their communities.","focus":"Insurance and Banking Services"},"yvonne.macleod@racq.com.au":{"simplified_title":"General Manager","simplified_name":"RACQ","industry":"Insurance and Banking","spoken_industry":"insurance and banking services","type_of_bank":"Credit Union","news":"RACQ is issuing refunds to eligible members who have held an RACQ Insurance policy.","notable_details":"RACQ is not just a bank, but also provides insurance services. They paid over 99% of comprehensive car insurance claims last year. RACQ also extends its services with member benefits like discounts at Event Cinemas and BCC Cinemas.","focus":"Full Service"},"michael.catley@racq.com.au":{"simplified_title":"General Manager Technology Strategy and Commercial","simplified_name":"RACQ","industry":"Insurance","spoken_industry":"insurance services","type_of_bank":"Credit union","news":"RACQ is issuing refunds to eligible members who have held an RACQ Insurance policy.","notable_details":"RACQ is not just an insurer but also a credit union that is owned by Queenslanders for Queenslanders. They have a high payout rate of over 99% on comprehensive car insurance claims. They also focus on sustainability and social impact, adopting Sustainable Development Goals to help build a better future for their members and communities.","focus":"Providing insurance and banking services with a focus on sustainability and social impact"},"david.harrys@racq.com.au":{"simplified_title":"General Manager","simplified_name":"RACQ","industry":"Insurance","spoken_industry":"insurance services","type_of_bank":"Members Banking Group Limited trading as RACQ Bank","news":"RACQ is issuing refunds to eligible members who have held an RACQ Insurance policy.","notable_details":"RACQ is an insurer that is owned by Queenslanders for Queenslanders. They paid over 99% of comprehensive car insurance claims last year. They have also adopted Sustainable Development Goals to build a better future for their members and communities.","focus":"Insurance and Banking services"},"dan.keating@qbank.com.au":{"simplified_title":"Director","simplified_name":"QBANK","industry":"Banking","spoken_industry":"banking industry","type_of_bank":"Full Service Bank","news":"QBANK was recently awarded three MOZO awards for their Home Loan products, marking another accolade for their award-winning lending products. They have also launched a new Green Car Loan, specifically for members purchasing or refinancing an eligible plug-in hybrid electric vehicle (PHEV) or electric vehicle (EV).","notable_details":"QBANK places a strong emphasis on ethical and compliant employment practices, ensuring the safe, fair, and respectful treatment of their staff. They are also committed to social responsibility, environmental sustainability, and financial wellbeing. An interesting aspect of their banking service is their focus on serving those who serve Queensland, suggesting a regional focus in their operations.","focus":"Lending and Insurance services"},"svassallo@unitybank.com.au":{"simplified_title":"General Manager Business Banking","simplified_name":"Unity Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Information not provided","news":"No recent news provided","notable_details":"The bank has a wide geographical presence with branches spread across multiple states and cities. It also provides a disclosure about potential ATM fees.","focus":"Full service"},"majid.muhammad@resimac.com.au":{"simplified_title":"CIO","simplified_name":"Resimac","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Non-Bank Lender","news":"On 20 June 2023, Resimac changed the interest rates on their variable rate home loans. They are currently reviewing their variable interest rates due to the RBA cash rate decision. Also, their Customer Benefits program will cease to operate as of 1 July 2023.","notable_details":"Resimac has a new online loan management platform called CustomerZone where customers can manage their home loan. They have issued over $45 billion of mortgage-backed securities in domestic and global markets since 1987 and have a portfolio of home loans on balance sheet of over $13 billion.","focus":"Residential Mortgages and Asset Finance"},"scott.mcwilliam@resimac.com.au":{"simplified_title":"CEO","simplified_name":"Resimac","industry":"Finance","spoken_industry":"financial services","type_of_bank":"Non-Bank Lender","news":"The bank is currently reviewing its variable interest rates in light of the RBA cash rate decision. Customers will be notified via post as soon as a decision is reached. The bank also recently introduced CustomerZone, a new online loan management platform where customers can manage their home loan.","notable_details":"Resimac is a leading alternative lender for residential mortgages and asset finance in Australia and New Zealand. They have a broad suite of competitive, award-winning products that cater to diverse customer types and needs. They have a distribution network that covers 85% of mortgage brokers in Australia.","focus":"Residential Mortgages and Asset Finance"},"danielle.corcoran@resimac.com.au":{"simplified_title":"COO","simplified_name":"Resimac","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Non-Bank Lender","news":"Resimac is currently reviewing their variable interest rates in light of the RBA cash rate decision. They recently changed the interest rates on their variable rate home loans on 20 June 2023. The introduction of CustomerZone, a new online loan management platform, has also been announced.","notable_details":"Resimac Group is a leading alternative lender for residential mortgages and asset finance in Australia and New Zealand with over 50,000 customers. They have issued over $45 billion of mortgage-backed securities in domestic and global markets since 1987. They also have a distribution network covering over 85% of mortgage brokers in Australia.","focus":"Residential Mortgages and Asset Finance"},"scumine@summerland.com.au":{"simplified_title":"Deputy CEO","simplified_name":"Summerland","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Credit Union","news":"Summerland is changing its opening hours at its Ballina, Lismore, Grafton, and Casino branches soon. Also, they recently scored the top spot for Excellence in the Sustainability Category at the 2023 Chamber of Commerce Awards.","notable_details":"Summerland Credit Union is a customer-owned financial institution with a strong commitment to sustainability. They offer an 'Eco loan' promoting environmentally friendly housing and are a certified B Corp business, indicating they meet high standards of social and environmental performance.","focus":"Full service, with a focus on ethical treatment, high service levels, and sustainability"},"chris.paterson@resimac.com.au":{"simplified_title":"General Manager Distribution","simplified_name":"Resimac","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Non-bank Lender","news":"Resimac is currently experiencing technical issues with their phone system and advising customers to email for urgent enquiries. They are also reviewing their variable interest rates following the RBA cash rate decision. An update on this will be sent to customers via post. As of 20th June 2023, Resimac has changed the interest rates on their variable rate home loans. They have also introduced CustomerZone, a new online loan management platform with multiple features and benefits.","notable_details":"Resimac Group is a leading alternative lender for residential mortgages and asset finance in Australia and New Zealand. They have issued over $45 billion of mortgage-backed securities in domestic and global markets since 1987 and have a portfolio of home loans on balance sheet of over $13 billion. They also have a distribution network of over 85% of mortgage brokers in Australia.","focus":"Residential Mortgages and Asset Finance"},"kkaragiannis@unitybank.com.au":{"simplified_title":"CFO","simplified_name":"Unity Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Not provided","news":"Not provided","notable_details":"This bank has numerous branches and ATMs across various locations. Also, some ATM owners may charge a fee for using their ATM, which will be disclosed upfront, providing customers with the option of cancelling the transaction without incurring the fee.","focus":"Full service"},"dpavisic@unitybank.com.au":{"simplified_title":"CEO","simplified_name":"Unity Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Not specified","news":"No recent news posted.","notable_details":"The bank has several branches across different locations, with varying operating hours. Some ATM owners may charge a fee for using their ATM, and this fee will be disclosed upfront, providing customers with the option of cancelling the transaction without incurring the fee.","focus":"Not specified"}}