{"armina.avanes@vxa.se":{"simplified_title":"cio","simplified_name":"Växa Sverige","value_proposition":"Växa helps farmers achieve profitability and sustainability in their agriculture business.","industry":"Agriculture","target_audience":"Farmers","market":"B2B","comment_on_content_piece":"Förresten, jag såg att Växa hjälper lantbrukare att övervaka brunst och hälsa på ett effektivt sätt. Det låter jättebra!","spoken_industry":"jordbruk","news":"Höga priser och brist på insatsvaror pressar lantbruket.","notable_details":"Växa focuses on promoting sustainable agriculture for animals, people, environment, and economy.","summary":"Växa helps farmers achieve profitability and sustainability in their agriculture business by providing smart activity meters for effective monitoring of heat and health in animals.","reasons":"- Vi förstår att lantbruket kan vara en utmanande bransch, men med Växas smarta aktivitetsmätare kan ni övervaka brunst och hälsa på ett effektivt sätt, vilket kan bidra till ökad produktivitet och lönsamhet.\n- Växa fokuserar på hållbarhet för djur, människor, miljö och ekonomi, vilket kan hjälpa er att skapa en mer hållbar och ansvarsfull verksamhet.\n- Vi vet att det kan vara svårt att klara sig i en bransch med höga priser och brist på insatsvaror, men med Växas lösningar och rådgivning kan ni få stöd och råd i den akuta politiska situationen i Europa och hantera utmaningarna bättre."},"emelie.johansson@calliditas.com":{"simplified_title":"finanschef","simplified_name":"Calliditas","value_proposition":"Calliditas Therapeutics helps improve people's lives with innovative treatments for rare diseases.","industry":"Health Tech & Bioinformatics","target_audience":"patients","market":"B2C","comment_on_content_piece":"Förresten, jag såg att Calliditas Therapeutics utvecklar banbrytande behandlingar för sällsynta sjukdomar. Det låter fantastiskt!","spoken_industry":"hälsoteknik och bioinformatik","news":"Calliditas Therapeutics utvecklar banbrytande behandlingar för sällsynta sjukdomar.","notable_details":"Calliditas Therapeutics fokuserar på att utveckla mediciner för njur- och leversjukdomar.","summary":"Calliditas Therapeutics är ett företag inom hälsoteknik och bioinformatik som utvecklar banbrytande behandlingar för sällsynta sjukdomar, med fokus på njur- och leversjukdomar. De strävar efter att förbättra människors liv genom att erbjuda alternativa behandlingsalternativ för patienter som inte har många godkända behandlingar tillgängliga.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Genom att använda fakturakredit kan ni snabbt få tillgång till pengar för att finansiera era forsknings- och utvecklingsprojekt.\n- Ni kan öka er finansiella stabilitet genom att omvandla era fakturor till omedelbara betalningar och minska risken för obetalda fakturor.\n- Med Invoiers AI-matchingalgoritm kan ni få de bästa villkoren och undvika att betala för mycket för riskhantering."},"emelie.backvall@calliditas.com":{"simplified_title":"associerad","simplified_name":"Calliditas","value_proposition":"Calliditas Therapeutics helps improve people's lives through innovative treatments for rare diseases.","industry":"Health Tech & Bioinformatics","target_audience":"patients","market":"B2B","comment_on_content_piece":"Förresten, jag såg att Calliditas Therapeutics utvecklar banbrytande behandlingar för sällsynta sjukdomar. Det låter riktigt spännande och värdefullt för patienter.","spoken_industry":"hälsoteknik och bioinformatik","news":"Calliditas Therapeutics utvecklar banbrytande behandlingar för sällsynta sjukdomar.","notable_details":"Företaget fokuserar främst på njur- och leversjukdomar.","summary":"Calliditas Therapeutics är ett företag inom hälsoteknik och bioinformatik som utvecklar innovativa behandlingar för sällsynta sjukdomar, med fokus på njur- och leversjukdomar. De strävar efter att förbättra människors liv genom vetenskaplig och kommersiell expertis. Calliditas välkomnar strategiska partners för att utöka behandlingsalternativen för patienter med sjukdomar som saknar godkända behandlingar.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Invoiers låga avgifter och villkor hjälper er att öka er finansiella stabilitet och tillväxt\n- AI-algoritmen på Invoier säkerställer att ni får de bästa villkoren och inte betalar för mycket för risk\n- Invoier har nyligen finansierat 500 miljoner SEK i fakturor, vilket visar deras pålitlighet och framgång."},"fredrik.johansson@calliditas.com":{"simplified_title":"ekonomichef","simplified_name":"Calliditas","value_proposition":"Calliditas Therapeutics helps improve people's lives by developing innovative treatments for rare diseases, with a focus on kidney and liver diseases.","industry":"Health Tech & Bioinformatics","target_audience":"C-levels","market":"B2B","comment_on_content_piece":"Förresten, jag såg att Calliditas Therapeutics utvecklar banbrytande behandlingar för sällsynta sjukdomar. Fantastiskt jobb!","spoken_industry":"hälsoteknik och bioinformatik","news":"Calliditas Therapeutics utvecklar banbrytande behandlingar för sällsynta sjukdomar.","notable_details":"They focus on treating rare diseases and are seeking strategic partners for development and commercialization.","summary":"Calliditas Therapeutics är ett företag som arbetar med att förbättra människors liv genom att utveckla innovativa behandlingar för sällsynta sjukdomar, med fokus på njur- och leversjukdomar. De söker även strategiska partners för utveckling och kommersialisering.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Punkt 1\n- Punkt 2\n- Punkt 3"},"hanna.bergenwald@airahome.com":{"simplified_title":"produktchef","simplified_name":"Aira","value_proposition":"Aira helps homeowners lower their energy bills and carbon emissions with innovative air source heat pumps, providing hassle-free switching and a comfort guarantee.","industry":"Clean Energy-Tech","target_audience":"homeowners","market":"B2C","comment_on_content_piece":"Förresten, jag såg att Aira erbjuder innovativa luftvärmepumpar som sänker energikostnader och minskar koldioxidutsläpp. En cool och miljövänlig lösning!","spoken_industry":"clean energy-tech","news":"Aira is set to become Europe's number one direct-to-consumer brand within clean energy-tech.","notable_details":"Aira is currently piloting in Italy and will be launching in the UK and Germany later in 2023.","summary":"Aira is a clean energy-tech company that offers innovative air source heat pumps to homeowners, helping them reduce energy bills and carbon emissions. With a mission to empower people to join the clean energy revolution, Aira aims to transform how homes are heated and promote a net-zero future. They are headquartered in Stockholm, Sweden, and have a factory in Poland.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n\n- Med Invoiers fakturakredit kan ni förbättra er likviditet och få tillgång till kapital snabbt genom att sälja era fakturor. Det kan hjälpa er att finansiera er expansion och investeringar på ett effektivt sätt.\n- Invoier använder en AI-matchingalgoritm för att snabbt matcha er med de bästa villkoren och försäkra att ni inte överbetalar för risk. Det betyder att ni får de bästa möjliga förutsättningarna och kan undvika onödiga kostnader.\n- Invoier har redan finansierat 500 miljoner SEK i fakturor och har några av de bästa avgifterna och villkoren på marknaden. Genom att använda Invoiers fakturakredit kan ni öka er tillväxt och skapa en stabilare ekonomisk grund för ert företag."},"johan.eltes@carasent.com":{"simplified_title":"teknikchef","simplified_name":"Carasent","value_proposition":"Carasent helps health and care organisations reduce administrative burdens and improve patient engagement through a seamless ecosystem of integrated IT solutions.","industry":"Health Tech & Bioinformatics","target_audience":"health and care organisations","market":"B2B","comment_on_content_piece":"Förresten, jag såg att Carasent erbjuder en bred portfölj av produkter och tjänster inom hälso- och sjukvårdssektorn. Det låter som en fantastisk lösning för att minska administration och förbättra patientengagemang.","spoken_industry":"hälso- och sjukvårdsteknik","news":"Change of focus and cost savings initiated CFO Svein Martin Bjørnstad acquires shares Carasent ASA: Board member buys shares Carasent takes over customer agreements from Confrere","notable_details":"Carasent offers a wide range of products and services, from electronic health record systems to tools for electronic patient communication and virtual visits.","summary":"Carasent is a health tech company that provides health and care organisations with integrated IT solutions to reduce administrative burdens and improve patient engagement. They offer a wide range of products and services, including electronic health record systems and tools for electronic patient communication.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Ni kan använda fakturakredit för att öka er likviditet och snabbt få tillgång till pengar som är bundna i era fakturor.\n- Invoiers AI-matchingalgoritm säkerställer att ni får de bästa villkoren och inte betalar för mycket för risk.\n- Med Invoiers låga avgifter och bra villkor kan ni öka er ekonomiska stabilitet och frigöra kapital för tillväxt och expansion."},"jeanette.roos@calliditas.com":{"simplified_title":"kvalitetssäkringsdirektör","simplified_name":"Calliditas","value_proposition":"Calliditas Therapeutics helps patients with rare diseases improve their lives through innovative treatments.","industry":"Health Tech & Bioinformatics","target_audience":"patients","market":"B2C","comment_on_content_piece":"Förresten, jag såg att Calliditas Therapeutics utvecklar banbrytande behandlingar för sällsynta sjukdomar. Det låter fantastiskt!","spoken_industry":"hälso- och sjukvårdsteknik","news":"Calliditas Therapeutics utvecklar banbrytande behandlingar för sällsynta sjukdomar.","notable_details":"Fokuserar på njur- och leversjukdomar.","summary":"Calliditas Therapeutics är ett företag inom hälso- och sjukvårdsteknik som utvecklar innovativa behandlingar för patienter med sällsynta sjukdomar, med fokus på njur- och leversjukdomar. De strävar efter att förbättra livet för människor som lider av dessa sjukdomar genom banbrytande mediciner. Företaget söker även strategiska partners för att utveckla och kommersialisera sina behandlingar.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Ni kan använda fakturakrediten för att öka er tillväxt genom att få snabb tillgång till kapital från era obetalda fakturor.\n- Med Invoiers AI-matchingalgoritm får ni de bästa villkoren och undviker att betala för mycket för risk.\n- Invoier har nått milstolpen att finansiera 500 miljoner SEK i fakturor, vilket visar på deras pålitlighet och erfarenhet."},"jonas.wetter@gih.se":{"simplified_title":"studierektor","simplified_name":"The Swedish School of Sport and Health Sciences","value_proposition":"Gymnastik- och idrottshögskolan helps students pursue their passion for sports and physical activity, while conducting research in the field.","industry":"Education","target_audience":"students","market":"B2C","comment_on_content_piece":"Förresten, jag såg att Gymnastik- och idrottshögskolan bedriver internationellt respekterad forskning inom idrott, fysisk aktivitet och hälsa. Det låter jättespännande!","spoken_industry":"utbildning","news":"På GIH bedrivs nationellt och internationellt respekterad forskning inom idrott, fysisk aktivitet och hälsa.","notable_details":"GIH är en renodlad idrottshögskola där man delar sitt intresse med andra studenter och lärare.","summary":"Gymnastik- och idrottshögskolan är Sveriges främsta kunskapscentrum för idrott, fysisk aktivitet och hälsa. De erbjuder utbildningar inom området och bedriver även forskning. Målet är att sprida kunskap och göra nytta i samhället.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Ni kan snabbt få ut betalningen för era fakturor och förbättra er likviditet\n- Invoiers AI-algoritm säkerställer att ni får de bästa villkoren och inte betalar för mycket för risk\n- Med Invoiers hjälp kan ni öka er tillväxt och finansiella stabilitet genom att frigöra kapital från era fakturor."},"josefin.fridstrand@matsmart.se":{"simplified_title":"direktör","simplified_name":"Matsmart","value_proposition":"Matsmart helps consumers save food and reduce food waste.","industry":"Food & Beverage","target_audience":"consumers","market":"B2C","comment_on_content_piece":"Förresten, jag såg att Matsmart arbetar för att minska matsvinn. Det låter jättebra!","spoken_industry":"mat och dryck","news":"Matsmart recently expanded to new markets.","notable_details":"Matsmart focuses on offering discounted food products that would otherwise go to waste.","summary":"Matsmart är en onlinebutik som hjälper konsumenter att spara mat och minska matsvinn genom att erbjuda rabatterade produkter.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Ni kan använda kapitalet för att investera i utökad marknadsföring och nå fler kunder.\n- Ni kan förbättra er likviditet genom att snabbt få betalt för era fakturor och därmed säkerställa en stabil kassaflöde.\n- Invoiers AI-algoritm säkerställer att ni får de bästa villkoren när ni säljer fakturor, vilket kan hjälpa er att öka er vinst och minska era kostnader."},"karl@matsmart.se":{"simplified_title":"medgrundare","simplified_name":"Matsmart","value_proposition":"Matsmart helps consumers save food and reduce food waste.","industry":"E-commerce","target_audience":"Consumers","market":"B2C","comment_on_content_piece":"Förresten, jag såg att Matsmart hjälper konsumenter att minska matsvinn. Det låter bra!","spoken_industry":"e-handel","news":"They are expanding to new markets.","notable_details":"They focus on selling surplus food at discounted prices.","summary":"Matsmart is an e-commerce company that helps consumers save food and reduce food waste by selling surplus food at discounted prices.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Ni kan använda fakturakrediten för att finansiera inköp av överskottsmat och expandera ert sortiment.\n- Genom att sälja fakturor kan ni snabbt få tillgång till kapital och förbättra er likviditet.\n- Med Invoiers AI-algoritm får ni de bästa villkoren för fakturakrediten och minimerar risken för överbetalning."},"kajsa.conradi@evimeria.se":{"simplified_title":"personalchef","simplified_name":"Carasent","value_proposition":"Carasent helps health and care organizations reduce administrative burdens and improve patient engagement through a seamless ecosystem of integrated IT solutions.","industry":"Health Tech & Bioinformatics","target_audience":"C-levels","market":"B2B","comment_on_content_piece":"Förresten, jag såg att Carasent erbjuder en bred portfölj av produkter och tjänster som verkligen kan underlätta för vårdorganisationer. Det låter som en smart och effektiv lösning.","spoken_industry":"hälsovårdsteknik","news":"Change of focus and cost savings initiated CFO Svein Martin Bjørnstad acquires shares Carasent ASA: Board member buys shares Carasent takes over customer agreements from Confrere","notable_details":"Carasent offers a wide range of IT solutions for health and care organizations, including electronic health record systems, communication tools, and business intelligence solutions.","summary":"Carasent is a Health Tech & Bioinformatics company that provides health and care organizations with integrated IT solutions to reduce administrative burdens and improve patient engagement. They offer a wide range of products and services, including electronic health record systems, communication tools, and business intelligence solutions. Their goal is to create a seamless ecosystem that supports efficient and effective healthcare delivery.","reasons":"- Med Invoiers fakturakredit kan ni snabbt få tillgång till kapital från era fakturor, vilket kan hjälpa er att öka er tillväxt och förbättra er ekonomiska stabilitet.\n- Vår AI-algoritm säkerställer att ni får de bästa villkoren och inte överbetalar för risk, vilket ger er en kostnadseffektiv lösning för att hantera er fakturering.\n- Invoier har en imponerande milstolpe på att finansiera 500 miljoner SEK i fakturor, vilket visar på deras framgång och förmåga att hjälpa företag att få tillgång till kapital."},"klara@ridecake.com":{"simplified_title":"expansion","simplified_name":"Cake","value_proposition":"CAKE helps commuters, off-road enthusiasts, and businesses find lightweight, quiet, and eco-friendly bikes for their needs.","industry":"Health Tech & Bioinformatics","target_audience":"consumers","market":"B2C","comment_on_content_piece":"Förresten, jag såg att CAKE erbjuder räntefri finansiering från 12 till 36 månader. Mycket bra erbjudande!","spoken_industry":"hälsoteknik och bioinformatik","news":"CAKE är utvald som ett genombrott för varumärket 2023 av Interbrand Index!","notable_details":"CAKE strävar efter att skapa fossilfria fordon till 2025.","summary":"CAKE erbjuder lättviktiga, tysta och miljövänliga cyklar för pendlare, terrängälskare och företag. De har räntefri finansiering och fokuserar på hållbarhet.","reasons":"- Med CAKEs lätta och tysta cyklar kan ni pendla smidigt och bekvämt samtidigt som ni bidrar till en renare miljö.\n- Genom att investera i en miljövänlig cykel från CAKE visar ni ert företags engagemang för hållbarhet och miljöansvar.\n- CAKEs erbjudande om räntefri finansiering gör det enkelt och förmånligt att investera i en högkvalitativ cykel för er verksamhet."},"marcus.ramberg@matsmart.se":{"simplified_title":"direktör","simplified_name":"Matsmart","value_proposition":"Matsmart helps consumers save food and reduce food waste.","industry":"Food & Beverage","target_audience":"consumers","market":"B2C","comment_on_content_piece":"Förresten, jag såg att Matsmart hjälper konsumenter att minska matsvinn. Bra initiativ!","spoken_industry":"livsmedel","news":"Matsmart recently expanded to new markets.","notable_details":"Matsmart focuses on selling surplus food at discounted prices to reduce food waste.","summary":"Matsmart is a B2C company that helps consumers save food and reduce food waste by selling surplus food at discounted prices.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Minska ekonomiska svårigheter genom att snabbt få betalt för era fakturor\n- Öka er tillväxt genom att frigöra kapital för investeringar och expansion\n- Förbättra er likviditet och säkra er ekonomiska stabilitet genom att undvika försenade betalningar"},"krister.thour@ridecake.com":{"simplified_title":"teknikchef","simplified_name":"Cake","value_proposition":"CAKE helps commuters, off-road enthusiasts, and businesses find lightweight and quiet electric bikes with flexible financing options.","industry":"Health Tech & Bioinformatics","target_audience":"consumers","market":"B2C","comment_on_content_piece":"Förresten, jag såg att CAKE erbjuder räntefri finansiering från 12 till 36 månader. Låter som ett bra erbjudande!","spoken_industry":"hälsoteknik och bioinformatik","news":"CAKE har valts som ett genombrottsvarumärke 2023 av Interbrand Index!","notable_details":"CAKE har initiativ för att stödja viltvård och hållbarhet samt deltar i elektriska racingserier och utbildningsprojekt.","summary":"CAKE är en tillverkare av elektriska cyklar som erbjuder lättviktiga och tysta alternativ för pendlare, off-road-entusiaster och företag. Företaget har även initiativ för att främja hållbarhet och är erkänd som ett genombrottsvarumärke.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Med Invoier kan ni få snabb finansiering för att växa er verksamhet och investera i nya cyklar och utrustning.\n- Vår AI-algoritm säkerställer att ni får de bästa villkoren och inte överbetalar på risk.\n- Genom att fakturera era kunder kan ni förbättra er likviditet och få tillgång till kapital för att expandera och utveckla er verksamhet."},"martin.hill@matsmart.se":{"simplified_title":"produktchef","simplified_name":"Matsmart","value_proposition":"Matsmart helps consumers save food and reduce food waste.","industry":"Food & Grocery","target_audience":"consumers","market":"B2C","comment_on_content_piece":"Förresten, jag såg att Matsmart hjälper konsumenter att minska matsvinn. Det låter som en fantastiskt bra approach!","spoken_industry":"livsmedel och dagligvaror","news":"Matsmart is expanding to new markets.","notable_details":"They focus on reducing food waste.","summary":"Matsmart is an online platform that helps consumers save food and reduce food waste. They are expanding to new markets and are committed to fighting the global issue of food waste.","reasons":"- Genom att använda Invoiers fakturakredit kan du öka din likviditet och säkerställa en stabil ekonomi för ditt företag.\n- Vi erbjuder några av de bästa avgifterna och villkoren på marknaden, vilket hjälper dig att spara pengar och få bättre villkor på dina fakturor.\n- Vår AI-algoritm matchar dig snabbt med de bästa villkoren och minskar risken för överbetalning."},"malin.waage@calliditas.com":{"simplified_title":"regulator","simplified_name":"Calliditas","value_proposition":"Calliditas Therapeutics hjälper patienter med sällsynta sjukdomar att förbättra sina liv och erbjuda banbrytande behandlingar.","industry":"Health Tech & Bioinformatics","target_audience":"patients","market":"B2C","comment_on_content_piece":"Förresten, jag såg att Calliditas Therapeutics utvecklar banbrytande behandlingar för sällsynta sjukdomar. Det låter verkligen som ett fantastiskt tillvägagångssätt!","spoken_industry":"hälsoteknik och bioinformatik","news":"Det senaste i Calliditas utveckling","notable_details":"Calliditas Therapeutics fokuserar på att behandla sällsynta sjukdomar inom njur- och leversjukdomar.","summary":"Calliditas Therapeutics är ett företag inom hälsoteknik och bioinformatik som utvecklar banbrytande behandlingar för patienter med sällsynta sjukdomar, med fokus på njur- och leversjukdomar. De strävar efter att förbättra patienternas livskvalitet genom att erbjuda nya behandlingsalternativ. ","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Invoier kan hjälpa er att öka er finansiella stabilitet genom att omedelbart ge er tillgång till medel från fakturor som ännu inte har betalats.\n- Genom att använda Invoier kan ni snabbt och enkelt förbättra er likviditet och hantera era kassaflödesbehov.\n- Invoiers AI-matchingalgoritm säkerställer att ni får de bästa villkoren och inte betalar för mycket för risk."},"michael.hakenas@linkmedical.eu":{"simplified_title":"direktör","simplified_name":"LINK Medical Research","value_proposition":"LINK Medical helps pharmaceutical and medical device industries achieve superior clinical outcomes through strategic partnerships and evidence-based documentation.","industry":"Health Tech & Bioinformatics","target_audience":"C-levels","market":"B2B","comment_on_content_piece":"Förresten, jag såg att LINK Medical är en fullservice CRO som erbjuder högkvalitativa tjänster baserade på erfarenhet och modern teknik. Låter som ett fantastiskt partnerskap!","spoken_industry":"hälsoteknik och bioinformatik","news":"Published: July 5, 2023","notable_details":"LINK Medical provides product development services for the pharmaceutical and medical device industries across Northern Europe.","summary":"LINK Medical is a Nordic CRO that offers full-service product development services for the pharmaceutical and medical device industries. They provide strategic partnerships, evidence-based documentation, and a focus on superior clinical outcomes. With a strong presence in the Nordics, UK, and Germany, they aim to simplify and optimize the journey to market for their clients.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Vi förstår att som ett företag inom hälsoteknik och bioinformatik är det viktigt att ha tillgång till pålitlig finansiering för att stödja er produktutveckling och kliniska prövningar.\n- Invoiers AI-algoritm säkerställer att ni får de bästa villkoren och inte betalar för mycket för risk.\n- Genom att använda fakturakredit från Invoier kan ni öka er tillväxt och finansiella stabilitet genom att snabbt få tillgång till kapital från era fakturor."},"monica.lidberg@calliditas.com":{"simplified_title":"supply chain","simplified_name":"Calliditas","value_proposition":"Calliditas Therapeutics helps improve people's lives by developing innovative treatments for rare diseases.","industry":"Health Tech & Bioinformatics","target_audience":"patients","market":"B2C","comment_on_content_piece":"Förresten, jag såg att Calliditas Therapeutics utvecklar banbrytande behandlingar för sällsynta sjukdomar. Det låter som en fantastisk approach!","spoken_industry":"hälsovårdsteknik","news":"Calliditas Therapeutics utvecklar banbrytande behandlingar för sällsynta sjukdomar.","notable_details":"They focus on developing treatments for rare diseases, particularly kidney and liver diseases.","summary":"Calliditas Therapeutics is a health tech company that develops innovative treatments for rare diseases, with a focus on kidney and liver diseases.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Med Invoiers AI-matchingalgoritm kan ni snabbt få utbetalningen för era fakturor och förbättra er likviditet.\n- Invoiers låga avgifter och villkor gör att ni kan öka er ekonomiska stabilitet och tillväxt.\n- Genom att använda Invoiers fakturakredit minimerar ni risken för överbetalning och får de bästa möjliga villkoren för era fakturor."},"peter.beckius@matsmart.se":{"simplified_title":"vd","simplified_name":"matsmart","value_proposition":"Motatos helps consumers save food and reduce food waste.","industry":"Food & Grocery","target_audience":"consumers","market":"B2C","comment_on_content_piece":"Förresten, jag såg att Motatos.com hjälper konsumenter att minska matsvinn. Bra initiativ!","spoken_industry":"livsmedel och dagligvaror","news":"Motatos recently expanded to new markets","notable_details":"Motatos focuses on saving food to reduce food waste","summary":"Motatos is a B2C company that helps consumers save food and reduce food waste. They recently expanded to new markets and are committed to making a positive impact on the environment.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Ni kan använda Invoiers fakturakredit för att öka er ekonomiska stabilitet och tillväxt.\n- Invoiers AI-algoritm säkerställer att ni får de bästa villkoren och inte överbetalar för risk.\n- Invoier har nått en milstolpe och finansierat 500 miljoner SEK i fakturor, vilket visar deras pålitlighet och framgång."},"olga.mcleod@diaceutics.com":{"simplified_title":"partner","simplified_name":"Diaceutics","value_proposition":"Diaceutics helps healthcare providers improve patient testing and personalized medicine implementation.","industry":"Health Tech & Bioinformatics","target_audience":"C-levels","market":"B2B","comment_on_content_piece":"Förresten, jag såg att Diaceutics PLC har publicerat en rapport om precision medicine readiness. Det låter som ett spännande område att vara involverad i!","spoken_industry":"hälso- och bioinformatik","news":"Diaceutics lanserar DXRX, världens första kommersiella plattform för precision medicine","notable_details":"Diaceutics ger tillgång till globala nätverk av laboratorier och realtidsdiagnostikdata.","summary":"Diaceutics är ett företag som hjälper sjukvårdspersonal att förbättra patienttestning och implementering av personlig medicin. Genom deras teknik, produkter och professionella tjänster möjliggör de bättre behandlingsbeslut och precision inom medicin. De lanserade nyligen DXRX, världens första kommersiella plattform för precision medicine, och ger tillgång till globala nätverk av laboratorier och realtidsdiagnostikdata.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n\n- Punkt 1\n- Punkt 2\n- Punkt 3"},"peter.einarsson@calliditas.com":{"simplified_title":"gruppredovisning","simplified_name":"Calliditas","value_proposition":"Calliditas Therapeutics helps improve people's lives by developing innovative treatments for rare diseases, focusing on kidney and liver diseases.","industry":"Health Tech & Bioinformatics","target_audience":"patients","market":"B2C","comment_on_content_piece":"Förresten, jag såg att Calliditas Therapeutics utvecklar banbrytande behandlingar för sällsynta sjukdomar. Det låter som en fantastiskt viktig och givande forskning.","spoken_industry":"hälso- och sjukvårdsteknik","news":"Calliditas Therapeutics utvecklar banbrytande behandlingar för sällsynta sjukdomar.","notable_details":"De fokuserar på utveckling av mediciner för njur- och leversjukdomar.","summary":"Calliditas Therapeutics är ett företag inom hälso- och sjukvårdsteknik som utvecklar innovativa behandlingar för sällsynta sjukdomar, med fokus på njur- och leversjukdomar. Deras mål är att förbättra människors liv genom att erbjuda alternativa behandlingsalternativ för patienter som inte har många godkända behandlingar tillgängliga.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n - Punkt 1\n - Punkt 2\n - Punkt 3"},"rikard.reneland@linkmedical.eu":{"simplified_title":"medicinsk","simplified_name":"LINK Medical","value_proposition":"LINK Medical helps pharmaceutical and medical device industries achieve superior clinical outcomes through strategic partnerships and evidence-based documentation.","industry":"Health Tech & Bioinformatics","target_audience":"C-levels","market":"B2B","comment_on_content_piece":"Förresten, jag såg att LINK Medical är en fullservice CRO som erbjuder strategiska partnerskap och evidence-based dokumentation. Det låter som en fantastisk resurs för företag inom läkemedels- och medicintekniska industrier. Bra jobbat!","spoken_industry":"hälso- och bioteknik","news":"Published: July 5, 2023","notable_details":"LINK Medical provides product development services for the pharmaceutical and medical device industries across Northern Europe.","summary":"LINK Medical is a full-service Nordic CRO that offers strategic partnerships and evidence-based documentation to drive superior clinical outcomes for pharmaceutical and medical device industries.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Genom att fakturera era kundfordringar kan ni snabbt få tillgång till likvida medel och påskynda er tillväxt.\n- Invoiers AI-algoritm säkerställer att ni får de bästa villkoren och inte överbetalar för risk.\n- Med Invoiers marknadsplats får ni tillgång till några av de bästa avgifterna och villkoren på marknaden."},"sharareh.elfversson@linkmedical.eu":{"simplified_title":"direktör","simplified_name":"Link Medical Research","value_proposition":"LINK Medical helps pharmaceutical and medical device industries achieve superior clinical outcomes through strategic partnerships and evidence-based documentation.","industry":"Health Tech & Bioinformatics","target_audience":"C-levels","market":"B2B","comment_on_content_piece":"Förresten, jag såg att LINK Medical är en nordisk CRO som erbjuder kvalitetstjänster baserade på respekt och lösningar. Bra tillvägagångssätt!","spoken_industry":"hälsoteknik och bioinformatik","news":"Published: July 5, 2023","notable_details":"LINK Medical is a full-service Nordic CRO with a strong focus on solutions and transformative methods.","summary":"LINK Medical is a full-service Nordic CRO that provides product development services for the pharmaceutical and medical device industries. They offer strategic partnerships, evidence-based documentation, and a unique leveraging of in-house expertise to drive superior clinical outcomes. With a local presence in the Nordics, UK, and Germany, they aim to make the journey to market simple and cost-effective.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Invoier erbjuder några av de bästa avgifterna och villkoren på marknaden, vilket kan hjälpa er att öka er ekonomiska stabilitet.\n- Med hjälp av deras AI-matchningsalgoritm kan ni snabbt få utbetalningen för era fakturor, vilket kan bidra till att öka er tillväxt.\n- Invoiers AI-algoritm säkerställer också att ni får de bästa möjliga villkoren och inte betalar för mycket för risk."},"peter.hauptig@calliditas.com":{"simplified_title":"projektdirektör","simplified_name":"Calliditas Therapeutics","value_proposition":"Calliditas Therapeutics helps improve people's lives by developing innovative treatments for rare diseases, initially focusing on kidney and liver diseases.","industry":"Health Tech & Bioinformatics","target_audience":"consumers","market":"B2B","comment_on_content_piece":"Förresten, jag såg att Calliditas Therapeutics utvecklar banbrytande behandlingar för sällsynta sjukdomar. Det låter fantastiskt!","spoken_industry":"hälso- och bioteknik","news":"Calliditas Therapeutics utvecklar banbrytande behandlingar för sällsynta sjukdomar.","notable_details":"Calliditas Therapeutics focuses on developing treatments for rare diseases, with an initial focus on kidney and liver diseases.","summary":"Calliditas Therapeutics är ett företag som utvecklar innovativa behandlingar för sällsynta sjukdomar, med fokus på njur- och leversjukdomar. De strävar efter att förbättra människors liv genom vetenskaplig och kommersiell expertis. De söker också strategiska partners för att utveckla och kommersialisera sina produkter.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Med Invoiers faktoringsmarknad kan ni snabbt få tillgång till pengar från era fakturor, vilket kan öka er likviditet och ge er möjlighet att investera i tillväxt.\n- Invoiers AI-matchningsalgoritm säkerställer att ni får de bästa villkoren och inte överbetalar för risker. Detta kan hjälpa er att optimera era finansieringskostnader och öka er ekonomiska stabilitet.\n- Genom att använda Invoiers faktoringsplattform kan ni enkelt sälja era fakturor och få betalt snabbt, vilket minskar er administration och ger er mer tid att fokusera på er kärnverksamhet."},"steinar.danielsen@ridecake.com":{"simplified_title":"direktör","simplified_name":"CAKE","value_proposition":"CAKE helps commuters and businesses find lightweight, electric bikes for a convenient and sustainable mode of transportation.","industry":"Health Tech & Bioinformatics","target_audience":"consumers","market":"B2C","comment_on_content_piece":"Förresten, jag såg att CAKE erbjuder räntefri finansiering från 12 till 36 månader. Det låter som ett bra erbjudande!","spoken_industry":"hälsoteknik och bioinformatik","news":"CAKE är utvalt som ett genombrottsvarumärke 2023 av Interbrand Index!","notable_details":"CAKE är känt för att erbjuda elektriska, lätta och hållbara motorcyklar för både pendlare och företag.","summary":"CAKE är ett företag inom hälsoteknik och bioinformatik som erbjuder elektriska motorcyklar för pendlare och företag. De fokuserar på lätta och hållbara alternativ för transport och har nyligen fått erkännande som ett genombrottsvarumärke.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Med Invoier kan ni snabbt få tillgång till medel från era fakturor och förbättra er likviditet, vilket kan hjälpa er att växa och expandera ert företag.\n- Invoier använder en AI-algoritm för att säkerställa att ni får de bästa villkoren och inte överbetalar för risk. Detta kan hjälpa er att hantera era finansiella risker mer effektivt.\n- Genom att använda Invoiers faktoringsplattform kan ni spara tid och resurser genom att automatisera faktureringsprocessen och få snabbare betalningar från era kunder. Detta kan ge er ökad stabilitet och effektivitet i er verksamhet."},"albin.wahlstrand@neoss.com":{"simplified_title":"vd","simplified_name":"neoss","value_proposition":"Neoss helps dental professionals provide reliable and cost-effective treatments with intelligent solutions and predictable long-term results.","industry":"Health Tech & Bioinformatics","target_audience":"dental professionals","market":"B2B","comment_on_content_piece":"Förresten, jag såg att Neoss erbjuder intelligenta lösningar för tandläkare som ger pålitliga och kostnadseffektiva behandlingar. Låter smart och användarvänligt!","spoken_industry":"hälso- och bioteknik","news":"Neoss offers intelligent solutions for dental professionals to provide reliable and cost-effective treatments.","notable_details":"Neoss has been in the industry for over 20 years and is known for its ease of use and excellent clinician results.","summary":"Neoss erbjuder intelligenta lösningar för tandläkare för att ge pålitliga och kostnadseffektiva behandlingar med utmärkta långsiktiga resultat.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Ni kan använda kapitalet för att investera i avancerad teknik och utrustning som hjälper er att erbjuda ännu bättre behandlingar.\n- Genom att lösa fakturorna snabbt kan ni förbättra er likviditet och ha bättre kontroll över era ekonomiska flöden.\n- Invoiers AI-algoritm säkerställer att ni får de bästa villkoren och undviker onödiga risker när ni fakturerar kunder."},"anders.larsson@surgicalscience.com":{"simplified_title":"grundare","simplified_name":"Surgical Science","value_proposition":"Surgical Science helps educators, learners, and industry improve medical skills quickly without putting patients at risk and develop well-prepared and confident medical professionals.","industry":"Health Tech & Bioinformatics","target_audience":"medical professionals","market":"B2B","comment_on_content_piece":"Förresten, jag såg att Surgical Science nyligen anordnade en endoskopisk visionsutmaning. Det låter som en spännande möjlighet att främja innovativ medicinsk träning! Bra jobbat!","spoken_industry":"hälso- och bioinformatik","news":"Surgical Science is hosting an endoscopic vision challenge","notable_details":"Surgical Science simulators are used by medical training centers and institutes worldwide for practice, validation, and certification of medical professionals.","summary":"Surgical Science is a leading supplier of virtual reality simulators for medical training. Their mission is to improve medical skills and develop confident professionals through innovative technology.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Med Invoier kan ni snabbt förbättra ert kassaflöde genom att sälja era fakturor och få snabb åtkomst till kapital.\n- Invoiers AI-algoritm säkerställer att ni får de bästa villkoren och inte överbetalar för risk.\n- Genom att använda Invoier kan ni frigöra tid och resurser som ni kan fokusera på att öka er tillväxt och utveckla er verksamhet."},"andras.kalmar@tss.se":{"simplified_title":"productägare","simplified_name":"TSS","value_proposition":"TSS helps the life science industry ensure patient safety at every step of the journey with end-to-end monitoring solutions that deliver SaaS, sensors, and services.","industry":"Health Tech & Bioinformatics","target_audience":"operations teams","market":"B2B","comment_on_content_piece":"Förresten, jag såg att TSS samarbetar nära med life science-branschen för att säkerställa patientens säkerhet. Det låter som en fantastisk och viktig insats!","spoken_industry":"hälsoteknik och bioinformatik","news":"TSS works to ensure patient safety at every step of the journey with end-to-end monitoring solutions that deliver SaaS, sensors, and services developed in close collaboration with the life science industry.","notable_details":"TSS has over 30 years of experience in temperature control and actionable supply chain insights.","summary":"TSS is a health tech company that collaborates with the life science industry to ensure patient safety. They offer end-to-end monitoring solutions that deliver SaaS, sensors, and services to optimize drug distribution and provide valuable insights for the entire supply chain.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- TSS har över 30 års erfarenhet inom temperaturkontroll och supply chain-insikter, vilket kan hjälpa er att effektivisera era processer och minska kostnader.\n- Genom att samarbeta med life science-branschen för att säkerställa patientens säkerhet visar TSS att de har en stark inriktning på kvalitet och förtroende.\n- TSS erbjuder skräddarsydda lösningar som kan anpassas efter era behov, vilket ger er flexibilitet och möjlighet att hitta den bästa balansen mellan kostnad och effektivitet."},"aki@epista.com":{"simplified_title":"operationsdirektör","simplified_name":"Epista","value_proposition":"Epista helps life science companies improve compliance and business expertise, providing solutions and expert consulting.","industry":"Management Consulting","target_audience":"C-levels","market":"B2B","comment_on_content_piece":"Förresten, jag såg att Epista har arbetat med stora globala bioteknikföretag och har fått beröm för deras professionella och stödjande tillvägagångssätt. Det låter som att de verkligen förstår verksamhetsbehoven och är experter inom sitt område.","spoken_industry":"management consulting","news":"Epista is a life science consultancy that focuses on helping companies balance risk and efficiency to achieve more.","notable_details":"Epista works with pharma, biotech, and medical device companies across the life sciences.","summary":"Epista is a management consulting firm specializing in the life sciences industry. They help companies improve compliance and business expertise through expert consulting and innovative solutions. Their focus is on balancing risk and efficiency to achieve better results.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Med Invoiers fakturakredit kan ni snabbt få tillgång till pengar från era obetalda fakturor, vilket kan öka er likviditet och ge er en stabilare ekonomi.\n- Genom att använda Invoier kan ni dra nytta av deras AI-algoritm som säkerställer att ni får de bästa villkoren och inte betalar för mycket för risk.\n- Invoier har nått en milstolpe genom att finansiera 500 miljoner SEK i fakturor, vilket visar på deras förmåga att hjälpa företag att växa och uppnå finansiell stabilitet."},"anders.neijber@photocure.com":{"simplified_title":"medicinansvarig","simplified_name":"Photocure","value_proposition":"Photocure helps the bladder cancer community improve patient management and delivers transformative solutions for positive impact.","industry":"Health Tech & Bioinformatics","target_audience":"medical professionals","market":"B2B","comment_on_content_piece":"Förresten, jag såg att Photocure är engagerade i att förbättra sina ESG-initiativ. Det är mycket imponerande att de strävar efter att vara en del av lösningen och inte problemet.","spoken_industry":"hälso- och bioinformatik","news":"Photocure har släppt sin senaste ESG-rapport.","notable_details":"Photocure är dedikerade till att förbättra hanteringen av blåscancer och har en stark inriktning på miljö, sociala och företagsstyrningsinitiativ.","summary":"Photocure är ett företag som fokuserar på att förbättra hanteringen av blåscancer och levererar innovativa lösningar för att göra en positiv inverkan på patienternas liv. De är engagerade i att förbättra sina ESG-initiativ och har en stark inriktning på miljö, sociala och företagsstyrningsinitiativ.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Factoring med Invoier kan hjälpa till att öka er tillväxt genom att ge er snabb tillgång till likviditet från era fakturor.\n- Genom att använda Invoiers AI-matchingalgoritm kan ni få de bästa villkoren och undvika att betala för mycket för risk.\n- Med Invoiers låga avgifter och goda villkor kan ni förbättra er ekonomiska stabilitet och ha mer kapital tillgängligt för att investera i er verksamhet."},"aps@biogaia.se":{"simplified_title":"chef","simplified_name":"BioGaia","value_proposition":"BioGaia helps consumers improve their health and well-being with probiotic dietary supplements.","industry":"Health Tech & Bioinformatics","target_audience":"consumers","market":"B2C","comment_on_content_piece":"Förresten, jag såg att BioGaia och University of Gothenburg nådde en viktig milstolpe för nästa generations probiotika. Grymt!","spoken_industry":"hälsoteknik och bioinformatik","news":"BioGaia och University of Gothenburg nådde en viktig milstolpe för nästa generations probiotika","notable_details":"BioGaia is a world leader in probiotics and their products are recommended by healthcare professionals in over 100 countries.","summary":"BioGaia är ett svenskt hälsovårdsföretag som är världsledande inom probiotiska kosttillskott. Deras produkter rekommenderas av barnläkare och andra vårdpersonal i över 100 länder. De har nyligen nått en viktig milstolpe för nästa generations probiotika tillsammans med University of Gothenburg.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Ni kan använda fakturakrediten för att finansiera era inköp av probiotiska kosttillskott, vilket hjälper er att öka er försäljning och tillgänglighet av produkterna.\n- Med Invoiers AI-algoritm får ni de bästa villkoren för fakturakrediten, vilket ger er bättre ekonomisk stabilitet och minskar riskerna.\n- Invoier har nått en milstolpe på 500 miljoner SEK finansierade fakturor, vilket visar på deras pålitlighet och erfarenhet inom fakturakreditbranschen."},"anders.signell@hayppgroup.com":{"simplified_title":"cco","simplified_name":"Haypp","value_proposition":"Haypp Group helps consumers choose healthier alternatives to smoking and inspires real change in the industry.","industry":"Health Tech & Bioinformatics","target_audience":"consumers","market":"B2C","comment_on_content_piece":"Förresten, jag såg att Haypp Group fokuserar på att inspirera människor att välja hälsosammare njutning. Det låter som ett fantastiskt tillvägagångssätt!","spoken_industry":"hälso- och bioteknik","news":"Haypp Group har nyligen publicerat nyheter om sin satsning på att inspirera människor att välja hälsosammare alternativ till rökning.","notable_details":"Haypp Group har framgångsrikt betjänat över 790 000 aktiva konsumenter på global nivå.","summary":"Haypp Group är en ledande aktör inom hälso- och bioteknikindustrin och arbetar för att inspirera människor att välja hälsosammare alternativ till rökning. Med sin omfattande erfarenhet och närvaro på global nivå är Haypp Group en pålitlig partner.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Invoier erbjuder några av de bästa avgifterna och villkoren på marknaden, vilket hjälper er att öka er finansiella stabilitet.\n- Invoiers AI-matchingalgoritm säkerställer snabbare tid från försäljning av fakturan till att få utbetalningen, vilket ger er möjlighet att snabbt investera i er tillväxt.\n- Genom att använda AI-algoritmen minimerar Invoier risken för överbetalning och säkerställer att ni får de bästa möjliga villkoren för er fakturakredit."},"andreas.brage@nutraq.com":{"simplified_title":"productowner","simplified_name":"NutraQ","value_proposition":"NutraQ helps consumers improve their everyday life with high quality health and beauty products, offering a range of food supplements and beauty products for a better customer experience. We care about our customers' well-being and strive to make a sustainable impact.","industry":"Health Tech & Bioinformatics","target_audience":"consumers","market":"B2C","comment_on_content_piece":"Förresten, jag såg att NutraQ erbjuder högkvalitativa hälsoprodukter och skönhetsprodukter direkt till konsumenter. Det låter som en fantastisk approach för att förbättra människors liv på ett hållbart sätt!","spoken_industry":"hälsoteknik och bioinformatik","news":"NutraQ erbjuder högkvalitativa hälsoprodukter och skönhetsprodukter direkt till konsumenter.","notable_details":"NutraQ har över 200 anställda och verkar på 11 marknader.","summary":"NutraQ är ett företag inom hälsoteknik och bioinformatik som hjälper konsumenter att förbättra sin vardag genom att erbjuda högkvalitativa hälsoprodukter och skönhetsprodukter. Företaget strävar efter att göra en hållbar inverkan på kundernas välbefinnande.","reasons":"Det här är varför vi tror att ni skulle kunna ha nytta av Invoiers fakturakredit:\n- Med Invoier kan ni snabbt få tillgång till pengarna från era fakturor, vilket kan hjälpa er att öka er likviditet och finansiella stabilitet.\n- Invoiers AI-algoritm säkerställer att ni får de bästa villkoren möjligt och inte betalar för mycket för risker.\n- Genom att fakturera med Invoier kan ni frigöra tid och resurser som ni kan fokusera på att utveckla och växa ert företag."},"undefined":{"simplified_title":"Founder","simplified_name":"&Charge","value_proposition":"Sorry, this page requires Javascript. Please enable it in your browser to access our content.","industry":"Information Technology & Services","target_audience":"consumers","market":"B2C","comment_on_content_piece":"Btw, I saw that this company requires Javascript to access their content. Very modern and user-friendly!","spoken_industry":"information technology and services"}}