{"awatkin@summerland.com.au":{"simplified_title":"CRO","simplified_name":"Summerland Credit Union","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"Summerland Credit Union announced a change in the opening hours at their Ballina, Lismore, Grafton, and Casino branches. They also received the top spot for Excellence in the Sustainability Category at the 2023 Chamber of Commerce awards.","notable_details":"Summerland Credit Union is a B Corp certified business, reflecting their commitment to balancing profit and purpose. They also offer an eco-friendly home loan product with a variable rate of 5.49%PA.","focus":"Customer owned financial institution with high service levels, ethical treatment, and a strong commitment to sustainability.","summary":"Summerland Credit Union is a customer-owned financial institution that places a high priority on service levels, ethical treatment, and sustainability. They are proud to be a B Corp certified business, which means they meet the highest standards of social and environmental performance, public transparency, and legal accountability. They offer a range of financial services including a unique eco-friendly home loan product. Their commitment to sustainability is reflected not only in their products and services, but also in their operations and the communities they serve. They recognize that their success is tied to the success of their customers and communities."},"richard.sleep@adelaidebank.com.au":{"simplified_title":"Regional Manager","simplified_name":"Adelaide Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"The bank has recently upgraded their online banking system to enhance user experience.","notable_details":"The bank acknowledges Aboriginal and Torres Strait Islander peoples as the First Peoples of this nation and the Traditional Custodians of the land. They also offer a variety of banking services including home loans, commercial loans, insurance, and everyday banking services. The bank also has a warning about scammers on their homepage.","focus":"Full Service","summary":"Bendigo and Adelaide Bank is a commercial bank that offers a wide range of services, including home loans, commercial loans, and insurance. They have made recent upgrades to their online banking system to enhance user experience. The bank is unique in its recognition and respect for Aboriginal and Torres Strait Islander peoples as the First Peoples of the nation and the Traditional Custodians of the land. They offer a variety of tools and support to help customers with their financial needs."},"jace.an@banksyd.com.au":{"simplified_title":"Head Of Architecture","simplified_name":"Bank of Sydney","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"The bank recently introduced its Consumer Data Right, Open Banking initiative aimed at providing consumers with greater access to and control over their data. This initiative makes it easier for consumers to compare and switch between products and services.","notable_details":"Bank of Sydney offers a service known as Expect More Investment Home Loan, which enables customers to apply online in just 10 minutes. They also have Home Loan Specialists who provide guidance and expertise throughout the buying process.","focus":"Full-service banking","summary":"Bank of Sydney is a commercial bank in the banking industry providing a full range of banking services. They are committed to meeting the needs of both personal and business customers. Their recent initiative, the Consumer Data Right, Open Banking, gives their customers more access to and control over their data, making it easier to compare and switch between their products and services. They also offer unique services such as the Expect More Investment Home Loan with a guaranteed interest rate for a set period. Their mission is to help customers grow their wealth by providing competitive rates and low annual fees."},"jim.alexander@banksyd.com.au":{"simplified_title":"Head of IT Services","simplified_name":"Bank of Sydney","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"The bank has recently launched the Business Resisec Loan with a variable P&I rate of 6.24% p.a. and LVR up to 60%. They are also warning their customers to be vigilant and look out for suspicious messages.","notable_details":"The bank is part of the Consumer Data Right initiative, which aims to provide customers with greater access to and control over their data. This initiative also simplifies the process of comparing and switching between products and services.","focus":"Full Service","summary":"Bank of Sydney is a full-service commercial bank dedicated to offering a wide range of personal and business banking products and services. These are designed around the specific needs of their customers. They place a strong emphasis on security, advising customers to look out for suspicious messages. Bank of Sydney is also a part of the Consumer Data Right initiative, enabling customers to have better control over their data and making it easier for them to compare and switch between banking products and services."},"jordan.ridis@banksyd.com.au":{"simplified_title":"Broker Relationship Manager","simplified_name":"Bank of Sydney","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"Consumer Data Right, Open Banking aims to provide you with greater access to and control over your data. It also makes it easier to compare and switch between products and services.","notable_details":"Bank of Sydney offers a unique 'Expect More Investment Home Loan' product, with a guaranteed interest rate for a set period.","focus":"Full Service","summary":"Bank of Sydney is a full-service commercial bank that offers personal and business banking products and services designed to meet various customer needs. It is focused on providing a secure and enhanced banking experience, offering competitive rates and low annual fees to help customers grow their wealth. The bank also aims to reduce financial stress and uncertainty for businesses through their range of business loans and overdraft accounts. A notable service provided by the bank is the 'Expect More Investment Home Loan', designed to guarantee the interest rate for a set period. In the spirit of making banking more transparent and customer-friendly, the bank is part of the Consumer Data Right, Open Banking initiative, which aims to provide customers with greater access to their data, and ease the process of comparing and switching between products and services. The Bank of Sydney also places a high value on customer feedback and queries, maintaining a robust support system including an online enquiry form and a friendly staff available on call from Monday to Friday."},"victor.andersson@banksyd.com.au":{"simplified_title":"CFO","simplified_name":"Bank of Sydney","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"The bank is promoting a new initiative called Open Banking, which aims to provide customers with greater access to and control over their data. They are also pushing a service called Expect More Investment Home Loan to help customers grow their wealth.","notable_details":"Bank of Sydney offers a variety of services for different scales of businesses, from small to large. They also have Home Loan Specialists who offer personalized service to guide customers through the buying process.","focus":"Full service","summary":"Bank of Sydney is a full-service commercial bank that caters to individuals and businesses of all sizes. Their services are designed to meet the unique needs of their customers, with a special emphasis on home loans. They offer a range of business loans and overdraft accounts to help reduce the stress and uncertainty of business finances. They have recently launched the Open Banking initiative, which aims to give customers more control over their data and make it easier for them to compare and switch between products and services."},"mbarter@communityfirst.com.au":{"simplified_title":"CRO","simplified_name":"Community First","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"The bank has introduced some security measures for internet banking. Customers will be required to set up a stronger password the next time they login. One Time Passwords will also be mandatory for full access to all Internet Banking features. The bank is also offering a Green Car Loan for new hybrid or electric vehicles. A new low rate credit card promotion is also running from 12/7/23 to 12/10/23 where customers could earn $100.","notable_details":"The bank also offers a unique feature of adding the cost of a charging station to the Green Car Loan. They are promoting a 'no interest' shopping feature with a low monthly fee depending on the limit chosen by the customer.","focus":"Community focused banking services, loans and deposits.","summary":"Community First Bank, a Credit Union, provides a range of banking services with a community focus. They recently introduced stronger security measures for their internet banking and are promoting a Green Car Loan for new electric or hybrid vehicles, including the cost of a charging station. They are also running a promotion for a new low rate credit card where customers could earn $100. The bank is committed to customer security, sustainable banking, and providing competitive financial products."},"dean.barton@defencebank.com.au":{"simplified_title":"CFO","simplified_name":"Defence Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full service bank","news":"Defence Bank has won the Defence Services Bank of the Year award two years in a row at the 2023 WeMoney Banking Awards. They have also announced changes to the Defence Home Ownership Assistance Scheme Act 2008 approved by the Federal Government.","notable_details":"Defence Bank offers a unique Visa Debit Card, where customers can choose from four camouflage designs. They also have an award-winning app highly-rated by their members.","focus":"Defence Bank's focus is on serving members of the Australian Defence Force and the wider community with a member-focused, people-led, technology-enabled banking products and services.","summary":"Defence Bank is a full service bank that has been serving Australian Defence Force members and the wider community since 1975. They focus on providing member-focused, people-led, technology-enabled banking products and services. Defence Bank is known for its innovative offerings, such as their unique Visa Debit Card with camouflage designs, and their award-winning app. They have recently won the Defence Services Bank of the Year award two years in a row at the 2023 WeMoney Banking Awards."},"lisa.edwards@greater.com.au":{"simplified_title":"Product Owner","simplified_name":"Greater Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"The bank's community funding program 'Thanks a Mil' has now supported more than 770 community groups with a total of $1 million. Greater Bank has recently welcomed new partnerships with batyr, The Smith Family, University of Newcastle and Dress for Success, sharing in a total investment of almost $800,000.","notable_details":"Greater Bank is a part of the Newcastle Greater Mutual Group. It has a community focus with programs like 'Thanks a Mil' and has reached a milestone of giving away over half a million dollars to the community. Also, they were named among the winners at the recently announced WeMoney Banking Awards 2023.","focus":"Full Service","summary":"Greater Bank is a mutual bank that offers a wide range of banking and lending products and services. As a mutual bank, it is customer-focused rather than shareholder-focused, allowing it to reinvest its profits into the community and support organizations and programs that matter to its customers. The bank has a strong community presence, running programs like 'Thanks a Mil' that has supported more than 770 community groups with a total of $1 million. They are committed to providing great value products and convenient services and were recognized for their efforts at the WeMoney Banking Awards 2023. They aspire to make banking greater for their customers, whether it's for personal or business banking."},"max.francis@greater.com.au":{"simplified_title":"Product Owner","simplified_name":"Greater Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":["The bank's Community Funding Program has supported more than 770 community groups with a total of $1 million","Greater Bank announces new partnerships with batyr, The Smith Family, University of Newcastle and Dress for Success, sharing in a total investment of almost $800,000","Greater Bank was named among the winners at the WeMoney Banking Awards 2023"],"notable_details":["Greater Bank operates as a mutual bank, meaning it has customers, not shareholders","The bank offers both banking and lending products and services","The bank has a focus on supporting the communities they call home"],"focus":"Full Service","summary":"Greater Bank is a mutual bank that offers a range of banking and lending products and services. They prioritize their customers over shareholders, allowing them to utilize profits to support local organizations, events, and programs. Their vision is to provide excellent value and convenient services to their customers, making banking feel more personal and less like a number. They've recently been recognized at the WeMoney Banking Awards 2023, and have made notable contributions to their communities through their Community Funding Program and partnerships with various organizations."},"sascha.finlay@greater.com.au":{"simplified_title":"Product Owner","simplified_name":"Greater Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"Greater Bank’s Community Funding Program has supported over 770 community groups with funding of $1 million. The bank has recently announced new partnerships with batyr, The Smith Family, University of Newcastle and Dress for Success, sharing in a total investment of almost $800,000. They have also recently been named among the winners at the WeMoney Banking Awards 2023.","notable_details":"Greater Bank is a mutual bank, which means it does not have shareholders but customers. This allows them to use their profits to support organisations, events and programs that their customers care about. They also have a community focus, with a Community Funding Program supporting regional community groups.","focus":"Full Service","summary":"Greater Bank is a regional financial powerhouse operating as a mutual bank, meaning they don't have shareholders but customers. They offer a range of banking and lending services, aiming to help customers grow, save and protect their money. The bank's vision is to provide great value products and convenient services, while making customers feel valued. They have a strong community focus, using their profits to support organisations and programs that their customers care about. They also run a Community Funding Program, which has supported over 770 community groups."},"stephen.boorer@greater.com.au":{"simplified_title":"Analytics Manager","simplified_name":"Greater Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"The bank's Community Funding Program has supported over 770 community groups with a total of $1 million. In addition, they have recently formed new partnerships with organizations such as batyr, The Smith Family, University of Newcastle and Dress for Success, contributing a total investment of nearly $800,000.","notable_details":"The bank is customer-owned, meaning they don't have shareholders but rather it is the customers who benefit from the profits. They have also recently hit a significant milestone of giving away over half a million dollars through their Community Funding Programs.","focus":"Full Service","summary":"Greater Bank is a mutual, full-service bank that focuses on providing great value products and convenient services to its customers. They offer a range of banking and lending products designed to help customers grow, save, and protect their money. Being a mutual bank, the profits are used to support organizations, events, and programs that their customers care about. They have a strong commitment towards supporting the community, as evidenced by their Community Funding Program and partnerships with charitable organizations. The bank takes pride in making banking a greater experience for its customers."},"claydon.r@heritage.com.au":{"simplified_title":"Head of Transformation","simplified_name":"Heritage Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"Heritage and People's Choice have officially merged to create a new national mutual that offers a compelling alternative to the big banks. There is also a promotion for customers purchasing eligible new Home and Contents, Building, Landlord, Caravan or Comprehensive Motor Insurance before 31 October 2023, where they'll receive a $150 eGift card.","notable_details":"The bank offers a high term deposit rate of 5.15 % PA for a 12 month term deposit for $1,000 or more. They also offer a range of personal loans with features like low interest rates, unlimited extra repayments and free online redraw. They have a strong focus on helping their customers achieve their financial dreams.","focus":"Full Service","summary":"Heritage Bank is a full-service mutual bank that offers a wide range of financial products and services, including banking, loans, and business services. The bank is customer-focused, aiming to help its customers achieve their financial dreams, whether it's for a car, home, or business. They offer competitive rates on term deposits and personal loans, and have a strong focus on customer service and support. They recently merged with People's Choice to create a compelling alternative to the big banks. Heritage Bank acknowledges and honours the traditional owners of the land on which they operate."},"collie.d@heritage.com.au":{"simplified_title":"Product Manager","simplified_name":"Heritage Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full-Service Bank","news":"Heritage and People's Choice have officially merged to create a new national mutual that offers a compelling alternative to the big banks. They are also offering a $150 eGift card for purchase of eligible new Home and Contents, Building, Landlord, Caravan or Comprehensive Motor Insurance before 31 October 2023.","notable_details":"Heritage Bank acknowledges and honors the traditional owners of the land on which they operate. They also have a customer-focused approach, aiming to help their customers achieve their goals in life and reach their financial dreams.","focus":"Full-Service, Personal Loans, Home and Content Insurance","summary":"Heritage Bank, a full-service bank, offers a comprehensive range of banking services including loans and insurance. They recently merged with People's Choice to create a new national mutual bank, aiming to offer a compelling alternative to big banks. Heritage Bank puts a strong emphasis on helping their customers achieve their life and financial goals. They are currently running a promotion, offering a $150 eGift card for eligible insurance purchases. They acknowledge and respect the traditional owners of their land, displaying a commitment to social responsibility."},"grady.m@heritage.com.au":{"simplified_title":"Assistant Product Manager","simplified_name":"Heritage Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full Service Bank","news":"Heritage and People's Choice have officially merged to create a new national mutual that offers a compelling alternative to the big banks. They also have a promotion running where customers purchasing eligible new Home and Contents, Building, Landlord, Caravan or Comprehensive Motor Insurance before 31 October 2023 will receive a $150 eGift card.","notable_details":"Heritage Bank has a strong focus on helping their customers achieve their life and financial goals, whether it's buying a first car, home, or starting a business. They also acknowledge and honor the traditional owners of the land, showing respect to Aboriginal and Torres Strait Islander cultures and elders.","focus":"Full service including banking, loans and business services with a strong focus on customer's life and financial goals","summary":"Heritage Bank, a full-service bank, recently merged with People's Choice to create a new national mutual bank. They offer a wide range of services including banking, loans, and business services. The bank is committed to helping their customers achieve their life and financial goals. They are currently running a promotion offering a $150 eGift card for those purchasing eligible insurances. Heritage Bank also shows commitment to social responsibility by acknowledging and honoring the traditional owners of the land."},"david.zufic@imb.com.au":{"simplified_title":"CIO","simplified_name":"IMB Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full-service bank","news":["IMB BANK ANNOUNCES INTEREST RATE CHANGES – JUNE 2023","APPLICATIONS OPEN: IMB BANK COMMUNITY FOUNDATION FUNDING NOW AVAILABLE FOR COMMUNITY ORGANISATIONS","IMB BANK RECEIVES WORKPLACE GENDER EQUALITY AGENCY CITATION FOR SECOND CONSECUTIVE TERM"],"notable_details":"IMB Bank has a history dating back to 1880, making it one of the longest-standing financial institutions in the country. Apart from the usual banking services, it also has a community foundation providing grant funding for not-for-profit groups. IMB Bank has received Workplace Gender Equality Agency Citation for the second consecutive term.","focus":"Full-service banking with a focus on personal banking, home and personal lending, savings and transaction accounts, term deposits, business banking. They also emphasize digital banking convenience alongside traditional, in-person services.","summary":"IMB Bank, established in 1880, is one of the oldest financial institutions in Australia. They provide a fully featured range of services, from home and personal lending to savings and transaction accounts, to term deposits and business banking. The bank places a high emphasis on innovation, providing secure digital banking options for the convenience of its members. It operates a growing retail branch network throughout New South Wales and Victoria. IMB Bank also has a community-oriented focus, running a community foundation that provides grant funding to not-for-profit groups. They have recently been recognized for their focus on workplace gender equality."},"justin.chow@ing.com.au":{"simplified_title":"Product Manager","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full-service bank","news":"The bank recently issued an investment scam alert, warning customers that ING does not offer individual bond products and advising them to speak to a financial professional for investment advice. They are currently offering discounts on various insurance policies including car, home and contents, motorcycle, and pet insurance.","notable_details":"ING offers a wide variety of financial products and services, including checking and savings accounts, credit cards, personal and home loans, insurance, and superannuation. They also provide business savings and commercial loans. ING is also dedicated to making banking accessible for all, including customers with disabilities.","focus":"ING's focus is on providing easy access to everyday banking with great benefits, offering competitive rates, and providing practical financial solutions. They strive to make banking uncomplicated for their customers and offer numerous online tools for ease of banking. They also have a focus on financial support for customers experiencing financial difficulty.","summary":"ING is a full-service bank based in Australia, providing a wide array of financial services including checking and savings accounts, credit cards, personal and home loans, insurance, and superannuation. They are also dedicated to providing business solutions with competitive rates on term deposits, high variable interest savings, and commercial property loans. With a commitment to making banking easy and accessible for all, ING offers a variety of online tools and support for customers experiencing financial difficulty. They are also committed to transparency and adherence to the Banking Code of Practice."},"linda.dasilva@ing.com.au":{"simplified_title":"CIO","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"ING has recently issued an investment scam alert, confirming that it does not offer individual bond products and recommends speaking to a financial professional for investment in any type of asset or security.","notable_details":"ING offers various discount offers on insurance products such as car, home & contents, motorcycle, and pet insurance when you purchase a policy online. They also have a unique savings account called 'Savings Maximiser' that offers competitive ongoing rates, helping customers towards their savings goals.","focus":"Full service","summary":"ING is a full-service commercial bank based in Australia offering a variety of products and services like credit cards, personal loans, home loans, wealth building, business solutions, insurance, and superannuation. They also provide financial support for customers struggling with their Home Loan, Personal Loan, or Credit Card through the Know Your Customer process. ING is a customer-centric bank, focused on making everyday banking simple with their Orange Everyday and Savings Maximiser accounts. Their vision is to provide easy and accessible banking with great benefits, competitive rates and rewards for saving with them."},"manpreet.singh@ing.com.au":{"simplified_title":"Product Owner","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full-service bank","news":"Recent news includes an alert about an investment scam related to individual bond products and a reminder for customers about the Know Your Customer process. The bank is also offering a range of discounts on ING Car, Home & Contents, Motorcycle, and Pet Insurance for the first year's premium when purchased online.","notable_details":"ING Bank offers a wide range of services from credit cards, personal loans, home loans to insurances and superannuation. They are also committed to making banking more accessible for people with disabilities and offer financial support for those experiencing financial difficulty. They have a unique product called Orange Everyday which offers benefits like 1% cashback on eligible utility bills, $0 international transaction fees and up to 5 rebated ATM withdrawal fees a month.","focus":"Full-service, offering both personal and commercial banking services including saving and banking, credit cards, personal loans, home loans, insurance, superannuation, and commercial lending.","summary":"ING Bank is a full-service bank based in Australia with a focus on offering a wide range of banking products and services. They provide personal and commercial banking services, including saving and banking, credit cards, personal loans, home loans, insurance, superannuation, and commercial lending. They strive to make banking more accessible for all and offer financial support for those in need. One of their unique products is the Orange Everyday account that offers various benefits to customers. ING is committed to providing superior customer service and adheres to the Banking Code of Practice, a set of commitments developed by the banks in collaboration with the Australian Banking Association."},"mariam.janjgava@ing.com.au":{"simplified_title":"CIO","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full-Service Bank","news":"There is no specific news update mentioned in the content.","notable_details":"ING offers a range of banking services including credit cards, personal loans, home loans, savings accounts, and commercial loans. They also provide insurance products for car, home & contents, motorcycle and pet. ING also alerts about an investment scam, stating that they do not offer individual bond products.","focus":"ING focuses on providing a comprehensive range of banking services, from everyday banking to savings and loans. They also provide insurance services and have a focus on customer support, with a dedicated team based in Australia.","summary":"ING is a full-service bank, providing a wide array of banking services including credit cards, personal loans, home loans, savings accounts, and commercial loans. They also offer a range of insurance products. ING emphasizes customer care, with a dedicated team based in Australia. They are committed to delivering a simple and straightforward banking experience, offering competitive rates and a variety of products to cater to the diverse needs of their customers."},"mia.annamalai@ing.com.au":{"simplified_title":"Sourcing Lead","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full-service bank","news":"There is a scam alert about individual bond products, and ING is advising its customers to consult financial professionals before investing in any type of asset or security.","notable_details":"Offers a wide range of insurance options, including car, home & contents, motorcycle, and pet insurance. There are discounts on the first year's premium when purchasing policies online. In addition, ING offers a savings account called Savings Maximiser with competitive ongoing rates, helping customers towards their saving goals.","focus":"Retail banking, savings and loan services, insurance, and commercial lending","summary":"ING is a full-service bank based in Australia that offers a wide range of banking and financial services, including retail banking, savings accounts, personal loans, credit cards, insurance, and commercial lending. The bank aims to simplify everyday banking for its customers, offering easy access to banking with great benefits. They also provide a savings account called Savings Maximiser that offers competitive rates to help customers reach their savings goals. In addition, they offer a range of insurance options with discounts on the first year's premium when purchasing policies online. ING also alerts its customers about potential investment scams and advises them to consult financial professionals before investing."},"michael.koumoukelis@ing.com.au":{"simplified_title":"Associate Product Manager","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full Service Bank","news":"They have recently posted alerts about investment scams, stating that they do not offer individual bond products and recommend speaking to a professional for investment advice.","notable_details":"ING offers a wide range of products from credit cards to insurance to personal loans. They also offer discounts on first year's premiums on various insurance policies when purchased online.","focus":"Full service","summary":"ING is a full-service bank based in Australia. The bank offers a wide array of products such as credit cards, personal loans, insurance, and savings accounts. They are focused on providing easy access to everyday banking with great benefits. They also offer competitive interest rates and various discounts for online insurance policy purchases. They are committed to making banking more accessible for everyone and have a dedicated customer care team to help their customers."},"nirav.barot@ing.com.au":{"simplified_title":"Engineering Manager","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full Service Bank","news":"ING is currently offering discounts on various insurance policies including car, home and contents, motorcycle, and pet insurance. They have also issued an investment scam alert, clarifying that ING does not offer individual bond products.","notable_details":"ING provides a comprehensive range of services, including personal and business banking, loans, insurance, and superannuation. A unique feature of the bank is its Orange Everyday account, which offers benefits such as 1% cashback on eligible utility bills, ING international transaction fee waivers, and up to five rebated ATM withdrawal fees a month.","focus":"Full Service","summary":"ING is a full-service bank based in Australia. They are focused on providing an easy and accessible banking experience to their customers. Their services range from everyday banking and savings accounts, credit cards, personal loans, and home loans, to insurance, superannuation, and commercial lending. They are particularly notable for their Orange Everyday account, which comes with several benefits including cashbacks and fee waivers. In addition, they offer discounts on various insurance policies. Their mission is to make banking straightforward, simple, and beneficial for their customers."},"nishith.kumar@ing.com.au":{"simplified_title":"Product Owner","simplified_name":"ING","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full Service Bank","news":"ING is offering a discount on various insurance products such as car, home & contents, motorcycle, and pet insurance when the policy is purchased online. They have also issued an investment scam alert, stating that ING does not offer individual bond products and recommends speaking to a financial professional.","notable_details":"ING offers a range of financial products including savings accounts, credit cards, personal loans, home loans, insurance, and superannuation. They also provide commercial loans and business savings solutions. They have a strong online presence and emphasize easy everyday banking with great benefits.","focus":"Full Service Banking","summary":"ING is a full-service bank based in Australia, with a strong focus on providing a range of financial services that include savings accounts, credit cards, personal loans, home loans, insurance, and superannuation. They also cater to the business sector with commercial loans and business savings accounts. ING is committed to making banking easy and accessible for their customers, offering competitive rates and online banking services. They also place emphasis on financial support, offering help to those in financial difficulty."},"kelly.smith@qbank.com.au":{"simplified_title":"CFO","simplified_name":"QBANK","industry":"Banking","spoken_industry":"banking","type_of_bank":"Credit Union","news":"QBANK has recently been awarded three MOZO Experts Choice Awards for its Home Loan products. They have also launched a new QBANK App that aims to make banking more convenient for its customers.","notable_details":"QBANK places strong emphasis on ethical and compliant employment practices and is committed to social responsibility, environmental sustainability and financial wellbeing. They have a special offer for home loan applications of $150,000 or more for a limited time. They also acknowledge the Traditional Owners of the lands on which they operate and pay respects to their Elders.","focus":"Full Service","summary":"QBANK is a credit union that operates in the banking industry, providing a full range of services to its customers. The bank has received recognition for its Home Loan products with three MOZO Experts Choice Awards and is continually working to improve customer experience, as shown with the launch of their new QBANK App. QBANK also places a strong focus on ethical employment practices and is committed to social responsibility, environmental sustainability and financial wellbeing. They value their community and strive to contribute to society in a positive way."},"alexa.glynn@rabobank.com":{"simplified_title":"COO","simplified_name":"Rabobank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Wholesale and Rural Bank","news":"No specific news has been mentioned on the website content provided.","notable_details":"The bank uses a catchphrase - 'Growing a better world together' - which indicates its commitment to social and environmental impact. They also put a significant emphasis on ensuring the safety and user-friendliness of their website, allowing customers to adjust their cookie and personal information processing settings.","focus":"Wholesale and Rural Banking","summary":"Rabobank is a Wholesale and Rural bank that uses its deep industry knowledge to anticipate clients' needs and deliver tailored financial solutions. Their vision revolves around 'Growing a better world together', indicating a focus on social and environmental impact. They place a significant emphasis on user-friendly and safe digital experiences for their customers, allowing adjustments to cookie and personal information processing settings."},"andrew.fartek@rabobank.com":{"simplified_title":"Senior Manager Deposit Products","simplified_name":"Rabobank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Wholesale and Rural Bank","news":"Not specified in the provided content.","notable_details":"Rabobank operates on a global scale, fostering a unique approach towards banking with a focus on food and agriculture financing. They use cookies to optimize customer experience, including videos, podcasts, and information about relevant products and services.","focus":"Wholesale and Rural services, with a specific emphasis on food and agriculture financing.","summary":"Rabobank is a global banking institution that concentrates on wholesale and rural services, with an emphasis on food and agriculture. They operate with the vision of 'Growing a better world together', aiming to revolutionize the food industry. Their approach to banking includes an optimized user experience, offering videos, podcasts, and relevant product and service information through their website."},"gene.esaulov@rabobank.com":{"simplified_title":"Manager","simplified_name":"Rabobank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Wholesale and Rural Bank","news":"No specific news is mentioned in the provided content.","notable_details":"Rabobank appears to have a strong focus on rural banking and wholesale, and is making efforts towards creating a better world, possibly through sustainable and environmentally conscious practices.","focus":"Wholesale and Rural Banking","summary":"Rabobank is a Wholesale and Rural Bank with a strong commitment to creating a positive impact on the world. Their focus is not just on providing banking services but also on contributing to a 'food revolution', implying a strong interest in sustainable agricultural practices. They provide a range of services, including banking for businesses and individual customers, with an emphasis on rural services. Their approach to banking is customer-centric, as they strive to optimize the customer experience with features like videos, podcasts, and relevant product and service information."},"ingrid.child@rabobank.com":{"simplified_title":"Chief Risk Officer","simplified_name":"Rabobank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Wholesale bank","news":"Not available","notable_details":"Rabobank uses cookies to ensure a safe and user-friendly experience on their website. They also offer an 'optimized customer experience,' which includes videos, podcasts, and information about relevant products and services.","focus":"Rural banking and wholesale banking","summary":"Rabobank is a wholesale bank with a strong focus on rural banking. They aspire to grow a better world together, indicating a commitment to sustainability and community growth. They offer an enhanced user experience through their website, featuring videos, podcasts, and relevant product information. However, there is no recent news available on their site."},"jamie.turnbull@rabobank.com":{"simplified_title":"Business Analytics Manager","simplified_name":"Rabobank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Wholesale and Rural Bank","news":"No specific news articles are mentioned in the provided content.","notable_details":"Rabobank appears to have a clear focus on rural and wholesale banking. They also express a strong interest in the food revolution, potentially indicating a focus on agricultural and food businesses.","focus":"Wholesale and Rural Banking, with an emphasis on supporting the food revolution.","summary":"Rabobank is a Wholesale and Rural Bank that uses its knowledge and resources to support customers in the banking industry, with a specific emphasis on the agricultural sector. Rabobank's mission is to contribute to the food revolution and they believe in 'Growing a Better World Together'. The bank seems to put a significant focus on customer experience, offering a variety of digital resources such as videos, podcasts, and relevant product information."},"john.bott@rabobank.com":{"simplified_title":"Product Owner","simplified_name":"Rabobank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Wholesale and Rural Bank","news":"No specific news has been provided in the given text","notable_details":"The bank uses cookies to optimize customer experience and provide relevant information","focus":"Rural and wholesale banking with a focus on food revolution","summary":"Rabobank is a wholesale and rural bank focusing on providing an optimized user experience through the use of cookies. They are committed to improving the world by contributing to the food revolution. Despite the lack of specific news updates, they constantly work towards creating an impact in their industry."},"jolene.janzen@rabobank.com":{"simplified_title":"COO","simplified_name":"Rabobank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Wholesale and Rural Bank","news":"Not provided in the content","notable_details":"Rabobank uses cookies to provide a safe and user-friendly website and optimise customer experience. The bank also has a focus on contributing to food revolution","focus":"Wholesale and Rural Banking","summary":"Rabobank is a bank with a focus on wholesale and rural banking. Their website uses cookies to ensure a safe and user-friendly platform for their customers, while also offering optimized customer experience. They have a strong mission of growing a better world together, contributing to the food revolution. However, their recent news or reports were not provided in the content."},"josh.coulthurst@rabobank.com":{"simplified_title":"Product Owner","simplified_name":"Rabobank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Commercial Bank","news":"The bank's website does not provide any recent news.","notable_details":"Rabobank has a strong focus on rural communities and the farming industry, potentially indicating a specialization in agricultural financing.","focus":"Wholesale and Rural banking","summary":"Rabobank is a commercial bank with a strong focus on providing wholesale and rural banking services. They aim to contribute to the development of rural communities and the agricultural industry, as indicated by their motto 'Growing a Better World Together'. The bank is committed to providing a safe and user-friendly online experience for its clients. However, no recent news updates or announcements are available on their website."},"martin.cipi@rabobank.com":{"simplified_title":"COO","simplified_name":"Rabobank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Wholesale and Rural Bank","news":"No specific news updates are available from the content provided","notable_details":"Rabobank uses cookies for an optimized customer experience, including videos, podcasts and information about relevant products and services. They also have a focus on understanding and contributing to the 'food revolution'","focus":"Rabobank has a focus on wholesale and rural banking, with an emphasis on contributing to a 'food revolution'","summary":"Rabobank is a Wholesale and Rural Bank, focusing on providing optimized customer experiences through the use of videos, podcasts, and relevant product and service information. They have a unique emphasis on understanding and contributing to the 'food revolution', showcasing their dedication to not only their banking services, but also their commitment to making a positive impact on society. The bank is also known for its use of cookies to enhance user experience on their website."},"namby.srinivasan@rabobank.com":{"simplified_title":"Head of IT Systems","simplified_name":"Rabobank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Wholesale and Rural Bank","news":"The bank does not provide any specific recent news in the provided content.","notable_details":"Rabobank seems to have a strong commitment to the food revolution, indicating a focus on sustainability and agricultural sectors. The bank also offers an optimized customer experience with videos, podcasts, and relevant information about their products and services.","focus":"Rabobank focuses on wholesale and rural banking, catering to the needs of businesses and rural communities. They also have a significant focus on the food and agricultural sector.","summary":"Rabobank is a wholesale and rural bank with a strong commitment to driving a food revolution, highlighting their emphasis on sustainability and the agricultural sector. They prioritize an optimized customer experience, offering numerous resources such as videos, podcasts, and relevant product and service information. Their banking services cater to the needs of both businesses and rural communities."},"robert.nikolov@rabobank.com":{"simplified_title":"Senior Product Manager","simplified_name":"Rabobank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Wholesale and Rural Bank","news":"Not available from the provided content","notable_details":"Rabobank uses cookies to enhance user experience and provide relevant information to its users. It also has a section on its website dedicated to impact, showcasing its commitment towards social and environmental changes.","focus":"Wholesale and Rural banking services","summary":"Rabobank is a Wholesale and Rural Bank with a focus on providing user-friendly services through its online platforms, enabled by use of cookies for an optimized customer experience. The bank values social and environmental changes and works towards 'Growing a Better World Together', as reflected in its impact section. Its services include rural and wholesale banking products, and it offers a range of digital resources such as videos and podcasts."},"saurav.mahajan@rabobank.com":{"simplified_title":"Lead Solutions Architect","simplified_name":"Rabobank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Wholesale and Rural bank","news":"The bank's website does not provide specific recent news. However, it mentions a 'food revolution' which could be a recent initiative or focus.","notable_details":"Rabobank uses cookies to optimize customer experience, including videos, podcasts, and information about relevant products and services. They also have a section titled 'Road to Change', implying a strong focus on impact and sustainable business practices.","focus":"Rabobank appears to focus on wholesale and rural banking, with a strong emphasis on sustainability and a 'food revolution', indicating a focus on agricultural sectors and sustainable food production.","summary":"Rabobank is a Wholesale and Rural Bank with a strong emphasis on sustainable practices. They prioritize an optimized customer experience, offering features like videos and podcasts. They are dedicated to 'Growing a Better World Together' and are involved in the 'food revolution', focusing on sustainable food production and agriculture. They also value transparency and customer choice, as evidenced by their open approach to cookies and personal data processing."},"michael.cameron@stgeorge.com.au":{"simplified_title":"CFO","simplified_name":"St.George","industry":"Banking","spoken_industry":"banking industry","type_of_bank":"Corporate Bank","news":"St.George is offering a $2K cashback for customers who refinance their home loans with them by 31/08/2023. The bank has also introduced a 'Roarsome' Landlord Insurance, providing coverage against potential damages and loss. Another notable update is their term deposit rate of 4.75% p.a. on 12-23 month terms","notable_details":"St.George acknowledges the traditional owners and pays respects to Australia’s First Peoples, and to their Elders past and present, indicating their strong commitment to the community. They also offer support to customers experiencing financial difficulty or personal circumstances.","focus":"Full Service","summary":"St.George is a corporate bank providing full-service banking solutions to personal, business and corporate clients. They offer a range of products and services, from home loans to insurance and term deposits. St.George is committed to helping their customers, offering support to those in financial difficulty or facing difficult personal circumstances. As part of their community commitment, they acknowledge and respect the traditional owners of the land."},"ritchie@theiagroup.com.au":{"simplified_title":"Head of Technology","simplified_name":"Resimac Asset Finance","industry":"Finance","spoken_industry":"finance","type_of_bank":"Lending Institution","news":"The bank is currently experiencing technical issues with their phone system and are directing customers to email for urgent enquiries. They have announced that the June statement with a yearly interest summary will be available for download on 7 July.","notable_details":"Resimac Asset Finance has a unique environmentally friendly initiative where they support tree planting projects across Australia. Their parent company's initiatives have led to the planting of over 40,000 trees in the past 10 years.","focus":"Lending Solutions for Commercial Borrowers and Consumers","summary":"Resimac Asset Finance is a competitive lending institution focused on providing flexible finance solutions and great rates for commercial borrowers and consumers. They cater to a variety of needs, offering loan options for financing cars used for commercial or business purposes, equipment finance, secured loans, and insurance premium loans. They pride themselves on their quick turnaround times and their ability to think outside the box to develop solutions tailored to their clients' needs. Furthermore, they are environmentally conscious, supporting community tree planting projects across Australia."},"jtachdjian@tmbl.com.au":{"simplified_title":"Head of IT","simplified_name":"Teachers Mutual Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"No recent news posted on their website","notable_details":"Teachers Mutual Bank Limited operates several divisions, including Health Professionals Bank, Firefighters Mutual Bank, UniBank, and Hiver Bank. The bank acknowledges the Traditional Custodians of Country through Australia and respects Aboriginal and Torres Strait Islander cultures.","focus":"Full service bank, specifically catering to key workers such as teachers, health professionals, firefighters, and university staff","summary":"Teachers Mutual Bank Limited is a full-service mutual bank based in Australia. They are committed to helping key workers, such as teachers, health professionals, firefighters, and university staff, secure their financial future. The bank operates multiple divisions including Health Professionals Bank, Firefighters Mutual Bank, UniBank, and Hiver Bank. It's notable that they acknowledge the Traditional Custodians of Country throughout Australia and pay respect to Aboriginal and Torres Strait Islander cultures. However, their products and services are available only in Australia."},"lnguyen@tmbl.com.au":{"simplified_title":"IT Commercial Manager","simplified_name":"Teachers Mutual Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"No recent news posted on the website.","notable_details":"Teachers Mutual Bank Limited acknowledges the Traditional Custodians of Country through Australia and their continuing connection to land, water and communities. They extend respect to all Aboriginal and Torres Strait Islander peoples today. They also have different divisions such as Health Professionals Bank, Firefighters Mutual Bank, UniBank, and Hiver Bank.","focus":"Full service","summary":"Teachers Mutual Bank Limited is an Australian mutual bank that provides full service banking products and services. It is committed to serving key workers and helping them secure their financial future. The bank operates various divisions including Health Professionals Bank, Firefighters Mutual Bank, UniBank, and Hiver Bank. Teachers Mutual Bank acknowledges and respects the Traditional Custodians of Country throughout Australia and their continuing connection to land, water, and communities, extending that respect to all Aboriginal and Torres Strait Islander peoples today. Their services and products are subject to terms and conditions, and they adhere to a policy of transparency regarding any changes in fees or the introduction of new features."},"mappleby@tmbl.com.au":{"simplified_title":"Product Owner","simplified_name":"Teachers Mutual Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"No recent news posted on the website","notable_details":"Teachers Mutual Bank Limited has various divisions including Teachers Mutual Bank, Health Professionals Bank, Firefighters Mutual Bank, UniBank, and Hiver Bank. They acknowledge the Traditional Custodians of Country throughout Australia and extend respect to all Aboriginal and Torres Strait Islander peoples today.","focus":"Full service","summary":"Teachers Mutual Bank Limited is a full-service mutual bank with a primary focus on helping key workers secure their financial future. They offer a range of products and services, with conditions, fees, and charges that may change over time or with new introductions. Their operations are based in Australia and they operate under various divisions including Teachers Mutual Bank, Health Professionals Bank, Firefighters Mutual Bank, UniBank, and Hiver Bank. The bank prides itself on acknowledging the Traditional Custodians of Country throughout Australia and respecting Aboriginal and Torres Strait Islander cultures."},"nlochner@tmbl.com.au":{"simplified_title":"Head of Product","simplified_name":"Teachers Mutual Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mutual Bank","news":"No recent news posted on the website","notable_details":"Teachers Mutual Bank Limited has numerous divisions including Health Professionals Bank, Firefighters Mutual Bank, UniBank, and Hiver Bank. It has a strong focus on key workers in various sectors and respects traditional custodians of the land, Aboriginal and Torres Strait Islander cultures.","focus":"Full service bank with a focus on key workers","summary":"Teachers Mutual Bank Limited is a full-service mutual bank with a passion for helping key workers secure their financial future. Operating under various divisions such as Health Professionals Bank, Firefighters Mutual Bank, UniBank, and Hiver Bank, it offers a range of financial products and services with certain conditions, fees, and charges. The bank acknowledges the Traditional Custodians of Country throughout Australia and respects Aboriginal and Torres Strait Islander cultures. Teachers Mutual Bank Limited operates exclusively in Australia under Australian credit license."},"ktait@unitybank.com.au":{"simplified_title":"CRO","simplified_name":"Unity Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Unknown","news":"No news available.","notable_details":"This bank has numerous branches across different locations and also seems to have a Relationship Manager for certain regions.","focus":"Unknown","summary":"While the bank's specific type and focus are not clear from the available content, it is evident that it has a significant presence across various locations. It also appears to prioritize customer relations, as suggested by the mention of a Relationship Manager for certain regions. However, without further information, a complete summary cannot be provided."},"anson.parker@up.com.au":{"simplified_title":"CPO","simplified_name":"Up","industry":"Banking","spoken_industry":"banking","type_of_bank":"Mobile Bank","news":"No recent news posted on the website.","notable_details":"Up is a brand of Bendigo and Adelaide Bank Limited and offers banking services that are 100% mobile. They have over 725,000 Australian customers. They offer a feature called 2Up for cooperative finance management with mates.","focus":"Mobile Banking, Easy Budgeting, Easy Saving, and financial control","summary":"Up is an Australian mobile banking service operated under the Bendigo and Adelaide Bank Limited. With a focus on easy budgeting, saving, and financial control, Up offers a fresh, digital approach to banking. A user-friendly interface, in-app customer support, and innovative features like cooperative finance management with mates make Up a preferred choice for over 725,000 Australians. Up is all about giving its users a sense of control over their finances and making the banking experience seamless and enjoyable."},"charper@australianunity.com.au":{"simplified_title":"General Manager","simplified_name":"Australian Unity","industry":"Banking, Financial Services, Health and Insurance","spoken_industry":"banking, financial services, health and insurance","type_of_bank":"Full-service bank","news":"Currently, the bank is running a promotional offer where customers can join hospital & extras by 3 November 2023 and get 6 weeks free. Plus, all 2 month and optical waiting periods on extras will be waived.","notable_details":"Australian Unity has a rich history, having been supporting Australians since 1840. They are member-owned and invest in the products and services that matter to their members, customers, and the community. They have been measuring the well-being of Australians for 20 years and are committed to creating positive community and social value for all Australians.","focus":"A full-service bank, Australian Unity focuses on personalized service and competitive rates. They offer a broad range of services including health insurance, banking, wealth and investment solutions, and insurance. They also provide services for aged care, retirement living, home care, and Aboriginal home care.","summary":"Australian Unity is a full-service bank that has been serving Australians since 1840. They are member-owned and deeply committed to the well-being of their customers, offering a wide range of services from banking to health insurance and wealth management. They also cater to the needs of the elderly and vulnerable with services including aged care, retirement living, and home care. With a focus on personalized service and competitive rates, Australian Unity is a bank that is run to support its members and customers. They are dedicated to creating positive community and social value and have a long-standing commitment to measuring and improving the well-being of Australians."},"peter.bouhlas@bankwest.com.au":{"simplified_title":"General Manager","simplified_name":"Bankwest","industry":"Banking","spoken_industry":"banking","type_of_bank":"Full-service bank","news":"Bankwest is offering customers the chance to win a double pass to the AFL Grand Final, along with two return flights with Virgin Australia from their nearest Australian capital city and two nights at the Grand Hyatt Melbourne.","notable_details":"Bankwest is a division of Commonwealth Bank of Australia. They offer a unique benefit called 'Bankwest customer perks' which provides access to exclusive offers, discounts, and tickets with RAC Arena, Optus Stadium, and the Freo Dockers.","focus":"Full service, with offerings ranging from home loans, savings account, and credit cards. The bank is also focused on providing flexible banking services to both personal and business customers.","summary":"Bankwest, a division of Commonwealth Bank of Australia, is a full-service bank that offers a range of products and services to both personal and business customers. The bank focuses on flexibility, offering customers the ability to choose the features they need in their home loan and savings accounts. They also offer unique customer perks such as exclusive offers, discounts, and tickets with RAC Arena, Optus Stadium, and the Freo Dockers. The bank is committed to being there for their customers during difficult times, offering multiple ways to bank and manage accounts. Their recent news includes a competition offering customers the chance to win a double pass to the AFL Grand Final."},"jboyle@liberty.com.au":{"simplified_title":"CEO","simplified_name":"Liberty Financial","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Non-bank lender","news":"Not provided in the website content","notable_details":"Liberty is a B Corp certified lender, with a specific focus on supporting free thinkers from diverse backgrounds. They also champion women in sport and have partnered with fintechs such as Moula and MoneyPlace to offer more flexibility and innovation to their customers.","focus":"Full service lending","summary":"Liberty is a non-bank lender that has been operating for over 25 years. Their focus is on providing free-thinking loans and they have helped over 700,000 customers by advancing more than $30 billion in funds. Liberty offers a variety of flexible and customisable products for home, car, business and personal needs, and aims to extend financial opportunities to individuals from all walks of life. They are proudly B Corp certified and are committed to making a difference beyond just lending. They have also partnered with innovative fintechs to offer even more flexibility and innovation to their customers."},"justin.moffitt@macquarie.com":{"simplified_title":"GCIO","simplified_name":"Macquarie","industry":"financial services","spoken_industry":"finance services","type_of_bank":"global financial services organisation","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy"],"notable_details":"54 years of unbroken profitability, 20,500+ employees globally, $A870.8 billion assets under management","focus":"Empowering people to innovate and invest for a better future","summary":"Macquarie is a global financial services organisation with Australian roots, working across 34 global markets. They aim to create positive social impact by empowering people to innovate and invest for a better future. With a diverse team of experts, they bring fresh perspectives to the finance industry. The bank has a strong track record of unbroken profitability for 54 years, managing assets worth $A870.8 billion. They value a workplace that embraces different views and ideas, and they are committed to identifying unmet community needs and finding long-term solutions to meet them."},"renee.walsh@macquarie.com":{"simplified_title":"COO","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Commercial Bank","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy"],"notable_details":"Macquarie Bank has a track record of unbroken profitability and is operational in 34 markets globally. They have over $A870.8 billion in assets under management.","focus":"Full Service","summary":"Macquarie Bank is a global financial services organisation with Australian roots, operating in 34 markets. They aim to create positive social impact by empowering people to innovate and invest for a better future, offering a track record of unbroken profitability. With a diverse team of experts, they offer a range of financial services and have a strong commitment to inclusivity in the workplace. They are focused on long-term solutions to meet unmet community needs."},"colin.kabaara@macquarie.com":{"simplified_title":"Head of Architecture","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Full-Service Bank","news":"They recently showcased their presence and 33 years of growth, innovation, and collaboration in Europe, the Middle East, and Africa at their 2022 Operational Briefing. They are also focusing on deepening their commitment to Italy, advancing economic progress through the private sector's role in connecting communities with capital and innovation, and accelerating the future of UK energy.","notable_details":"Macquarie Bank has a track record of 54 years of unbroken profitability, and they manage assets worth over $A870.8 billion. They are a global financial services group operating in 34 markets globally with over 20,500 employees.","focus":"Macquarie focuses on creating a positive social impact by empowering people to innovate and invest for a better future. They are a global financial services organization with a strong Australian heritage.","summary":"Macquarie Bank is a full-service bank with a vision to create a positive social impact through innovation and investment. With a strong Australian heritage, Macquarie operates in 34 global markets and has a track record of 54 years of unbroken profitability. They manage assets worth over $A870.8 billion and employ over 20,500 people globally. Their focus is not only on financial growth but also on empowering their employees and contributing to the betterment of the communities they operate in."},"joanne.pickhaver@macquarie.com":{"simplified_title":"COO","simplified_name":"Macquarie","industry":"financial services","spoken_industry":"financial services","type_of_bank":"Full-service bank","news":"Macquarie Bank has recently deepened its commitment to Italy and is also focusing on advancing economic progress through the private sector's role in connecting communities with capital and innovation. They are also accelerating the future of UK energy.","notable_details":"Macquarie Bank operates in 34 markets globally and has a track record of 54 years of unbroken profitability. The bank manages $A870.8 billion assets and has more than 20,500 employees worldwide. The bank has also showcased its presence and 33 years of growth, innovation, and collaboration in Europe, the Middle East, and Africa during their 2022 operational briefing.","focus":"Full-service banking with a focus on empowering people to innovate and invest for a better future. They value diversity and uniqueness in their workplace and are committed to social impact and sustainability.","summary":"Macquarie Bank is a full-service bank with an Australian heritage operating globally in 34 markets. With a track record of 54 years of unbroken profitability, the bank manages $A870.8 billion in assets and employs over 20,500 people. The bank's focus is to create positive social impact by empowering people to innovate and invest for a better future. They value diversity and unique perspectives, fostering an environment where different views and ideas are embraced. In addition to their commitment to social impact, Macquarie Bank is also dedicated to sustainability and advancing economic progress."},"crystal.hanna@macquarie.com":{"simplified_title":"Head of Product Management","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Global Financial Services Organisation","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy"],"notable_details":"Macquarie has an Australian heritage and operates in 34 markets globally. They have a record of unbroken profitability for 54 years.","focus":"Empowering people to innovate and invest for a better future, with a strong commitment to social impact and diversity within the workplace. The bank also focuses on engaging with the private sector to advance economic progress and connect communities with capital and innovation.","summary":"Macquarie is a global financial services organisation with Australian roots, operating in 34 international markets. They have a strong commitment to creating positive social impact by empowering people to innovate and invest for a better future. Their work environment values uniqueness and embraces diverse views and ideas. They offer their investors a track record of unbroken profitability and have a strong focus on advancing economic progress by partnering with the private sector and connecting communities with capital and innovation. The bank also takes interest in accelerating the future of UK energy and deepening its commitment to Italy."},"evan.hinchliffe@macquarie.com":{"simplified_title":"Industry Lead","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Global Financial Services Organisation","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy","At our 2022 operational briefing, we showcased our presence and 33 years of growth, innovation and collaboration in Europe, the Middle East and Africa."],"notable_details":"Macquarie has a global presence, operating in 34 markets. They have a track record of unbroken profitability for 54 years and manage over $A870.8 billion in assets. They are committed to creating a positive social impact and value diversity in the workplace. They empower their employees to identify community needs and use their expertise to find long-term solutions.","focus":"Investment, Innovation, Social Impact","summary":"Macquarie Bank is a global financial services organisation with roots in Australia, operating in 34 markets. Their focus is on creating a positive social impact by empowering people to innovate and invest for a better future. They have a strong commitment to diversity and inclusivity in the workplace. They strive to connect communities with capital and innovation, and are dedicated to advancing economic progress. They have a consistent track record of profitability and manage a significant volume of assets. Macquarie's vision is to use their specialist expertise to meet unmet community needs and contribute to a better future."},"richard.mchutchison@macquarie.com":{"simplified_title":"Product Director","simplified_name":"Macquarie","industry":"Financial Services","spoken_industry":"financial services","type_of_bank":"Global Financial Services Organisation","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy"],"notable_details":"The bank has a track record of unbroken profitability for 54 years, with $A870.8 billion assets under management and a diverse team of 20,500+ employees globally.","focus":"Investment and Innovation","summary":"Macquarie Bank is a global financial services organisation with Australian heritage, operating in 34 markets. The bank focuses on creating positive social impact by empowering people to innovate and invest for a future. With a track record of unbroken profitability, the bank is committed to valuing uniqueness and embracing diverse views and ideas in their workplace. They are dedicated to deepening their commitment in various regions, advancing economic progress, and accelerating the future of energy."},"andrew.giovanni@macquarie.com":{"simplified_title":"Executive Director","simplified_name":"Macquarie","industry":"financial services","spoken_industry":"financial services","type_of_bank":"financial services bank","news":["Deepening our commitment to Italy","Advancing economic progress – the private sector’s role in connecting communities with capital and innovation","Accelerating the future of UK energy"],"notable_details":"The bank has a track record of unbroken profitability and operates in 34 markets globally. They are committed to creating a positive social impact and empowering people to innovate and invest.","focus":"full service","summary":"Macquarie Bank is a global financial services organization with Australian roots. They operate in 34 markets and have a track record of unbroken profitability. Their goal is to create a positive social impact by empowering people to innovate and invest for a better future. They value diversity in the workplace, and believe in embracing different views and ideas. Macquarie is committed to expanding their presence in Europe, the Middle East and Africa, and are dedicated to deepening their commitment to Italy, advancing economic progress and accelerating the future of UK energy. "},"neal@moneyme.com.au":{"simplified_title":"CFO","simplified_name":"MoneyMe","industry":"Banking","spoken_industry":"banking","type_of_bank":"Digital Bank","news":"The bank was recently awarded the Canstar's Innovation Excellence Award in 2022.","notable_details":"This bank has a strong focus on sustainability, offsetting carbon emissions equivalent to driving 15,500,000 kilometers to date. They also offer a free credit score tool for customers.","focus":"Fintech, Lending","summary":"MoneyMe is a 100% digital bank, dedicated to making credit faster, easier, and more seamless for its customers. The bank focuses on lending for life's big and small moments, offering loans and credit cards. The bank boasts of a bank-beating experience by providing personalised rates without any extras and approving loans in minutes. Their services are accessible through an all-in-one app, allowing customers to apply and manage their accounts at their convenience. MoneyMe also prioritizes sustainability, offsetting a significant amount of carbon emissions. They recently won Canstar's Innovation Excellence Award in 2022. Their vision is to make credit more accessible and manageable for their customers, offering tools to understand credit ratings and options for consolidating existing debt."},"svassallo@unitybank.com.au":{"simplified_title":"General Manager Business Banking","simplified_name":"Unity Bank","industry":"Banking","spoken_industry":"banking","type_of_bank":"Unavailable","news":"Unavailable","notable_details":"The bank has a wide network of branches across various locations. It also provides the option for customers to cancel ATM transactions without incurring fees if the ATM owner charges a fee.","focus":"Unavailable","summary":"The website does not provide specific details about the type of bank, its vision, goals, or focus areas. However, it shows that the bank has a wide network of branches across various locations. It also has a customer-friendly policy regarding ATM usage, where customers are given the option to cancel transactions without incurring any fees if the ATM owner charges a fee."}}